[
    {
        "title_de": "Angewandte Ingenieurmathematik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden besitzen ein fundiertes Verständnis der mathematischen Grundlagen, soweit sie für komplexe Ingenieuraufgaben benötigt werden. Im ersten Teil haben die Studierenden das mathematische Grundlagenwissen erworben. Aus dem zweiten Teil sind sie zur Beherrschung der Vektoranalyse und der Tensorrechnung befähigt. Im dritten Teil haben sie die Kompetenzen der Differentialgleichungen erlangt. Die Studierenden sind in der Lage, die mathematischen Grundlagen, die in den Ingenieurwissenschaften benötigt werden, sicher anzuwenden. Dies betrifft insbesondere analytische Abschätzungen im Rahmen von komplexen Simulationen und deren Ergebnisse sowie der kritischen Reflexion. - Im Rahmen des Moduls haben die Studierenden die Kompetenz erworben, komplexe Simulationsergebnisse kritisch zu überprüfen und in verschiedenen Teildisziplinen des Maschinenbaus im betrieblichen Umfeld aktiv zu nutzen."
    },
    {
        "title_de": "Höhere Festigkeitslehre und Werkstoffmechanik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben ein vertieftes Verständnis für die mechanischen Eigenschaften moderner Werkstoffe erworben und können deren sinnvolle Ausnutzung im Konstruktionsprozess aufzeigen. Sie haben ein erweitertes Wissen sowohl in der Festigkeitslehre als auch in der Werkstofftechnik. Dies betrifft Grundlagen und Lösungsmethoden der Elastizitätstheorie, elastisch-plastischer Beanspruchung von Konstruktionen, Lösungsmethoden der Plastizitätstheorie, Schädigungsmodelle und rheologe Eigenschaften, Modelle und die Anwendung in ausgewählten Problemen der FEM. Ihr vertieftes und detailliertes Wissen können sie an ausgewählten Themen darstellen. Sie sind befähigt zur interdisziplinären Analyse und Lösungsfindung sowie der Bewertung der Lösungen bei Entwicklungs- und Konstruktionsaufgaben beispielsweise im Leichtbau. Die Studierenden können systematisch und wissensbasiert bei der Bewältigung sowohl komplexer als auch vollkommen neuartiger Aufgaben der F&E in Materialanwendungen vorgehen. Sie können die Materialauswahl und -nutzung kritisch im fachlichen Kontext reflektieren und bringen ihre Fähigkeit zum Wissenstransfer in Problemlösungen zur sicheren Bauteilauslegung und zu Fertigungsprozessen ein. - Die Studierenden haben ein geschärftes Bewusstsein für einen ressourcenoptimierten Umgang mit Werkstoffen als Beitrag zum globalen Umweltschutz und bringen dieses Bewusstsein in die Auslegung von Bauteilen im betrieblichen Alltag ein. Sie nutzen die relevanten Zusammenhänge und Einsparpotentiale zur optimalen Auslastung beim Einsatz von Konstruktionswerkstoffen. Die Studierenden sind weiter zu einer sicheren, fachlich korrekten und verständlichen Kommunikation im betrieblichen Alltag in der Lage, auch im globalisierten Umfeld."
    },
    {
        "title_de": "Angewandte Thermodynamik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die Grundlagen der modernen Kälte-, Klima- und Wärmepumpentechnik und können diese darstellen und erläutern. Sie können Vor- und Nachteile von Anlagen beschreiben, diese hinsichtlich einer gegebenen Anwendungssituation vergleichend beurteilen und die günstigste Variante angeben. Die Studierenden können weiter ihr Wissen hinsichtlich der Auslegung von neuen Anlagen anwenden. Die Studierenden sind mit Abschluss des Moduls in der Lage, für ausgewählte Anwendungsfälle im Bereich Kälte- und Klimatechnik sowie bei Wärmepumpen angemessene Lösungen auszuwählen, zu entwickeln und anzuwenden. Sie sind in der Lage, neue Anlagen zu entwickeln, indem sie bestehende Komponenten auswählen und deren Zusammenspiel korrekt einschätzen und überprüfen. - Die Studierenden sind in der Lage, sich bei technischen Fragestellungen in der beruflichen Praxis aktiv an Diskussionen zu beteiligen sowie Probleme selbstständig zu bearbeiten und zu lösen. Die Studierenden können die eingesetzten Betriebsstoffe hinsichtlich der Akzeptanz und Umweltbeeinträchtigung bewerten. Sie sind zudem in der Lage, den Einsatz von Wärmepumpen fundiert darzustellen und ihre Sichtweise zu vertreten."
    },
    {
        "title_de": "Product Lifecycle Management",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben ein vertieftes Wissen zur Anwendung und Bewertung der Werkzeuge der CAx, ERP-Systeme sowie ein fundiertes Verständnis organisatorischer und prozessorientierter Fragestellungen im Unternehmen. Nach Besuch des Moduls sind die Studierenden in der Lage, die Prozesse des PLM im Unternehmen zu erläutern. Sie haben ein vertieftes Wissen zu den behandelten Systemen. Die Studierenden können im fachlichen Kontext und in beruflichen Anwendungsfeldern relevante Methoden anwenden, reflektieren und weiterentwickeln. Die Studierenden können Aufgaben selbstständig bearbeiten, Lösungswege präsentieren und in Gruppen diskutieren. Die Absolventinnen und Absolventen können in beruflichen Situationen angemessen, authentisch und erfolgreich in übergreifenden Prozessen eines Unternehmens agieren."
    },
    {
        "title_de": "Methoden der Produktentwicklung",
        "ects": 5,
        "learning_outcomes_de": "Nach dem erfolgreichen Absolvieren des Moduls haben die Studierenden die Kompetenz erworben, Produktentwicklungsmethoden zu beschreiben, zu vergleichen sowie effektiv und selbständig anzuwenden. Sie sind befähigt, technische Produkte zu analysieren und daraus zielführende Optimierungsmaßnahmen abzuleiten. Beim Bearbeiten großer Entwicklungsaufgaben können sie sich an einschlägigen Vorgehensmodellen wie der VDI-2221 oder dem V-Modell orientieren und die damit verbundenen Methoden situationsgerecht anwenden. Die Studierenden können die Methoden der Produktentwicklung situationsadäquat einsetzen und gegebenenfalls anpassen. Sie sind in der Lage, ihre eigenen Aufgaben im Rahmen der Produktentwicklung zu analysieren, Anforderungen abzuleiten und sich zusätzlich erforderliches Wissen selbstständig anzueignen. Sie sind befähigt, Ergebnisse und Vorgehensweisen kritisch zu reflektieren und können daraus Folgerungen für weitere Schritte ableiten und umsetzen. Zudem können sie ihre Lösungen verständlich und fachlich einwandfrei präsentieren und diskutieren. Die Studierenden sind in der Lage, im Rahmen des Entwicklungsprozesses im interdisziplinären Team auch fachübergreifend zusammenzuarbeiten und Anforderungen und Denkweisen anderer Fachgebiete einzubeziehen. Sie beachten für Produktentwicklungen verschiedene Rahmenbedingungen (insbesondere auch Kosten- und Umweltverantwortung). Die Studierenden haben umfangreiches Methodenwissen der Produktentwicklung gesammelt und sind in der Lage, dies im beruflichen Umfeld anzuwenden. Da die Vermittlung der Methoden anhand eines realen und komplexen Beispielsystems erfolgt, können sie die Systematik der Produktentwicklung im Allgemeinen, sowie die vermittelten Methoden im Speziellen auch für die Projektbearbeitung in andere Bereiche übertragen."
    },
    {
        "title_de": "Innovationsmanagement",
        "ects": 5,
        "learning_outcomes_de": "Nach erfolgreichem Abschluß des Moduls sind die Studierenden befähigt, die strategische Bedeutung von Innovationen und einer Innovationskultur sowie die Prozesse und Werkzeuge eines innovativ ausgerichteten Unternehmens zu erläutern. Sie können die Vor- und Nachteile der verschiedenen Prozesse und Werkzeuge vergleichend darstellen und für eine gegebene Situation die geeignete Vorgehensweise begründet auswählen. Ihnen ist die Bedeutung der zentralen Funktion des Innovationsmanagements als Werkzeug für eine zielgerichtete Produktentwicklung bewusst. Die Studierenden sind sensibiliert für das innerbetriebliche Spannungsfeld unterschiedlicher Interessensgruppen im Innovationsbereich. Die Studierenden können die Methoden für das Einordnen und insbesondere das Bewerten von Ideen hinsichtlich einer Eignung für ein marktfähiges Produkt oder sogar einer Innovation anwenden sowie die Einordnung seines Innovationsgrades vornehmen. Für eine gegebene unternehmerische Situation können sie grundlegende Aspekte zur Etablierung eines Innovationsmanagements in einem Unternehmen begründet vorschlagen. - Die Studierenden können die Werkzeuge aus dem Innovationsmanagement im betrieblichen Alltag nutzen, um in den Basisbereichen wie z. B. Fertigungstechnik, Werkstoffkunde oder Konstruktionstechnik die Innovativität einzuschätzen und die Projektziele dementsprechend zu priorisieren."
    },
    {
        "title_de": "Mechatronische Systeme in der Anwendung",
        "ects": 5,
        "learning_outcomes_de": "Nach Besuch des Moduls sind die Studierenden in der Lage, sowohl die wesentlichen Ansätze der mechatronischen Systembetrachtung zu verstehen, Strukturen zu erkennen, Anforderungen zu analysieren und Konfigurierungsvarianten zu erstellen, als auch technisch und kommerziell zu bewerten. Sie können Bauarten und Steuerungen/Regelungen von Industrierobotern und die externen und internen Hardwarekomponenten und Hardwarestrukturen von Mikroprozessorsystemen erkennen und verstehen. Sie wenden mechatronische Ansätze mit Hilfe von Mikrokontrollern an. Sie sind befähigt, im Labor die technischen Grundlagen der mechatronischen Systembetrachtung in der praktischen Anwendung umzusetzen. Die Studierenden kennen die spezifischen Fachtermini und sind in der Lage, diese kontextbezogen zu verwenden. Die Studierenden können abstrakte, auf Modellen basierende Lösungsverfahren verstehen und anwenden. Im Rahmen von Laborübungen haben sie die Kompetenz erlangt, programmiertechnische Lösungen, auf Basis von Microcontrollern, zu erstellen. Die Studierenden sind in der Lage, mechatronische Aufgabenstellungen nachzuvollziehen und selbstständig einfache Problemstellungen zu lösen und die Ergebnisse, in Form eines Berichtes, darzustellen. Außerdem lernen die Studierenden, umfangreiche Fragestellungen systematisch aufzuteilen und arbeitsteilig zu lösen. Die Studierenden sind in der Lage, in der Praxis themenspezifisch mit Fachleuten zu kommunizieren und allgemeine, grundlegende Problemstellungen der Mechatronik im Team zu diskutieren und zu verstehen."
    },
    {
        "title_de": "Schwingungslehre und Vibrationserprobung",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die Gesetzmäßigkeiten zur Beschreibung und Analyse von Systemen, die Schwingungen ausgesetzt sind erläutern. Auf Basis des Fachwissens sind sie in der Lage, Systeme zu analysieren und auzulegen, dass negative Auswirkungen von Schwingungen vermieden werden. Dies umfasst auch die Gebiete der Technischen Akustik und NVH (noise vibration harshness) in Zusammenhang mit Kraftfahrzeugen. Die Studierenden beherrschen die komplexe Vorgehensweise zur Vibrationserprobung von Systemen. Aufgrund der dadurch erzielten Ergebnissen sind in der Lage, Systeme konstruktiv so auszulegen, dass die Schwingbelastungen nicht zu Schäden führen. Dadurch wird ein Beitrag zur Reduzierung der volkswirtschaftlichen Schäden durch Schwingungsschäden geleistet. Die Studierenden sind in der Lage, Methoden und Techniken zur Analyse und Erprobung von Schwingungssystemen anzuwenden und weiterzuentwickeln. Dadurch können sie die Auswirkungen von Änderungen an Schwingungssystemen einschätzen. Sie sind in der Lage, die Auswirkungen von Schwingungen abzuschätzen und Systeme robust zu konstruieren. - Auf Basis des vertieften Faktenwissens sind die Studierenden befähigt einen guten Gesamtüberblick zu den Themen Schwingungslehre und Vibrationserprobung zu haben und ihr Wissen in Fragestellungen der beruflichen Praxis aktiv zu nutzen."
    },
    {
        "title_de": "Innovativer Leichtbau",
        "ects": 5,
        "learning_outcomes_de": "Nach dem erfolgreichen Absolvieren des Moduls sind die Studierenden befähigt, auf Basis eines fundiertenLeichtbauwissens bestehende Produkte und Systeme zu analysieren und diese nach Gewicht und Kosten zuoptimieren sowie neue innovative Leichtbaulösungen zu entwerfen und diese bis zum Zielprodukt zurealisieren. Die Studierenden sind in der Lage, klassische Werkstoffe wie Leichtmetalle oder Kunststoffeeinzusetzen. Die Studierenden können aus der Vielzahl von Kunststoffen, geeignete Werkstoffe fürindividuelle Aufgabestellungen kompetent auswählen. Bei der Auswahl der Werkstoffe sind die Studierendenin der Lage, Nachhaltigkeitsaspekte als Kriterien zu nutzen. Aufgrund ihrer Kenntnisse über dieherausragenden Materialeigenschaften können sie zudem die Nutzung von CFK-Materialien in der Luft- undRaumfahrt, im Automobilbau und im Maschinenbau einschätzen. Sie sind befähigt, Leichtbaulösungenganzheitlich entlang des Produktentstehungsprozesses sowie entlang des gesamten Product Life Cycle zuentwickeln. Die Studierenden können in interdisziplinären und interkulturellen Teams Problemstellungen zielgerichtet und strukturiert unter Einsatz von methodischen Werkzeugen (wie z. B. PM-, QM-Tools, Kreativitätstechniken, Mindmapping und Nutzwertanalyse) lösen. Sie sind in der Lage, für eine vorgegebene Aufgabenstellung eine ganzheitliche Projektstruktur aufzubauen und eine innovative Leichtbaulösung unter Berücksichtigung von Kosten, Zeit und Qualität zu realisieren. Die Studierenden sind in der Lage, ihre Ideen und Lösungen im Team zu diskutieren und aufeinander abzustimmen sowie anschließend die Ergebnisse in Diskussionen mit Kommiliton*innen zu vertreten, die Resonanz der Diskussionen zu reflektieren und in Optimierungsschleifen einzusetzen. Die Studierenden sind in der Lage, auf Basis des erworbenen Fachwissens verantwortliche Aufgaben imLeichtbau-Bereich in der betrieblichen Praxis zu übernehmen. Sie berücksichtigen den Einflusspsychosozialer Aspekte beim Übergang von traditionellen Werkstoffen in Faserverbundstoffe in Entwicklungund Produktion, indem sie Qualifikationsmaßnahmen wie Schulungen oder eine Verlagerung in eineigenverantwortliches Handeln einsetzen und die Projekte teamorientiert ausführen. Gleichermaßen sind dieStudierenden befähigt, sich auf Basis der erworbenen aktuellen Forschungsergebnisse in wissenschaftlichenKonferenzen (bspw. Der jährlichen DHBW-Leichtbautagung in Friedrichshafen) zu engagieren. Auf Basiseiner verantwortlichen Werkstoffauswahl können die Studierenden aus den Zielen für nachhaltigeEntwicklung insbesondere einen Beitrag zum Ziel „Nachhaltiger Konsum und Produktion“ leisten."
    },
    {
        "title_de": "Strukturoptimierung mit Finite-Elemente-Methoden",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, die theoretischen Grundlagen der Finite Elemente-Methode darzulegen. Sie können eine lineare Finite-Elemente-Simulation aufsetzen, durchführen und auswerten. Sie können die Grundbegriffe einer simulationsgestützten Optimierung erläutern. Sie haben ein Grundverständnis für die verschiedenen Optimierungsstrategien und sind in der Lage, für eine gegebene Situation die geeignete Optimierungsstrategie auszuwählen und vorzuschlagen. Die Studierenden können die verschiedenen Lösungsmethoden und -techniken einschätzen und sinnvoll einsetzen. Sie können eigenständig eine lineare Finite-Elemente-Simulation aufsetzen, durchführen und auswerten. Dabei können sie ein Finite-Elemente-Modell mit einem Preprozessor oder einer CAD-Geometrie aufbauen und dessen Modellgüte bewerten. Sie können mit dem Finite-Elemente-Modell mit verschiedenen Lösungsverfahren Berechnungen durchführen und die Ergebnisse bewerten. Sie können die Grenzen der Berechnungsmethoden einschätzen und die Sinnhaftigkeit der Berechnungsergebnisse einschätzen. Sie können eine simulationsgestützte Strukturoptimierung selbständig durchführen und dabei die Methoden zielgerichtet auswählen. Die Studierenden können ihren Konstruktionsentwurf selbständig und in Eigenverantwortung bearbeiten. Die Studierenden sind in der Lage, ihre eigenen kreativen Ideen ein in den Konstruktionsentwurf einzubringen, zeigen in hohem Maße konzeptionelles Denken, das in Form einer Präsentation aufbereitet wird. Die Studierenden können einschätzen, für welche Problemstellungen der betrieblichen Praxis die Finite-Elemente-Methode und die Optimierungsverfahren geeignete Lösungsverfahren sind und setzen ihre Kenntnisse aktiv ein."
    },
    {
        "title_de": "Innovationssprünge mit Bionik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen die Grundprinzipien der bionischen Arbeitsweisen. Sie kennen das Portfolio der bionischen Strategien zur Innovationsgewinnung. Die Studierenden können die Struktur und grundlegende Eigenschaften der biologischen Wissensablage beschreiben. Aufgrund ihrer bionischen Sichtweise sind die Studierenden in der Lage, technische Konzepte hinsichtlich ihrer Funktionalität zu bewerten und die Konzepte ggf. zu optimieren. Die Bewertung ermöglicht u.a. die eigenen Projekte für ein effizienteres Zeitmanagement in ihrer Relevanz zu priorisieren. Die Studierenden können für Projekte in ihrem Unternehmen erste praktische Anwendungsmöglichkeiten der Bionik einsetzen. Hierzu nutzen sie ihre Kenntnisse um die Methoden und Werkzeuge des Wissenstransfers vom System Natur zum System Technik. Funktion, Gestalt, Design als 3in1 Strategie der Evolution können die Studierenden konzeptionell abbilden. - -"
    },
    {
        "title_de": "Angewandte Konstruktion",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über vertieftes Wissen in den Themen des Konstruierens und des Erstellens von Fertigungszeichnungen im praktischen Umfeld. Darüber hinaus sind sie mit speziellen und aktuellen Themen des Konstruierens vertraut. Die Studierenden können die Gestaltung von Komponenten, Baugruppen und Maschinen unter den Aspekten Effizienz, Kosten und Funktion vornehmen. Die Studierenden sind in der Lage , das im Bachelorstudium erlernte theoretische Basiswissen anhand praktischer Beispiele zu vertiefen und neue Konstruktionstechniken zu erlernen. - Die Studierenden sind in der Lage, die angewandten Konstruktionstechniken sowie die vertieften und erweiterten Kompetenzen im Bereich der Fertigungszeichnungen in den benachbarten Disziplinen und Schnittstellen der Mechanik wie der Elektronik, der Fertigung, der Montage und dem Marketing im betrieblichen Alltag einzusetzen und so aktiv in diesen Bereichen mitzuwirken."
    },
    {
        "title_de": "Automatisierungstechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die wichtigsten Arten von Automatisierung. Komplexe Probleme der Automatisierungs- und Robotertechnik können von den Studierenden erfasst und bewertet werden. Die Studierenden kennen Aufbau, Komponenten, Funktion und Betriebsverhalten von Roboter- und Automatisierungsanlagen und können die technischen und die gesetzlichen Grundbegriffe fachadäquat anwenden. Die Studierenden sind in der Lage, das Zusammenwirken und Verhalten von Anlagen in der Automatisierungstechnik in komplexen technischen Systemen zu beurteilen. Die Studierenden sind in der Lage, die sozialen und wirtschaftlichen Auswirkungen der automatisierten Montage und Fertigung zu bewerten. Sie verstehen die Auswirkungen von Fertigungsautomatisierung und den Zusammenhang zwischen Automatisierungsgrad und Mitarbeitereinsatz. Die Notwendigkeit zur Balance zwischen Rationalisierung und Anzahl der Beschäftigten wird verstanden und kritisch bewertet. Insbesondere die Auswirkungen von Automatisierung in Bezug auf die Verlagerung von Produktionsstätten in Richtung sogenannter \"Best Cost Countries\" werden in der täglichen Arbeit berücksichtigt und bewertet. Die neuen Entwicklungen von Industrierobotern über CoBots hin zu Servicerobotern werden verstanden und können hinsichtlich Wirtschaftlichkeit, personellen Auswirkungen und gesellschaftlichen Einflüssen gegeneineander abgewogen und bewertet werden. Die Studierenden können die Signifikanz und die Auswirkungen der Automatisierung auf die industrielle Produktionstechnik einordnen und sind in der Lage, entsprechend der Automatisierungsaufgabe die richtigen Prozesse und Maschinen auszuwählen. Mit den erlernten Kompetenzen sind die Studierenden in der Lage, fachspezifisch mit Expert*innen zu kommunizieren und grundlegende Problemstellungen der Roboter- und Automatisierungstechnik im Team zu diskutieren und zu verstehen. Studierende sind in der Lage, Speicherprogrammierbare Steuerungen (SPS) zu programmieren und erfahren den Umgang mit Robotern. - Nach (erfolgreichem) Abschluss des Moduls sind die Studierenden in der Lage, das erworbene Wissen und die Beurteilungsfähigkeit bzgl. Automationssystemen und Roboteranlagen in ihrem betrieblichen Alltag aktiv zu nutzen. Sie haben ein Verständnis für den Einsatz der Automatisierung in modernen Fertigungsbetrieben und können selbständig und im Team Problemlösungen erarbeiten. Die technische und gesellschaftpolitische Einordnung von Industrierobotern, kollaborativen Robotern und Servicerobotern wird verstanden."
    },
    {
        "title_de": "Messtechnik und Prozessstabilisierung",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können geeignete Messverfahren und -prinzipien einordnen und sind in der Lage, geeignete Verfahren zur Lösung von Messaufgaben im Bereich von Maschinen, Prozessen und Prüfstände anzuwenden. Sie können auf Basis geeigneter Messverfahren unterschiedliche Lösungsstrategien entwickeln und bewerten. Quellen von Messabweichungen können von ihnen mathematisch analysiert und kritisch reflektiert werden. Die Studierenden lösen erfolgreich und eigenständig komplexe Messaufgaben oder Problemstellungen im Labor und/oder in Form von ausgewählten Fallbeispielen in Gruppenübungen. Sie sind in der Lage, die jeweils passenden Methoden und Techniken auszuwählen, einzusetzen und ggf. anzupassen. - Die Studierenden können bei der Bewältigung komplexer Messaufgaben und der Stabilisierung von Prozessen in der betrieblichen Praxis Methoden zielführend auswählen und einsetzen."
    },
    {
        "title_de": "Produktionsmanagement",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen sowohl über die erforderliche Wissenstiefe als auch über die Breite, um strategische wie auch operative Entscheidungen in der Produktion und in produktionsnahen Bereichen vorbereiten bzw. treffen zu können. Sie sind in der Lage, die Herausforderungen der Produktion zu erkennen und den Gesamtwertstrom eines produzierenden Unternehmens zu beurteilen. Sie können den Produktionsablauf hinsichtlich seiner Kosten analysieren und bewerten und kennen den Einfluss der Produktion auf die wirtschaftliche Situation des Unternehmens. Die Studierenden sind in der Lage, Strategien zu entwickeln, Potenziale zu erkennen und zu bewerten sowie angemessene Maßnahmen zu erarbeiten. Hierzu steht ihnen ein umfangreicher Methodenbaukasten zur Verfügung, aus dem sich die Studierenden gezielt bedienen können. Sie sind in der Lage, Prinzipien und Methoden beispielsweise der Digitalisierung und des Lean Managements anzuwenden und unter Berücksichtigung von deren Grenzen an die Erfordernisse des Unternehmens und die spezifische Problemstellung zielgerichtet anzupassen. Die Studierenden können beispielsweise im Rahmen der Wertstrombetrachtung selbstständig Lernprozesse definieren und gestalten, Probleme erkennen, Problemlösungen erarbeiten, bewerten und diese präsentieren und nachvollziehbar erläutern. Die Studierenden sind in der Lage, sich innerhalb einer komplexen und globalisierten Arbeitswelt sicher zu bewegen und die gesellschaftspolitisch beeinflussten Probleme beispielsweise von Lieferketten zu erkennen. Sie können veränderte Sachverhalte schnell erfassen und auf diese reagieren. Die Studierenden sind auf die Übernahme von Verantwortung für ihren Kompetenzbereich vorbereitet und können auf wissenschaftlicher Ebene ebenso kommunizieren wie im Shopfloor-Bereich. Die Studierenden können Probleme schnell erfassen, Kaizen-Teams leiten und so die Erarbeitung und Umsetzung von Verbesserungsmaßnahmen aktiv beeinflussen. Sie können das erworbene Wissen nicht nur im Umfeld der Produktion anwenden, sondern auch auf andere Betriebsbereiche übertragen und dort umsetzen."
    },
    {
        "title_de": "Surface Engineering",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über ein vertieftes Wissen zu Verfahren und Anwendungen der Oberflächentechnik und entsprechenden Prüfverfahren. Sie sind in der Lage, Theorie und Praxis in Bezug auf oberflächentechnische Fragestellungen zu kombinieren, um ingenieurmäßige Fragestellungen methodisch grundlagenorientiert zu analysieren, zu beurteilen und zu lösen. Die Studierenden sind in der Lage, eigenständig Lösungen aus den Anforderungen an Bauteile bzw. Baugruppen zu entwickeln und diese auch kritisch zu reflektieren. Die Studierenden sind befähigt, komplexe, wissenschaftliche Aufgabe eigenständig in Arbeitspakete zu untergliedern, ihre Bearbeitung zu planen, und im Team angemessen und zielfu¨hrend aufzuteilen. Sie können den Arbeitsstand fortlaufend verfolgen und die Bearbeitung termingerecht abschließen. Die Ergebnisse stimmen die Teammitglieder aufeinander ab bzw. lassen diese zusammenfließen. Die Studierenden können in beruflichen Situationen in Bezug auf verschiedenste Anforderungen (Korrosion, Verschleiß, Design oder Funktionalität) angemessen und kritisch die Auswirkungen ihrer technischen Lösungen im Hinblick auf das Thema Ressourcenschonung und Nachhaltigkeit reflektieren."
    },
    {
        "title_de": "Additive Fertigung",
        "ects": 5,
        "learning_outcomes_de": "Nach Abschluss des Moduls können die Studierenden unterschiedliche Additive Fertigungsverfahren erläutern und vergleichen. Für unterschiedliche Problemstellungen können die Studierenden das geeignete 3D-Druck-Verfahren begründet auswählen. Bei der Konstruktion von Bauteilen können die Studierenden Design Rules für die unterschiedlichen Verfahren und Werkstoffe berücksichtigen. Die Studierenden können die Verfahren sowohl in technischer als auch wirtschaftlicher Hinsicht bewerten. Für gegebene Aufgabenstellungen können die Studierenden geeignete Verfahren und Werkstoffe anforderungsgerecht auswählen und Bauteile unter Berücksichtigung der Besonderheiten additiver Fertigungsverfahren auslegen. Die Ergebnisse der 3D-Druck-Bauteile werden einer kritischen Überprüfung unterzogen. Die Studierenden sind in der Lage, eine komplexe Aufgabenstellung der additiven Fertigung eigenständig in Arbeitspakete zu untergliedern und zu bearbeiten. Sie können die Ergebnisse ihrer Arbeit darstellen und vor der Kursgruppe fundiert begründen und verteidigen sowie ihre Ergebnisse kritisch reflektieren. Nach Abschluss des Moduls sind die Studierenden in der Lage, sich den Herausforderungen im Bereich der der Additiven Fertigung im betrieblichen Umfeld zu stelllen und aktiv bei der Bearbeitung von Lösungen mitzuwirken."
    },
    {
        "title_de": "Verarbeitungsverfahren und Konstruktion in der Kunststofftechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, Verarbeitungsverfahren und Kunststoffe als Konstruktionswerkstoffe zubewerten und auszuwählen. Sie erkennen die technologischen Zusammenhänge im Bereich derKunststofftechnik und können Trends vorhersagen und bewerten. Die Studierenden können Kunststoffformteile unter Berücksichtigung von wirtschaftlichen, technischen undumwelttechnischen Aspekten auslegen und diese in unterschiedlichen Anwendungsbereichen einsetzen. Siesind in der Lage, optimale Kunststofftechnologie und Verarbeitungsverfahren sowie die konstruktiveAuslegung für den jeweiligen Anwendungsfall festzulegen. - Die Studierenden können mit Kenntnissen der kunststofftechnischen Fertigungsprozesseanwendungsbezogen für Problemlösungen des betrieblichen Alltags Verfahren und Werkzeuge unterwirtschaftlichen Gesichtspunkten und Umweltaspekten auswählen, umsetzen und optimieren."
    },
    {
        "title_de": "Thermische Energietechnik & Regenerative Energien",
        "ects": 5,
        "learning_outcomes_de": "Mit Bestehen des Moduls sind die Studierenden befähigt, verschiedene Arten der \"Energieerzeugung\" aus fossilen und natürlichen Quellen und alle relevanten Energieverbraucher detailliert zu analysieren und bezüglich ihrer Effektivität, Effizienz, Verfügbarkeit und der Auswirkungen auf die Umwelt zu bewerten. Des weiteren sind die Studierenden in der Lage, Zusammenhänge bezüglich apparativen Aufwand, ökonomischen Aufwand und Energieeffizienz zu analysieren und kritisch zu reflektieren. Die Studierenden sind in der Lage, eigenständig strukturierte und logische Problemanalyse- und Problemlösungstechniken auf ausgewählte Fragestellungen der thermischen Energietechnik und der regenerativen Energien anzuwenden und die Ergebnisse kritisch zu hinterfragen. Sie können zudem eine technisch fundierte Bewertung und einen Vergleich verschiedener Energieerzeugungssysteme vornehmen, die im ökonomischen und ökologischen Wettbewerb zueinanderstehen. Auf Basis ihres Fachwissens können die Studierenden eine fundierte Einschätzung der öffentlich geführten Diskussion zur aktuellen und zukünftigen Energiesituation und der Auswirkungen des weltweiten Energiehungers auf die Zukunft unseres Planeten vornehmen. Sie können eine umfassende Diskussion über die extremen Ungleichgewichte des regionalen und territorialen Energieverbrauches und der hieraus resultieren Umweltverschmutzung führen und dabei andere Sichtweisen und Interessen anderer Beteiligten angemessen integrieren. Durch die Diskussion aktueller Beispiele bringen sie hierzu eine geschulte Urteilsfähigkeit mit. Die Studierenden sind in der Lage, für den Energieverbrauch relevante Gegebenheiten und Zusammenhänge sowie die daraus resultierende Umweltbelastung im privaten und betrieblichen Alltag zu erkennen und Maßnahmen zur Verbesserung vorzuschlagen."
    },
    {
        "title_de": "Tribologie",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, die Reibungs- und Verschleißmechanismen von tribologischen Systemen zu beschreiben. Des Weiteren können sie in Gesamtzusammenhängen denken und mit Hilfe von Kenntnissen zur Verschleiß- und Schadensanalytik Tribosysteme verbessern. Sie können so einen Beitrag zur Reduzierung der volkswirtschaftlichen Schäden durch Verschleiß leisten. Die Studierenden verfügen über vertieftes Faktenwissen zu speziellen Themen Reibung, Verschleiß und Schmierung. Die Studierenden können die Methoden und Techniken zur Analyse und Erprobung von tribologischen Systemen anwenden und weiterentwickeln. Sie sind in der Lage, die Auswirkungen hinsichtlich Reibung und Verschleiß von Änderungen an Tribosystemen einzuschätzen. - Die Studierenden sind befähigt, durch den guten Gesamtüberblick zum Thema Tribologie, Entscheidungen im betrieblichen Umfeld zu treffen."
    },
    {
        "title_de": "Fahrzeuggesamtsystem",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, die mechanischen Baugruppen eines Fahrzeugs und deren prinzipielle Funktionsweise zu beschreiben. Sie verfügen über vertieftes Faktenwissen zu speziellen Themen rund um die aktuellen Antriebsarten, der Fahrgestelltechnik und der Fahrzeugkarosserie. Sie besitzen einen guten Gesamtüberblick über alle Techniken rund um das Fahrzeug. Sie sind in der Lage, Wirkungsgrade der aktuellen Antriebsformen der Invidualmobilität zu berechnen. Die Studierende können Methoden zur Analyse, Bewertung und Weiterentwicklung von Fahrzeugen anwenden. Sie sind in der Lage, die Auswirkungen hinsichtlich von Änderungen an Systemen des Gesamtfahrzeuges einzuschätzen. - Die Studierenden können ihr Wissen und ihre Kenntnisse über die spezifische Vorgehensweise zur Auslegung, Analyse und Erprobung von Fahrzeugsystemen einsetzen. Sie sind in der Lage, die übergreifenden Zusammenhänge zu verstehen und situationsangemessen zu handeln. Sie sind dadurch in der Lage, ihr Wissen unter Berücksichtigung von wirtschaftlichen und ökologischen Erfordernissen in Fragestellungen der beruflichen Praxis zu nutzen."
    },
    {
        "title_de": "Elektrische Antriebe",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die Komponenten Elektrische Maschine, Leistungselektronik und Batterie beschreiben. Sie können die fahrzeugspezifischen Antriebsvarianten, Nutzungsprofile und Ladestrategien vergleichend bewerten und fachliche Entscheidungen hinsichtlich der elektrischen Maschinen zu treffen. Mithilfe der Betrachtung des Gesamt-Antriebssystems (Energiefluss, Aufladen, Gewicht, Bauraum, Kosten) sind die Studierenden in der Lage, typische Fragestellungen bzgl. unterschiedlichen Formen der Elektrischen Antriebe zu beurteilen und die unterschiedlichen Stärken und Schwächen der Antriebe miteinander vergleichen. - Die Studierenden haben ein vertieftes Verständnis und eine kritische Urteilsfähigkeit zu übergreifenden Zusammenhängen im Kontext Elektrischer Antriebe, insbesondere bezüglich ihrer Eignung für verschiedene Fahrzeuge erworben. Sie können ihr Wissen auch in ungewohnten Situationen der betrieblichen Praxis anwenden, dieses entsprechend der erlernten Methoden auf neue Arbeitsfelder adaptieren und multidisziplinäre Zusammenhänge erfassen. Die Studierenden sind in der Lage, die Ergebnisse ihrer Arbeit im beruflichen Alltag zu präsentieren und dieses von der Qualität der Arbeit und den Lösungsansätzen zu überzeugen."
    },
    {
        "title_de": "Advanced Driver Assistance Systems",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden wissen um die gesetzlichen Regelungen von Advanced Driver Assistance Systems (ADAS) und kennen die allgemeinen und spezifischen Anforderungen an entsprechende Einrichtungen im Kfz. Die Studierenden können Methoden zur Fahrzeugumfeldwahrnehmung, zur Handlungsplanung und zur Fahrzeugregelung einsetzen, um Funktionen für hochautomatisiertes und vollautomatisiertes Fahren analysieren und entwickeln zu können. Mithilfe der Messung, Analyse und Programmierung mit Werkzeugen zur Analyse und Simulation von Bussystemnachrichten können die Studierenden typische Anwendungen von Fahrerassistenzsystemen im Kfz beurteilen. Sie sind vor dem Hintergrund der gegebenen Erfahrungen in der Lage, Anwendungen im Bereich der Fahrerassistenzfunktionen zu beurteilen und weiterzuentwickeln. Nach dem erfolgreichen Absolvieren des Moduls sind die Studierenden befähigt, komplexe Problemstellungen zu ADAS-Anwendungen selbständig und im Team zu analysieren, in Arbeitspakete aufzuteilen, die Teilergebnisse aufeinander abzustimmen und Lösungsansätze und Ergebnisse zu dokumentieren. Die Studierenden sind nach erfolgreichem Abschluss des Moduls im betrieblichen Umfeld in der Lage, ADAS-Systeme zum Einsatz im Kfz konzipieren und aufbauen zu können, indem sie Verbindungen zu verwandten Fachbereichen in der Sensorik, der Aktorik und in Embedded Systemen im Kfz herstellen. Die Studierenden sind in der Lage, aktiv an der Entscheidungsfindung zur Realisierungen von ADAS-Systemen beizutragen."
    },
    {
        "title_de": "Embedded Systems im Kraftfahrzeug",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben einen Überblick über die verschiedenen elektronischen Systeme im Fahrzeug mit ihren Basis-Funktionen und können diese darlegen. Die Hardwarestruktur und den Aufbau elektronischer Steuergeräte sowie deren Zusammenspiel können sie erläutern. Aufgrund ihrer Kenntnisse der Softwarestruktur, der Entwicklungsprozesse und der Applikationen können sie den Prozessreifegrad kritisch beurteilen. Sie kennen die verschiedenen Netzwerktechnologien und deren Einsatz und können diese in Bezug auf verschiedene Anwendungsszenarien bewerten. Die verschiedene Einsatzgebiete von Embedded Systemen sowie die damit verbundenen Stärken und Schwächen können sie beschreiben. Die Studierenden sind mit Abschluss des Moduls in der Lage, für weitgehend standardisierte Anwendungsfälle in der Praxis die angemessene Methode auszuwählen und anzuwenden. - Aufgrund ihres Wissens über Stärken und Schwächen verschiedener Embedded Systems können die Studierenden diese in ihrem beruflichen Anwendungsfeld in ihrer Eignung einschätzen und lösungsorientiert allein oder im Team anwenden. Sie sind in der Lage, eine Beurteilung hinsichtlich Hardware (Steuergerät, Sensoren, Aktoren), Software (Aufbau, Entwicklungsprozess), Systemsicht (Safety, Security) und Vernetzung (CAN, Ethernet, ...) für ihre berufliche Situation vorzunehmen."
    },
    {
        "title_de": "Elektromobilität",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen gesellschaftliche Veränderungen im Mobilitätsverhalten und den technischen Wandel in der Fahrzeugantriebstechnik. Sie können aktuelle Antriebstechnologien hinsichtlich ihrer Zukunftsfähigkeit, Energieeffizienz, Kosten, Infrastrukturanforderungen, Risiken, Rohstoffbedarfe, Recyclingfähigkeit, Emissionen und Umweltbelastungen bewerten. Die Studierenden können faktenbasiert Mobilitätskonzepten bewerten und einordnen. Die Studierenden verfügen durch die Well-to-Wheel-Betrachtung die Kompetenz typische Fragestellungen bzgl. unterschiedlichen Formen der Elektromobilität zu beurteilen und unterschiedliche Konzepte der Elektromobilität miteinander vergleichen. Die Studierenden können Technologien beurteilen und deren Eignung für die jeweiligen Einsatzzwecke abschätzen. Die Studierenden können komplexe Probleme der Elektromobilität selbständig und im Team bearbeiten und Lösungsansätze im Team diskutieren. Sie können die fachspezifische Ergebnisse der eigenen Arbeit sowohl in einem Referat wie auch als Dokumentation in Form eines schriftlichen Berichts darstellen. Die Studierenden können Mobilitätskonzepte im beruflichen Umfeld der Elektromobilität vergleichend bewerten und Entscheidungen vorbereiten."
    },
    {
        "title_de": "Geschäftsmodelle Elektromobilität",
        "ects": 5,
        "learning_outcomes_de": "DIe Studierende sind in der Lage, die Bedeutung von E-Mobility-Geschäftsmodellen im Kontext der Energiewende zu darzustellen und einzuordnen. Sie können die aktuellen Herausforderungen der Elektromobilitätsbranche sowie deren disruptive Wirkungen auf verschiedene Interessengruppen als Auslöser von Geschäftsmodellinnovationen beleuchten. Die Studierende sind in die Lage, die Perspektiven der handelnden Akteure zu verstehen. Anhand des theoretischen Wissens zu Geschäftsmodellentwicklung und -innovation sind die Studierenden in der Lage, in Planspielen Geschäftsmodelle der Elektromobilität zu entwickeln und die Ergebnisse kritisch zu reflektieren. Die Studierenden sind sensibilisiert für gesellschaftliche und ethische Aspekte elektromobiler Geschäftsmodelle. Sie sind in der Lage, der Sichtweisen der gesellschaftlichen Stakeholder angemessen zu berücksichtigen und eigene Vorgehensweise fundiert zu begründen. Durch die Planspiele sind die Studierende befähigt, bei unterschiedlichen Bewertung von Situationen im Konsens zu handeln. Die Studierenden haben ihre Kompetenzen aus den technisch orientierten Bereichen durch wirtschaftliche, gesellschaftliche und ökologische Kenntnisse erweitert. Diese dienen dazu, Geschäftsmodelle in der Elektromobilität im beruflichen Umfeld ganzheitlich zu analysieren, zu bewerten und zu reflektieren. Auf diese Weise ist das Profil des Studierenden im Kontext der Elektromobilität interdisziplinär abgerundet."
    },
    {
        "title_de": "Mathematische Methoden der Elektrotechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind nach Abschluss des Moduls in der Lage, auf der Grundlage fundierter Kenntnisse mathematischer Methoden in der Elektrotechnik, komplexe Probleme zu analysieren und darzulegen. Sie können theoretische Grundlagen und Anwendungen der Funktionentheorie beschreiben sowie mathematische Methoden zur Behandlung regelungstechnischer Vorgänge, zum Verständnis der Feld- und Potentialtheorie und der Signaltheorie erläutern. Die Studierenden haben mit erfolgreichem Abschluss des Moduls die Kompetenz erworben, eigenständig auf mathematischer Grundlage Modelle strukturell zu entwickeln und diese in konkreten Fragen der elektrotechnischen Praxis anzuwenden. Sie verfügen über rechentechnische Fertigkeiten für elektrotechnische Anwendungen und können in komplexen Aufgabenstellungen Probleme kritisch analysieren, Lösungsstrategien entwickeln und die praktische Umsetzung planen und vorbereiten. Die Studierenden sind in der Lage, anspruchsvolle Aufgabenstellungen der Elektrotechnik - auch im Team - zu analysieren, in angemessene Arbeitspakete aufzuteilen und den Arbeitsstand zu verfolgen. Sie können Teilergebnisse aufeinander abstimmen, Ergebnisse kritisch reflektieren, dokumentieren und einzeln oder im Team präsentieren. Über das Fachgebiet hinaus besitzen die Studierenden die Handlungskompetenz mathematische Methoden einzuschätzen und diese auf der Basis ihres fundierten theoretischen Verständnisses in der betrieblichen Praxis der Elektrotechnik und anderer Ingenieurdisziplinen einzusetzen. Die Studierenden können ihre mathematischen Fähigkeiten anwenden, um sich im Unternehmen zukünftig in die Entwicklung neuer elektrotechnischer Anwendungen zielführend einzubringen."
    },
    {
        "title_de": "Product Lifecycle Management in der Elektroindustrie",
        "ects": 5,
        "learning_outcomes_de": "Studierende können den gesamten Lebenszyklus eines Produktes mit spezifischer Ausrichtung auf die Elektroindustrie beschreiben und kritisch beurteilen. Sie können wirtschaftliche, ökologische, vor allem nicht-technische Aspekte eines Produktes im Rahmen des Lebenszyklus sicher benennen und optimieren. Studierende sind in der Lage, technisches Handeln methodisch zu hinterfragen und zu bewerten und können konkrete Fragestellungen umsetzen. Sie können eigenständig Lösungen entwickeln und zielführende Handlungsempfehlungen geben. Die Teamkompetenz in interdisziplinären Projektgruppen wird gestärkt, insbesondere die Wertschätzung der interagierenden Disziplinen, wie Einkauf, Verkauf, Produktion und Service wird erhöht. Komplexe Problem können selbständig und im Team bearbeitet und Lösungansätze diskutiert werden. Studierende können ökologische und soziale Folgekosten (Arbeitsumfeld) eines Produktes bewerten und sich verantwortungsbewußt an dem Lebenszyklus eines Produktes in jedem Stadium beteiligen und Interessen anderer Beteiligter angemessen berücksichtigen. Aufgrund der erworbenen Kompetenz, wirksam in einem solchen Team zu arbeiten bzw. so ein Team inhaltlich zu führen, sind sie in der Lage, in interdisziplinären Projektteams zu handeln. Studierende sind in der Lage, wirtschaftlich kritische Entscheidungen und Entscheidungspunkte im Produkt-Lebenslauf sicher zu benennen und Handlungsempfehlungen basierend auf vorbildhaften Beispielen und üblichen Vorgehensweisen zu geben. Für komplexe Problemstellungen können multidisziplinäre Zusammenhänge erfasst und gemeinsam mit Expert*innen (auch) aus anderen Fachdisziplinen zukunftsorientierte und nachhaltige Lösungen gefunden werden."
    },
    {
        "title_de": "Elektromagnetische Verträglichkeit",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben nach Abschluss des Moduls die Kompetenz, EMV-Probleme unter Beachtung der einschlägigen Vorschriften und Normen zu erkennen, zu beschreiben und zu analysieren. Sie sind zum Umgang mit gängigen EMV-Messgeräten (insbesondere Spektrumanalyzer) befähigt. Die Studierenden können die Praktikabilität und Grenzen eingesetzten Methoden einschätzen und entsprechend agieren. - EMV-Probleme treten vor allem bei der Interaktion verschiedener elektronischer Systeme auf. Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, zusammen mit Fachabteilungen im Betrieb, mit Fachvertretern und Kunden, diese EMV-Probleme zu lösen."
    },
    {
        "title_de": "Elektromagnetische Felder in der Praxis",
        "ects": 5,
        "learning_outcomes_de": "Studierende können sich aktiv in Planung, Einsatz und Entwurf von elektrodynamische Anwendungsfälle bzw. Produkten, die auf ihrer Wirkung beruhen, beteiligen. Die Studierenden können nach Abschluss des Moduls fundiert Fragestellungen in folgenden Anwendungsgebieten bearbeiten: elektrische Antriebe, schnelle Elektronik-Schaltungen, Leistungshalbleiter, Hochfrequenztechnik. Sie können spezielle elektromagnetische Felder berechnen und die diesbezüglichen physikalischen Hintergründe, mathematische Methoden erläutern, vergleichend gegenüberstellen und anwenden. Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, eigenständig analytisch und mit Simulatonsprogrammen tiefer in Fragestellungen elektromagnetischer Anwendungen einzudringen (Antriebe, elektronische Schaltungen, Leistungshalbleiter, Verarbeitung hochfrequenter Signale, ...), eigenständig mathematische Methoden zu vertiefen (beispielsweise für die Modellierung, Entwicklungswerkzeuge, ...) und für vorgegebene Fragenstellungen die geeignete Methode auswählen. Sie können sich mit Fachvertretern über Fachfragen und Aufgabenstellungen im Bereich der genannten Anwendungsgebiete auf wissenschaftlichem Niveau auszutauschen. - Die Studierenden können ihr Wissen auch auf neue Situationen übertragen und Verbindungen zu verwandten Fachbereichen ziehen, wodurch sie neue Anwendungen und Techniken voranbringen können. Sie können sich an der Lösung von Herausforderungen oder Problemen der betrieblichen Praxis aktiv beteiligen und Lösungsstrategien (mit) entwickeln"
    },
    {
        "title_de": "Hydraulik und Pneumatik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die Bedeutung von Hydraulik- und Pneumatik-Komponenten bewerten und deren Hauptparameter berechnen. Sie können deren Einsatzbereich auswählen, kritisch analysieren und einordnen. Bei technischen Fragestellungen können sie Lösungskonzepte beurteilen und die Kosten für deren Einsatz ableiten. Die Studierenden können Methoden zur Modellierung hydraulischer und pneumatischer Systeme für technische Aufgabenstellungen passend anwenden. Sie kennen die thermodynamischen und fluidtechnischen Methoden und Grundlagen zur Auslegung und kritischen Analyse hydraulischer und pneumatischer Systeme und können diese sachgerecht einsetzen. In der praktischen Anwendung erproben sie einzelne Komponenten im Betrieb und können die zukünftigen Einsatzbereiche in der Praxis abschätzen. Sie sind befähigt dabei Lösungstrategien für herausfordernde Probleme zu entwickeln und anzuwenden. Die Studierenden sind in der Lage, sich fachlich kompetent im Team und mit Fachvertreter*innen über Themen im Bereich Hydraulik und Pneumatik auszutauschen und lösungsorientiert zu kommunizieren. Der ganze Satz: Sie können komplexe Probleme selbständig und im Team bearbeiten und zu den Lösungsansätzen fundiert argumentieren. Die Studierenden können die Anwendbarkeit hydraulischer und pneumatischer Komponenten in gegebenen Aufgabenstellungen der betrieblichen Praxis richtig einschätzen. Sie können fachübergreifend alternative und zukünftige Lösungsansätze kritisch analysieren und auswählen. Sie können aus den entwickelten Lösungstrategien die am besten geeignete Vorgehensweise mit anderen Teammitgliedern kommunizieren, kritisch vergleichen und umsetzen."
    },
    {
        "title_de": "Elektrotechnik Grundlagen und Mathematik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können nach Abschluss des Moduls grundlegende elektromagnetische Feldzusammenhänge verstehen und einordnen, und Ausbreitungsmechanismen von Wellen im freien Raum und auf Leitungen verstehen und mathematisch beschreiben. Die Studierenden verfügen nach Abschluss des Moduls über die Kompetenz, mathematische Methoden für grundlegende elektrostatische und magnetostatische Feldprobleme auszuwählen und einzusetzen. Sie sind in der Lage, Verfahren der elektromagnetischen Feldtheorie auf eine Vielzahl von Problemen der Elektrotechnik anzuwenden sowie die erworbenen Fähigkeiten und Kenntnisse zu nutzen, um elektromagnetische Feldsimulationen durchzuführen und deren Ergebnisse zu bewerten. - -"
    },
    {
        "title_de": "Elektronik und Messtechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben mit Abschluss des Moduls die Kompetenzen erworben, selbständig Lösungen für technische Problemstellungen zu entwickeln und diese systematisch umzusetzen. Sie sind in der Lage, die eigene Vorgehensweise im Entwurf von Systemen bzw. Prozessen kritisch zu reflektieren, zu bewerten und Optimierungspotenziale zu nutzen. Sie kennen elektronische Komponenten, d.h. sie können passive und aktive elektronische Bauelemente, ihre Eigenschaften, Parameter und ihre typischen Anwendungsbereiche sowie Grundschaltungen darstellen und die Gegenkopplung in elektronischen Schaltungen und deren Auswirkungen auf die Schaltungsfunktion und Stabilität beschreiben. Sie können für verschiedene elektronische Laborgeräte die Einsatzbereiche darlegen und bezüglich der Eignung vergleichen sowie die jeweiligen Vor- und Nachteile beschreiben. Die Studierenden wissen um die vielfältigen und unausweichlichen Fehlermöglichkeiten bei allgemeinen Messaufgaben und sind sich der durch das natürliche Rauschen bedingten Grenzen von Messgeräten bewusst. Auf Basis fundierter Kenntnisse über komplexere Wirkungsketten und Strukturen können sie eigenständig elektronische Schaltungen analysieren, dimensionieren, optimieren und kombinieren und Angaben von Genauigkeiten und Auflösungen kritisch hinterfragen. Nach erfolgreichem Absolvieren des Moduls können die Studierenden digitale und analoge Schaltungsrealisierungen untersuchen und Möglichkeiten und Grenzen der Eignung für ausgewählte Anwendungen beurteilen. Sie sind in der Lage, eine Anwendung eigenständig zu realisieren und eine Inbetriebnahme mit Hilfe elektronischer Laborgeräte durchzuführen. - Die Studierenden haben die Fähigkeit erworben, ihr Fachwissen kontinuierlich zu aktualisieren und für die betriebliche Praxis zu nutzen. Sie übertragen ihr Wissen zu Schaltungsrealisierungen und deren Einsatz auf Situationen der betrieblichen Praxis, indem sie die geeignete Schaltungsrealisierung auswählen, umsetzen und in Betrieb nehmen."
    },
    {
        "title_de": "Vertiefung Regelungstechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben nach Abschluss des Moduls ein vertieftes Verständnis und erweiterte Kenntnisse in der klassischen Zustandsregelung von SISO-LZI-Systemen. Sie kennen außerdem weiterführende Methoden und können die theoretischen Kenntnisse in die Praxis umsetzen. Sie können verschiedene Methoden vergleichen und deren Vor- und Nachteile beurteilen. Die Studierenden sind in der Lage, zur Lösung regelungstechnischer Aufgabenstellungen selbständig geeignete Methoden auszuwählen, auf deren Grundlage geeignete Regler zu entwerfen und die erzielten Ergebnisse kritisch zu reflektieren. Die Studierenden sind in der Lage, sich selbständig in regelungstechnische Fragestellungen einzuarbeiten, neue Lösungsansätze zu entwickeln und diese im Team zu vertreten sowie sich mit Fachvertretern fundiert über regelungstechnische Themen auszutauschen. -"
    },
    {
        "title_de": "Modellierung von energietechnischen Anlagen und Systemen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können komplexe technische Fragestellungen im Bereich der erneuerbaren Energien und energietechnischen Systeme selbstständig und systematisch bearbeiten und technische Lösungen kritisch beurteilen. Hierzu kennen sie die wichtigsten Anlagetechniken erneuerbarer Energien sowie anderer elektrotechnischer Energiewandler und können die wirtschaftliche Umsetzbarkeit erneuerbarer Energien in Abhängigkeit der regulatorischen Randbedingungen und der sozialen und ökologischen Auswirkungen ganzheitlich beurteilen. Außerdem können sie die technischen Konsequenzen und das technische Potential beim Einsatz erneuerbarer Energien für eine zuverlässige Energieversorgung in einer intakten, lebenswerten Umwelt in der Praxis ganzheitlich darlegen und bewerten. Die Studierenden können die Chancen, Einschränkungen und Risiken neuer Technologien mittels numerischer Simulationstechniken abbilden und die Ergebnisse kritisch beurteilen. Sie sind befähigt, komplexe Aufgabenstellungen eigenständig, durch eine aufgabengerechte Modellierung, Parametrierung und interdisziplinäre Diskussion der Teilaspekte zu lösen. Hierbei sind die Studierenden in der Lage, auch Teilaufgaben des eigenen Aufgabengebietes im Gesamtkontext der Aufgabenstellung sachgerecht zu bearbeiten, um hinsichtlich der gestellten Randbedingungen zu einer optimalen Lösung zu gelangen. - Die Studierenden sind in der Lage, fundierte Lösungen auf dem Gebiet der erneuerbaren Energien nach ingenieurwissenschaftlichen Grundsätzen zu erarbeiten und vorhandene Konzepte technologisch weiterzuentwickeln. Sie können mit Partnern aus anderen Berufs- und Interessensgruppen im Bereich der erneuerbaren Energien und anderer energietechnischen Fachdisziplinen erfolgreich zusammenwirken und ihre Sicht gegenüber Fachvertreter*innen im Bereich der Energieversorgung und Energiewandlung angemessen vertreten. Sie sind in der Lage, im konzertierten Zusammenspiel mit verschiedenen Fachrichtungsvertreter*innen, zukunftsorientierte und nachhaltige Lösungen zu erarbeiten und sie immer wieder auf neue Situationen anzupassen."
    },
    {
        "title_de": "Prozessleitsysteme",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können industrielle Prozesse und ihre Überwachung beschreiben. Sie können die Bedeutung des Konzeptes Industrie 4.0 und die Verflechtung der virtuellen und reellen Prozesse darlegen. Zudem können sie die Informatik mit der Mikroprozessortechnik als benachbartem Fachgebiet verknüpfen. Sie sind in der Lage, Programmierung und Simulation von Prozessleitsystemen auf Basis speicherprogrammierbarer Steuerungen zu erläutern. Die Studierenden können einschlägige Methoden und Techniken der PLS-Programmierung identifizieren, entsprechend auswählen und anwenden. Sie können zudem komplexe Prozessabläufe durch Simulationen sowohl einzeln auch im Team analysieren und untereinander abstimmen. - Die Studierenden können die Thematik in ihrem Unternehmen selbständig auf dem aktuellen Stand der Technik halten, um somit neue Anwendungen und Technik voranzubringen. Sie können zudem komplexe Prozesse in Teilprobleme gliedern und diese selbstständig auf Basis wissenschaftlicher und praktischer Quellen zukunftsorientiert lösen. Weitere Entwicklungen können sie gemeinsam mit Expert*innen einschätzen und nachhaltige Lösungen finden."
    },
    {
        "title_de": "Numerische Methoden in der Elektrotechnik und künstliche Intelligenz",
        "ects": 5,
        "learning_outcomes_de": "Studierende können numerische Methoden in der Elektrotechnik beschreiben, kritisch bewerten, anwenden und weiter entwickeln. Sie können die kommerziellen Produkte gemäß ihres Anwendungsfalls bewerten und qualifiziert auswählen. Desweiteren können sie einige Methoden der künstlichen Intelligenz beschreiben und für sich anwenden. Die Studierenden können mathematische, numerische Verfahren und solche der künstlichen Intelligenz zur Berechnung, Lösung von Problemen in der Elektrotechnik und im Beruf anwenden und selbst programmieren. Die Studierenden kennen Software-Produkte für o.g. Anwendungen und können diese anwenden. Die Studierenden können selber Algorithmen bewerten und erstellen sowie die für sie angemessenen Produkte und Algorithmen auswählen. - Studierende sind in der Lage, abstrakte mathematisch-numerische Methoden in verschiedenen Bereichen der Elektrotechnik einzusetzen und kritisch gegeneinander abzuwägen. Zudem können sie einfache Algorithmen der künstlichen Intelligenz auf Problemstellungen in der Elektrotechnik übertragen und KI-Projekte bewerten. Sie sind in der Lage, in der weiteren Karriere die Entwicklung der Numerik und der KI zu verfolgen, kritisch zu beurteilen und selbständig in betrieblichen Zusammenhängen zu nutzen."
    },
    {
        "title_de": "Verfahren",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben ein umfassendes Verständnis moderner Kommunikationstechnologien mitdrahtloser Kommunikation über optische Netzwerke erworben. Sie verstehen die verwendeten Baugruppenund Verfahren. Sie können Systeme analysieren, entwerfen und optimieren, basierend auf relevantenStandards und Techniken. Die Studierenden sind in der Lage, Übertragungstechniken und -systeme ganzheitlich zu verstehen und aufkomplexe Probleme anzuwenden. Sie können Messtechniken einsetzen, Systeme simulieren undpraxisorientierte Lösungen entwickeln. Die Studierenden können multidisziplinäre Projekte in der Kommunikationsbranche leiten und effektiv inTeams arbeiten, während sie technologische Entwicklungen kritisch und ethisch reflektieren. Die Studierenden verbinden technisches Wissen mit systematischem Denken, um innovative Übertragungsund Netzwerklösungen zu schaffen und diese an die Bedürfnisse verschiedener Anwendungen anzupassen."
    },
    {
        "title_de": "Drahtlose Kommunikationstechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, drahtlose Systeme zur Verteilung von Informationen realistisch einzuschätzen und sich verantwortungsvoll an der Weiterentwicklung und am Einsatz zu beteiligen. Sie können aktuelle Standards, Verfahren und Techniken der drahtlosen Kommunikationstechnik im Nahbereich (PAN), im mittleren Bereich (Mobilkommunikation) und im Fernbereich (Satellit) bewerten und für die Lösung technischer Probleme begründet auswählen. Studierende sind in der Lage, die Techniken und Systeme auszuwählen, einzusetzen und Methoden und Techniken zu entwickeln. - Studierende können sich aktiv in Planung, Einsatz und Entwurf von drahtlosen Kommunikationssystemen einbringen. Sie können ihr Wissen auch auf neue Situationen in der betrieblichen Praxis wie auch im Alltag übertragen und Verbindungen zu verwandten Fachbereichen ziehen, wodurch sie neue Anwendungen und Techniken voranbringen können."
    },
    {
        "title_de": "Anwendungen moderner Informations- und Kommunikationstechnologien",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können konkrete und aktuelle Technologien und Systeme moderner interdisziplinärer Informations- und Kommunikationstechnologien darlegen und vergleichend erläutern und nutzen hierbei den Bezug zur Elektrotechnik und zur technischen Informatik. Sie ordnen diese Konzepte in die aktuellen Themengebiete \"Internet der Dinge\" bzw. \"Industrie 4.0\" ein und können technische Lösungen und Anwendungen analysieren und kritisch bewerten. Die Studierenden sind in der Lage, zur Bearbeitung komplexer Aufgaben geeignete Technologien und Methoden zu identifizieren, zu verstehen, zu vergleichen und diese auf Anwendungen in verschiedenen Bereichen zu übertragen. Dies beinhaltet Standards, Verfahren und Techniken der Vernetzung für einfache und auch komplexere Applikationen. Sie können die hierzu notwendigen Bestandteile der Informationsverarbeitung und Kommunikation für Anwendungen im Heim und Unternehmen auswählen, prüfen, beurteilen und kritische Punkte erkennen. Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, einzeln und im Team aktuelle Verfahren und Technologien für eine konkrete Problemlösung auszuwählen und zu bewerten. Sie können die technologischen Konzepte vergleichend darstellen und vor dem Kurs anschaulich präsentieren, diskutieren und ihre Meinung angemessen vertreten. Studierende können sich in der betrieblichen Praxis die Technologien in Planung und Betrieb von informationstechnischen Systemen selbständig aneignen, analysieren, beurteilen und eigene Lösungsvorschläge einbringen sowie diese im Team vertreten, diskutieren und gemeinsam umsetzen."
    },
    {
        "title_de": "Planung und Analyse elektrischer Energieversorgungsnetze, Teil I",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können nach Abschluss des Moduls den Aufbau der Netze zur elektrischen Energieversorgung beschreiben. Sie können das Verhalten der Netze erläutern und die beteiligten Komponenten in ihrem Zusammenspiel darlegen. Die Studierenden können elektrische Energieversorgungsnetze und deren Komponenten mit diesbezüglichen Software-Werkzeugen planen und analysieren. Sie nutzen Simulationen zur Planung, Analyse und Auslegung von elektrischen Energieversorgungsnetzen und deren Komponenten und können die Ergebnisse kritisch reflektieren. Hierzu können sie verschiedene Methoden vergleichend hinsichtlich einer gegebenen Situation beurteilen und die situativ am besten geeignete Methode auswählen. Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, den Aufbau und Umbau elektrischer Energieversorgungsnetze und deren Komponenten zu planen und zu projektieren, eigenständig tiefer in Fragestellungen elektrischer Energieversorgungsnetze einzudringen (Erweiterungen und Umbau der Netze, Auswahl von Technologien, ...) und eigenständig mathematische Methoden zu vertiefen (beispielsweise für die Modellierung von Komponenten bzw. spezieller Situationen, z.B. mit weiteren Entwicklungswerkzeugen, ...) sowie sich mit Fachvertretern über Fachfragen und Aufgabenstellungen im Bereich der genannten Anwendungsgebiete auf wissenschaftlichem Niveau auszutauschen. - Über das Fachgebiet hinaus haben die Studierenden die Kompetenz erworben, Anwendungsfälle in der betrieblichen Praxis aus dem Bereich der elektrischen Energieversorgung zu erkennen, fallbezogen zu bewerten und im Kontext der Anwendung Lösungsstrategien zu entwickeln."
    },
    {
        "title_de": "Energieinformationstechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen nach Abschluss des Moduls über fundierte Grundlagen über den Einsatz von ITK-Systemen in elektrischen Energieversorgungsnetzen. Sie können den Aufbau und die Funktionsweise von ITK-Systemen darlegen, analysieren und kritisch vergleichen. Sie haben Kenntnisse über die regulatorischen und normativen Rahmenbedingungen und können Methoden zur Konzeption und zur Beschreibung von Anwendungen aus dem Bereich der elektrischen Energieversorgung erläutern und vergleichend gegenüber stellen. Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, eigenständig tiefer in Fragestellungen bzgl. Anwendungen in Energieversorgungsnetzen einzudringen (Regelungsvorgänge, Umsetzung neuer Anforderungen, Ausbau der ITK-Infrastruktur, Integration bestehender Systeme und Datenbestände, ...), eigenständig Methoden zum Design von Applikationen und Systemen anzuwenden (Modellierung, Entwicklungswerkzeuge, Nutzung weiterer Technologien aus der ITK, ...), sich mit Fachvertretern über Fachfragen und Aufgabenstellungen im Bereich der genannten Anwendungsgebiete auf wissenschaftlichem Niveau auszutauschen. Über das Fachgebiet hinaus haben die Studierenden die Kompetenz erworben, Komponenten und Anwendungsfälle für den Betrieb der Energieversorgungsnetze zu bewerten und im Kontext des Gesamtsystems weiter zu entwickeln. - Studierende können neue Anwendungen und Techniken voranbringen, indem sie Lösungen auf Grundlage des Vergleichs von verschiedenen Methoden auswählen und in diese in (einer) neuen Situation(en) in der Energieversorgung anwenden."
    },
    {
        "title_de": "Erneuerbare Energien",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können komplexe technische Fragestellungen im Gebiet der erneuerbaren Energien selbstständig und systematisch bearbeiten und Lösungen technisch kritisch beurteilen. Hierzu kennen sie die wichtigsten Anlagetechniken erneuerbarer Energien und deren Einsatz in der Energieversorgung. Die wirtschaftliche Umsetzbarkeit erneuerbarer Energien in Abhängigkeit der regulatorischen Randbedingungen und der mit der Umsetzung verbundenen sozialen und ökologischen Auswirkungen können sie ganzheitlich beurteilen. Zusätzlich können sie die technischen Konsequenzen und das technische Potential beim Einsatz erneuerbarer Energien im Netz bewerten. Die Studierenden können die Chancen, Einschränkungen und Risiken neuer Technologien beurteilen und gegenüber Fachvertretern und Aufgabenstellungen im Bereich der Energieversorgung angemessen vertreten. Sie sind in der Lage, fundierte Lösungen auf dem Gebiet der erneuerbaren Energien nach ingenieurwissenschaftlichen Grundsätzen zu erarbeiten und vorhandene Konzepte technologisch weiterzuentwickeln. Die Studierenden können den Einsatz erneuerbarer Energien zur zuverlässigen Energieversorgung in einer intakten, lebenswerten Umwelt in der Praxis ganzheitlich bewerten und auf dieser Basis verantwortungsvoll handeln. Die Studierenden können mit Partnern aus anderen Berufs- und Interessensgruppen im Bereich der erneuerbaren Energien erfolgreich zusammenwirken. Auf diese Weise lassen sich multidisziplinäre Zusammenhänge erfassen und es können zukunftsorientierte und nachhaltige Lösungen gefunden werden."
    },
    {
        "title_de": "Planung und Analyse elektrischer Energieversorgungsnetze, Teil 2",
        "ects": 5,
        "learning_outcomes_de": "Aufbauend auf dem Modul Planung & Analyse elektrischer Energieversorgungsnetze Teil I können die Studierenden nach Abschluss des Moduls den Aufbau der Netze zur elektrischen Energieversorgung beschreiben. Sie können das Verhalten der Netze vertiefend erläutern und die beteiligten Komponenten in ihrem Zusammenspiel darlegen. Die Studierenden können elektrische Energieversorgungsnetze und deren Komponenten mit diesbezüglichen Software-Werkzeugen planen und analysieren. Sie nutzen Simulationen zur Planung, Analyse und Auslegung von elektrischen Energieversorgungsnetzen und deren Komponenten und können die Ergebnisse kritisch reflektieren. Hierzu können sie verschiedene Methoden vergleichend hinsichtlich einer gegebenen Situation, insbesondere der erneuerbaren Energieerzeuger und der Elektrifizierung des Straßenverkehrs, beurteilen und die situativ am besten geeignete Methode auswählen. Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, die in Teil I erworbenen Methoden eigenständig auf die neu kennengelernten Komponenten zu übertragen. Insbesondere können sie Anwendungsfälle im Bereich der erneuerbaren Erzeuger sowie der Elektrifizierung des Straßenverkehrs analysieren und Entscheidungen zum Einsatz der Komponenten treffen. Sie sind in der Lage, ihre Kenntnisse selbständig auf weitere Energieerzeuger zu übertragen. - -"
    },
    {
        "title_de": "Leistungselektronik und Energiespeicher",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können nach Abschluss des Moduls leistungselektronische Schaltungen entwerfen, dimensionieren und analysieren. Aus der Lösungsvielfalt können sie eine hinsichtlich der Aufgabenstellung optimale Lösung auswählen und umsetzen. Hierzu erlernen die Studierenden die Schaltungen der Leistungselektronik und Technologien für Energiespeicher und erlangen Kenntnis der wichtigsten Komponenten und Berechnungsmethoden der Leistungselektronik. Sie können die Eigenschaften der wichtigsten Energiespeicher, der Verlustmechanismen und deren Einbindung in Systeme darlegen, Speichergrößen berechnen, die wirtschaftliche Auslegung bestimmen und das technische und wirtschaftliche Potential abschätzen. Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, Schaltungen der Leistungselektronik und Technologien für Energiespeicher realistisch zu beurteilen und in verschiedenen Zusammenhängen sachgerecht und verantwortungsvoll einzusetzen. Sie sind in der Lage, sich eigenständig tiefer in Problemstellungen mit Komponenten der Leistungselektronik und zur Speicherung elektrischer Energie einzuarbeiten, Lösungen zu entwerfen und umzusetzen. - Die Studierenden können sich mit Fachvertreter*innen über Fachfragen und Aufgabenstellungen im Bereich der Technologien für Energiespeicher auseinandersetzen und ihr Wissen in die betriebliche Praxis übertragen. Sie sind in der Lage, mit Partner*innen aus anderen Berufs- und Interessensgruppen im Bereich der Leistungselektronik und Speicher für elektrische Energie interdisziplinäre Lösungen in der betrieblichen Praxis zu erarbeiten, zu analysieren und zu synthetisieren."
    },
    {
        "title_de": "Funktionale Sicherheit",
        "ects": 5,
        "learning_outcomes_de": "Studierende erkennen wechselseitige Beziehungen von Technik und der Sicherheitstechnik und können diese beschreiben und bewerten. Sie verfügen darüber hinaus auch über vertieftes Theorie- und Anwendungswissen zu den in der Modulbeschreibung aufgeführten Inhalten. Studierende verstehen die Transferierbarkeit der systematischen Durchführung und Analyse physikalischer Experimente und können diese erläutern. Die Studierenden verfügen über das im Modulinhalt aufgeführte Spektrum an Methoden und Strategien zur Erarbeitung komplexer technischer Problemstellungen, aus welchen sie angemessene Methoden finden und anwenden, um zweckmäßige Lösungen zu realisieren. Studierende gehen kompetent mit experimentellen Aufbauten um und besitzen die Fähigkeit zur Reflexion der Aussagekraft experimenteller Ergebnisse. Die Teamarbeit im Rahmen des Moduls befähigt die Studierenden, eigenverantwortlich Teilaufgaben zu übernehmen, abzustimmen und im Team zu vertreten. Sie verfügen über interkulturelle und soziale Kompetenzen und können an wissenschaftlichen Diskussionen mit fundiert vorgetragenen Meinungen teilnehmen. Durch den erarbeiteten Praxisbezug können Realisierbarkeit und Grenzen der eingesetzten Methode erkannt und optimiert werden. Die Studierenden sind in der Lage, Handlungsoptionen aufzuzeigen. Sie sind aufgrund ihrer fundierten Kenntnisse befähigt, sich im Verlauf ihrer weiteren beruflichen Tätigkeit in fortführende Problemstellungen der Sicherheitstechnik selbständig und effizient einzuarbeiten. Sie können sich an fachlichen Diskussionen beteiligen sowie eigene Beiträge beisteuern. Darüber hinaus verfügen die Studierenden über ein ausgeprägtes interdisziplinäres Verständnis."
    },
    {
        "title_de": "FPGA und Hochgeschwindigkeits-PCB-Design",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können auf Basis eines vertieften Verständnisses den Digitalisierungsprozess in der Elektrotechnik erläutern und die Möglichkeiten und Grenzen von FPGAs darlegen und beurteilen. Mit mindestens einer Hardwarebeschreibungssprache sind die Studierenden vertraut und können einfache Anwendungen realisieren. Sie kennen die Herausforderungen bei der Erstellung von Layouts und können Lösungen im Hochgeschwindigkeitsbereich selbständig realisieren. Die Studierenden sind mit Abschluss des Moduls in der Lage, für weitgehend standardisierte Anwendungsfälle angemessene Hilfsmittel wie z.B. Layouttools und Hardwarebeschreibungssprachen auszuwählen und in der Praxis anzuwenden. Sie können Projekte im Team strukturiert und effizient bearbeiten und sind in der Lage selbständig einen beispielhaften Entwurf einer Leiterkarte zu erstellen und zu testen. - -"
    },
    {
        "title_de": "Mikroelektronik und Sensorik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage Grundlagen zu Integrierten Schaltkreisen (ICs) zu erläutern, Herausforderungen bei deren Herstellung darzustellen und unterschiedliche Materialsysteme bezüglich ihrer Eignung für den konkreten Anwendungsfall vergleichend zu beurteilen. Auf Basis fundierter Kenntnisse können die Studierenden den Aufbau und die Funktionsweise ausgewählter Sensoren beschreiben und deren Möglichkeiten und Grenzen aufzeigen. Sie sind mit Abschluss des Moduls in der Lage innerhalb der Mikroelektronik und Sensorik die Theorien in ihrer Komplexität darzulegen und fallweise kostenorientierte Entscheidungen zu treffen. Die Studierenden sind in der Lage, die Techniken und physikalische Prinzipien zu verstehen und ggf. modifiziert auszuwählen und einzusetzen. Für vorgegebene Problemstellungen können sie Lösungsstrategien erarbeiten und begründen sowie die Ergebnisse kritisch reflektieren. - Die Studierenden können ihr Wissen auf neue Situationen der betrieblichen Praxis übertragen, indem sie Sensoren und integrierte Schaltkreise kritisch vergleichen, bewerten und das situativ beste Konzept (z.B. in Bezug auf technische Funktionalität, Wirtschaftlichkeit, Nachhaltigkeit) umsetzen."
    },
    {
        "title_de": "Investition und Finanzierung",
        "ects": 5,
        "learning_outcomes_de": "Investition: Die Studierenden kennen die verschiedenen Arten der Investitionsrechnung (Wirtschaftlichkeitsrechnung). Sie können bewerten, ob die Abgrenzung der Investitionsfragestellung sachlich und zeitlich den betrieblichen Gegebenheiten und Prämissen entspricht. Sie analysieren das Zustandekommen der Inputparameter (bspw. des Cash-Flows) systematisch und auf ihre betriebliche Beeinflussbarkeit hin. Auf der Grundlage vertieften Verständnisses der Anforderungen an Methoden der Wirtschaftlichkeitsrechnung können Studierende aus Projektdaten die für die Wirtschaftlichkeit relevanten Parameter ableiten und so eigene Wirtschaftlichkeitsrechnungen vornehmen, aber auch Wirtschaftlichkeitsrechnungen anderer Parteien sachgerecht prüfen und ggfs. verbessern. Finanzierung: Die Studierenden kennen die Zielkonflikte und Grundformen der Finanzierung. Sie sind damit in der Lage, situationsgerechte Optionen für Finanzierungen zu identifizieren, auszuwählen und kritisch zu bewerten. Die Studierenden lernen, Wirtschaftlichkeitsprüfungen und Finanzierungsentscheidungen eigenständig angemessen zu planen, durchzuführen und die Ergebnisse stakeholdergerecht zu bewerten. Die Studierenden sind in der Lage, die für den Entscheidungs- bzw. Bewertungsgegenstand angemessenen Methoden auszuwählen, ggfs. anzupassen und zu kombinieren, die Einsatzbedingungen kritisch zu prüfen, die Durchführung sachgerecht und ergebnisorientiert zu gestalten und die erzielten Ergebnisse in der Qualität umfassend kritisch einzuschätzen und ggfs. zu verbessern. - Studierende können die erworbenen Kompetenzen im betrieblichen Umfeld direkt einsetzen. Studierende können die Kompetenzen auch an selbst eingebrachten konkreten Fällen aus dem betrieblichen Umfeld einüben."
    },
    {
        "title_de": "Controlling",
        "ects": 5,
        "learning_outcomes_de": "Studierende kennen das moderne Verständnis von Controlling als „Rationalitätssicherung im Unternehmen“ und sind in der Lage, dieses auf betriebliche Gegenstände höherer Komplexität anzuwenden. Sie haben gelernt, je nach Anforderungen des Gegenstandes und des betrieblichen Kontextes die dazu geeigneten Methoden, Konzepte (bspw. Kennzahlen und Kennzahlensysteme), Tools und Prozesse analytisch zu bestimmen und sachlogisch als Controlling-System zusammenzufügen. Die Perspektive einer umfassenden Entscheidungsunterstützung steht dabei im Mittelpunkt. Bei eher operativen Fragestellungen haben die Studierenden gelernt, die Genauigkeit der Abbildung des Controlling-Gegenstandes zu erhöhen und die Beeinflussbarkeit dieses Gegenstands aus WIW-Sicht sachgerecht zu analysieren. Nach erfolgreichem Abschluss des Moduls sind Studierende befähigt, operativ geeignete Controlling-Methoden auszuwählen, ggfs. zu kombinieren und zu modifizieren, den Einsatz zu planen und sachgerecht durchzuführen, die Ergebnisse zu beurteilen, zusammenzufassen, aufzubereiten und stakeholdergerecht zu kommunizieren. Damit werden Studierende befähigt, die Controllingfunktion zu übernehmen und die betrieblich oft erforderliche Zuarbeit zur Controllingfunktion Dritter wirkungsvoller zu leisten. Aus Sicht des Strategischen Managements steht die Entwicklung von systemischen Kompetenzen im Vordergrund: Planung, Kontrolle und Verbesserung sollen als Regelkreis umgesetzt werden können. Da dies immer Schaffung und Verkürzung von Komplexität bedeutet, werden Eigenschaften der Systembildung gründlich reflektiert. - Auf dieser Grundlage sind Studierende nach erfolgreichem Abschluss des Moduls in Zusammenarbeit mit anderen Fachleuten in der Lage, auf der Basis multiperspektivischer Bewertungen von betrieblichen Gegenständen bei nicht immer vollständigen Informationen konkrete Entscheidungsvorschläge situationsangemessen abzuleiten und deren Umsetzung verantwortlich zu begleiten."
    },
    {
        "title_de": "Technisches Risikomanagement",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind nach erfolgreichem Abschluss dieses Moduls qualifiziert, Risiken des Unternehmens, eines Produktes oder eines Prozesses zu analysieren, diese mit geeigneter Software zu modellieren und weiter unter Beachtung des Rendite-Risiko-Kalküls zu beurteilen. Zusätzlich können sie Lösungsansätze des Risikomanagements erarbeiten und simulieren. Bei der Umsetzung von Maßnahmen können die Studierenden dabei systematisch die Methoden der Risikobewältigung anwenden sowie die Grenzen dieser Ansätze beurteilen und deren Auswirkungen quantifizieren. Die Studierenden können Methoden der Risikoanalyse, die Quantifizierung sowie die systematische Umsetzung von zielgerichteten Maßnahmen auch auf andere Bereiche und Problemstellungen übertragen und so Entscheidungen aller Art modellhaft unter Beachtung der Risiken abbilden. - Die Studierenden können praktische und theoretische Problemstellungen der Bewertung der Risiken und deren Reduktion im Unternehmen lösen und datenbasierte Entscheidungen treffen. Sie sind in der Lage, bei zukünftigen Entscheidungen die Datengrundlagen quantitativ beispielsweise mittels Monte-Carlo-Simulationen zu erfassen."
    },
    {
        "title_de": "Fach- und Führungsaufgaben im Einkauf",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben ein modernes Selbstverständnis des Einkaufs (Kundenorientierung, Prozessorientierung, Wertorientierung) verinnerlicht. Sie können spezifische, auf strategische Unternehmens- und Geschäftsbereichs-ziele abgestimmte Einkaufsstrategien entwickeln. Sie berücksichtigen dabei die jeweilige Bedeutung und Merkmale der Beschaffungsobjekte und der internen und externen Beschaffungssituation. Sie wägen Einsparpotenziale und die Gefahr von Versorgungs-, Qualitäts-, Preis- und Nachhaltigkeitsrisiken ab und entwickeln ein situationsgerechtes Mix aus Früherkennung, Prävention und Risikoübernahme. Die Studierenden erkennen und beurteilen die Potenziale der Digitalisierung für die Preisvereinbarungen in langfristigen Lieferverträgen. Die Studierenden setzen einschlägige Methoden zur Klassifizierung von Beschaffungsobjekten, Lieferanten und Beschaffungssituationen ein. Sie analysieren und beurteilen komplexe, dynamische und unsichere Entscheidungssituationen mit Hilfe von Marktforschungsmethoden, Simulation, Scoringmodellen und Business Cases. Die Studierenden identifizieren Verbesserungspotenziale systematisch und erarbeiten selbständig in spezifischen Handlungsfeldern konkrete Maßnahmen. Sie beurteilen Konzeptvorschläge ganzheitlich hinsichtlich Realisierbarkeit und Vorteilhaftigkeit. Sie antizipieren Widerstände und wissen ihnen agumentativ zu begegnen. Sie suchen die Zusammenarbeit mit Kollegen in anderen Fachabteilungen und den Lieferanten, um Konzepte zu entwickeln und umzusetzen. Die Studierenden können ihre Konzepte und Prioritäten gegenüber Vertretern aus anderen Funktionen argumentativ vertreten und verstehen die Anliegen und Argumente der Kollegen aus angrenzenden Fachabteilungen. Die Studierenden setzen sich kritisch mit den sozialen und ökologischen Folgen und Risiken des internationalen Einkaufs auseinander und wägen diese gegen etwaige wirtschaftliche Vorteile ab. Die Studierenden sind mit Compliance-Anforderungen vertraut. Die Studierenden sind fähig und bereit, crossfunktional und interdisziplinär zusammen zu arbeiten. Sie können situationsgerecht und ganzheitlich entscheiden. Sie gestalten die Zusammenarbeit mit internen und externen Kunden und Lieferanten mit dem Ziel, die Gesamtkosten der Supply Chain zu reduzieren, die Qualität der Produkte und den Lieferservice gegenüber dem Finakunden zu verbessern."
    },
    {
        "title_de": "Projektmanagement",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die grundlegenden Charakteristika von Projekten, die Differenzierung in Projektarten, in Organisationsformen und die grundlegenden Projektmanagementprozesse kompetent beschreiben, die standardisierten Strukturkategorien des Projektmanagements diskutieren und auf komplexe Vorhaben abbilden. Außerdem können sie Projektverläufe analysieren und Optimierungspotenziale erkennen und nutzen, den Projektstatus kommunizieren und zielgruppenadäquat präsentieren. Die erworbenen Fachkompetenzen orientieren sich an der üblichen Zertifizierung des PMI „4E“ (Education/ Ethics/ Examination/ Experience) bzw. der GPM/ IPMA „4-L-C“. Aufbauend auf der Basisqualifikation PMI-CAPM oder GPM Basiszertifikat. Das Modul bietet die Basis für eine spätere Zertifizierung als Projektmanger/in. Die Studierenden können Planungsunterlagen von Projekten erstellen und deren Präsentation in Reports, Reviews und Audits sach- und fachgerecht vorbereiten und durchführen. Sie sind in der Lage einschlägige Methoden des Projektmanagements auszuwählen und anzuwenden, Projektteams zu organisieren und Projekte zu evaluieren. Die Studierenden erwerben die Kompetenz, Projekte zu leiten und Projektteams, ohne hierarchische Leitungsfunktion motivierend zu führen. Sie haben gelernt arbeitsteilig im Team zu arbeiten und Zuständigkeiten und Verantwortlichkeiten eindeutig zu formulieren und zu kommunizieren. Sie können Projekte auf Basis internationaler Standards planen und in den betrieblichen Kontext integrieren, Projekte lenken und die Planung dem Projektfortschritt anpassen."
    },
    {
        "title_de": "Personalführung und -management",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind nach erfolgreichem Abschluss des Moduls in der Lage, • Instrumente und Prozesse im Bereich des Personalmanagements zu kennen und zu erläutern • Situationen für den Einsatz der Instrumente und Prozesse Personalmanagements darzulegen und vergleichend gegenüberzustellen • auf Basis ihrer fundierten Kenntnisse über die Zusammenhänge der Personalführung und des Personalmanagements Entscheidungen in Unternehmen situationsspezifische zu analysieren und kritisch zu hinterfragen • unterschiedliche Sichtweisen und Interessen anderer Beteiligter angemessen zu berücksichtigen (Mitarbeiter*in, Führungskraft, HR, Stakeholder) Die Studierenden sind nach erfolgreichem Abschluss des Moduls in der Lage, • Methoden der Personalbeschaffung, Entgeltgestaltung, Personalbindung, Personalentwicklung und Personalführung zu erläutern • für realitätsnahe Situationen passende Methoden begründet auszuwählen, auszugestalten und einzusetzen • Grenzen und Risiken der jeweiligen Methoden situationsspezifisch zu beurteilen - Die Studierenden sind nach erfolgreichem Abschluss des Moduls in der Lage, sich an der Lösung von Herausforderungen oder Problemen der betrieblichen Praxis aktiv zu beteiligen und Lösungsstrategien zu entwickeln."
    },
    {
        "title_de": "Unternehmenssimulation",
        "ects": 5,
        "learning_outcomes_de": "Die Studierende haben vertiefte Kenntnisse in kapitalmarktorientierter Unternehmensführung, Technologie-Roadmapping mit integrierter Businessplanung und Engpassorientierung in Analyse und Anwendung erlangt und können in diesem Kontext Strategien qualitativ und quantitativ ableiten und für komplexe Führungsaufgaben umsetzen. Damit stehen Auswahl-, Anordnungs- und Prioritätssetzungsentscheidungen unter Unsicherheit und im Wettbewerb im Vordergrund, also die klassischen Herausforderungen in der Führung von Unternehmen. Nach diesem Modul sind sie in der Lage, operative und strategische Entscheidungen selbstständig zu identifizieren, zu analysieren und zu priorisieren sowie angemessene und begründete Entscheidungen zu fällen. MIt dem erfolgreichen Abschluss des Moduls sind Studierende selbstständig bzw. kollegial inder Lage, ihr eigenes Tun und die Auswirkungen in der Unternehmenssimulation ausführlich zu analysieren. Sie haben die Fähigkeit erworben, komplexe quantitative und qualitative Business Cases aufzustellen und mit diesen eine strategische Unternehmensentwicklung zu unterstützen. Mit Hilfe des selbst zu schaffenden strategischen Planungsinstrumentariums können Studierende \"ihre\" Unternehmen im direkten Wettbewerb gegeneinander führen. Durch Arbeiten in der Gruppe an komplexen Problemen haben die Studierenden Leadership-Qualitäten erworben. Sie sind in der Lage, komplexe Aufgaben unter Zeit- und Wettbewerbsdruck sowie Informationsarmut in Arbeitspakete zu gliedern und auch die Schnittstellen zwischen diesen Arbeitspaketen zu gestalten. Sie können das eigene Tun und den Handlungsfortschritt in der Gruppe analysieren und in eine zielorientierte Balance bringen. Die Studierenden sind befähigt, im Konfliktfeld der Stakeholderinteressen Entscheidungen mit ethisch-sozialer Relevanz zu treffen. Sie sind durch Reflexion in der Lage, diese Entscheidungen schneller und sicherer zu treffen und Alternativen auch ethisch abzuwägen und sowohl den Plan als auch die ggfs. abweichenden Ergebnisse zielgruppengerecht aufzubereiten und zu präsentieren. Die Studierenden sind befähigt, komplexe Probleme sozial methodengebunden zu adressieren und zu lösen. Durch den integrierenden Charakter dieses Moduls haben die Studierenden ihre Handlungskompetenzen auch außerhalb der \"Komfortzone\" erheblich erweitert."
    },
    {
        "title_de": "Intercultural Business",
        "ects": 5,
        "learning_outcomes_de": "Auf Basis gründlicher Kenntnisse der Landeskunde und interkultureller Zusammenhänge sind die Studierenden in der Lage, die Exkursion mit einem umfassenden Lernhorizont eigenverantwortlich zu planen und vor Ort durchzuführen. Durch die Reflexion ihrer Erfahrungen bei der Exkursion sind die befähigt, in internationalen und interkulturellen Kontexten geschäftliche Kontakte in beiderseitigem Interesse nachhaltig und wirkungsbedacht aufzubauen und zu pflegen und so einen wesentlichen Beitrag bei der Internationalisierung des Geschäfts ihres Unternehmens zu leisten. Die Studierenden können Methoden zur Gestaltung interkultureller Begegnungen wie zum Beispiel das Wert-und-Entwicklungsquadrat zur Analyse und Moderation interkultureller Konflikte einsetzen und reflektieren. Sie prägen die interkulturell sehr bedeutsame Ambiguitätstoleranz und damit die Handlungsfähigkeit im internationalen Rahmen aus. Sie sind in der Lage, Modelle zur Gestaltung internationaler Geschäftsbeziehungen an konkreten Beispielen zu überprüfen und zu analysieren. Sie haben so ihre Fähigkeit gestärkt, derartige Geschäftsbeziehungen situationsangemessen entscheidend und erfolgreich mit zu prägen. Die Studierenden sind in der Lage, eine umfangreiche Exkursion in einen anderen Kulturraum selbstständig und in der Gruppe zu planen, durchführen und zu reflektieren. Die praktische Ausrichtung dieses Moduls befähigt die Studierenden, in vorher unbekannten Kontexten wirkungsvoll Verantwortung auch für andere zu übernehmen. Ihre interkulturellen, analytischen und kommunikativen Kompetenzen werden so erprobt, reflektiert und gestärkt. Mit der erfolgreichen Teilnahme an der Exkursion haben die Studierenden die Fähigkeit erworben und trainiert, auch sachgerecht zu handeln, während sie einer - wenigstens teilweise - fremden Kultur und Situation ausgesetzt sind."
    },
    {
        "title_de": "Entscheidungsfindung",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage Entscheidungssituationen hinsichtlich verschiedener Merkmale zu differenzieren. Sie verstehen die Verfahren der Entscheidungs- und Spieltheorie und können diese begründet situationsspezifischen Entscheidungssituationen zuordnen. Kognitive und verhaltenswissenschaftlichen Gesichtspunkte von Entscheidungssituationen werden reflektiert und Implikationen auf die Gestaltung des Entscheidungsprozesses (z.B. Teilnehmer, Zwischenziele, Methoden) können von den Studierenden abgeleitet werden. Die Studierenden entwickeln ein Verständnis für Methoden und Modelle der Entscheidungsfindung. Dies umfasst • quantiative Verfahren • psychologische Modelle • Prozessmodelle • Methoden des Verhandelns (nach dem Harvard Negotiation Project). Sie sind in der Lage die Methoden und Modelle in komplexen, realen Situationen differenziert und begründet anzuwenden. Die Studierenden sind sich der Fehleranfälligkeit Ihrer Entscheidungen bewusst und sind in der Lage soziale und organisatorische Einflüsse in Entscheidungsprozessen zu erkennen und zu bewerten. Im Zusammenspiel mit Experten unterschiedlicher Fachbereiche, können die Studierenden die Entscheidungsprozesse gestalten und moderieren."
    },
    {
        "title_de": "Internationaler Technischer Vertrieb",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden vertiefen das Wissen aus Marketing und Vertrieb in bestimmten Bereichen der Vermarktung von technischen Produkten und Dienstleistungen und erweitern die Betrachtungsweise auf die internationalen Absatzmärkte. Mit Abschluss des Moduls kennen die Studierenden die wesentlichen Fragestellungen des internationalen technischen Vertriebs und können die vorgestellten Konzepte im internationalen Kontext anwenden. Die Studierenden reflektieren und verstehen die damit einhergehenden interkulturellen Herausforderungen. Die Studierenden sind mit den gängigen wissenschaftlichen Methoden des Eintritts in internationale Märkte und der Bearbeitung internationaler Märkte vertraut. Dies gilt auch für die Organisation und Führung im internationalen Vertrieb und die Verkaufstechniken im internationalen Kontext. Die Studierenden können diese Methoden und Techniken für die Lösung von internationalen betrieblichen Problemstellungen geeignet auswählen und adäquat einsetzen. Insbesondere sind sie mit der Auswahl neuer Märkte im Ausland vertraut. Die Studierenden setzen sich insbesondere im Rahmen der Fallstudie gemeinsam im Team mit der Bearbeitung einer komplexen Fragestellung aus dem internationalen Umfeld auseinander. Sie beschreiben und analysieren die Ausgangssituation und entwickeln in konstruktiver Kommunikation gemeinsam strategische Lösungsansätze. Sie bewerten und präsentieren diese Lösungsansätze. Damit reflektieren die Studierenden das eigene Marketing- und Vertriebswissen an einem konkreten Fall. Die Studierenden haben mit Abschluss des Moduls die Kompetenzen erworben, ihr Wissen und Verstehen auf Fragestellungen im internationalen Marketing und technischem Vertrieb zu transferieren und anzuwenden. Sie können selbstständig strategische und operative Aufgaben in diesen Bereichen übernehmen. Zudem werden die Studierenden in die Lage versetzt, Ihre eigene Position und Meinung zu den Fragestelllungen von Marketing und Vertrieb im internationalen Kontext durch eine fachadäquate Kommunikation argumentativ zu vertreten und im Kollegium und Gremien von der Qualität der Arbeit und den erarbeiteten Lösungsansätzen zu überzeugen."
    },
    {
        "title_de": "Nachhaltigkeit und strategische Unternehmensführung",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die wesentlichen Fragestellungen und Konzepte zum Nachhaltigkeitsmanagement und können diese beurteilen und fundiert darlegen. Sie können die Historie, die wesentlichen Meilensteine internationaler Organisationen und Veranstaltungen sowie verbindliche Regelungen zum Thema Nachhaltigkeit beschreiben und erläutern. Die Studierenden können die Unterschiede von Leitbild, Vision und Mission im Rahmen der strategischen Unternehmensführung darlegen und deren Bedeutung einordnen. Sie können die mit Nachhaltigkeit verbundenen Risiken analysieren und kennen Maßnahmen dazu. Auf Grundlage ihrer Kenntnisse einschlägiger Methoden, insbesondere zur Analyse, können die Studierenden Stärken und Schwächen von Management-Konzepten beurteilen und danach situativ strategische Initiativen ableiten. Sie sind in der Lage Prozesse, Produkte und Dienstleistungen unter dem Aspekt der Nachhaltigkeit zu untersuchen und zu bewerten und konkrete Maßnahmen zur Gestaltung eines Nachhaltigkeitsmanagements, einschließlich Controlling und Abschätzung der Wirkung auf den Markt und die Risikolage, abzuleiten. Sie wenden dazu zielführende Primär- und Sekundärdatenrecherchen an. Die Studierenden haben mit Abschluss des Moduls die Kompetenzen erworben, fachadäquat und zielgruppenkonform zu kommunizieren, sich mit Fachvertretern, Kunden, Projektpartnern und Laien über Informationen, Ideen, Probleme und Lösungen hinsichtlich Nachhaltigkeit und den damit verbundenen Risiken sowie deren Auswirkungen auszutauschen. Sie können die Wirkung ihres Handelns auf das umgebende sozio-ökonomische System einschätzen und die ökologischen sowie sozialen aber auch ökonomischen Auswirkungen ihrer Entscheidungen prognostizieren. Eine kritische Hinterfragung vom Unternehmensziel Wachstum hin zu dauerhaftem vorteilhaftem Wirtschaften sowie das Verständnis EINER Welt ist als Denkweise verankert. Die Studierenden haben mit Abschluss des Moduls die Kompetenzen erworben, ihr Wissen und Verstehen auf in die Entwicklung von Lösungsansätzen in ihrem betrieblichen Umfeld einzubringen und auf Problemstellungen auch außerhalb des Nachhaltigkeitsmanagements und der strategischen Unternehmensführung anzuwenden."
    },
    {
        "title_de": "Agiles Projektmanagement mit Scrum",
        "ects": 5,
        "learning_outcomes_de": "Nach Besuch des Moduls können die Studierenden agile Projektmanagementmethoden, agile Frameworks und Organisationsformen fundiert erläutern. Sie kennen wesentliche Vorteile und Erfolgsfaktoren der Methoden und wissen agile Methoden auch in Projekten ohne eigene Softwareentwicklung anzuwenden. Die Studierenden sind in der Lage, selbständig ausgewählte Situationen auf den sinnvollen Einsatz von agilen Methoden zu analysieren und unter Beru¨cksichtigung agiler Werte und Prinzipien eine Vorgehensweise für die Einführung von agilen Methoden vorzuschlagen. Sie sind befähigt, Methoden und Rollen wahrzunehmen und das Erlebte kritisch zu reflektieren. Die Studierenden wissen um die Basis gemeinsam definierter und kontinuierlich gelebter agiler Werte und Prinzipien und verstehen, dass agiles Zusammenarbeiten vor allem eines radikalen Umdenkens im Vergleich zu etablierten Arbeitsabläufen bedarf. Sie können die fachspezifischen Ergebnisse der eigenen Arbeit in Form eines schriftlichen Berichts darstellen und darin die Erkenntnisse kritisch reflektieren. Die Studierenden sind in der Lage, ihr Wissen eigenständig auf Situationen der betrieblichen Praxis zu u¨bertragen. Sie können kritisch bewerten, ob die jeweilige Ausgangssituation für den Einsatz agiler Methoden grundsätzlich geeignet ist und Vorgehensweisen für die Einführung der Agilität mit entwickeln."
    },
    {
        "title_de": "International Project Management and Intercultural Competence",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können ihr Wissen über die Besonderheiten interkultureller Kommunikation und interkultureller Unterschiede in der Abwicklung internationaler Projekte anwenden. Sie sind in der Lage, die Einschränkungen bzw. Möglichkeiten, die sich aus dem Aufeinandertreffen zweier Kulturen oder Gruppierungen ergeben, einzuschätzen. Vor dem Hintergrund der internationalen Geschäftstätigkeit von Unternehmen können sie das komplizierte Zusammenspiel der kulturellen Ebenen und dessen Einfluss auf die Mitarbeiter*innen und die Unternehmenskultur beurteilen. Die Studierenden verfügen über umfangreiches und vertieftes Wissen in der Planung und Durchführung von Projekten. Darüber hinaus können sie die Erfordernisse der jeweiligen Projekte analysieren und die unterschiedlichen Ausgestaltungsmöglichkeiten des Projektmanagements (klassisch, agil, hybrid) und deren Einsatz in internationalen Projekten zielgerichtet anwenden. Die Studierenden sind in der Lage, ihr umfangreiches und vertieftes Methodenwissen im Projektmanagement und im interkulturellen Management vor allem durch praktische Übungen im Rahmen von Case-Studies anzuwenden. Zu den Methoden zählen insbesondere die Ausgestaltung der Unternehmensorganisation zur effizienten Abwicklung von Projekten, die Stakeholderanalyse, die 635-Methode, SCAMMPERR, der morphologische Kasten, die Nutzwertanalyse, RACI-Charts, die Meilensteintrendanalyse, die Zieldefinition mit der Smart-Methode, die Zielpriorisierung mit dem Kano-Modell, das agile Projektmanagement mit Scrum sowie das hybride Projektmanagement. Nach erfolgreichem Abschluss des Moduls können die Studierenden die situationsbedingt am besten geeigneten Methoden begründet auswählen und die Ergebnisse kritisch reflektieren. Die Studierenden haben ein Gefühl für die vielschichtigen Einflüsse und Wirkungen von Kultur, insbesondere auf internationale Projekte entwickelt. Sie sind in der Lage, ihr eigenes Verhalten vor dem Hintergrund anderer Wertesysteme zu reflektieren und das Verhalten anderer aus verschiedenen Perspektiven zu analysieren. Die Studierenden können konstruktiv in einer internationalen Arbeitsgruppe mitarbeiten und ihr erworbenes Fach- und Methodenwissen situationsspezifisch anwenden. Durch den praktischen Gebrauch der Methoden im Rahmen von Teamwork und Case-Studies erlangen die Studierenden die Fähigkeit zu eigenständiger Arbeitsaufteilung und intensivieren ihre Kompetenz zur schnellen Lösungsfindung. Die Studierenden haben die Kompetenz erworben, internationale und interdisziplinäre Projekte aufzusetzen, zu organisieren und erfolgreich zum Ziel zu führen. Sie sind in der Lage, dies im beruflichen Umfeld situationsbezogen anzuwenden und interkulturell angemessen und erfolgreich zu handeln."
    },
    {
        "title_de": "Produktionsanlagen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden vertiefen ihr Wissen im nachhaltigen Produktmanagement und Marketing vonInvestitionsgütern im Maschinen- und Anlagenbau. Sie analysieren und bewerten die Erfolgsfaktoren vonInvestitionen unter strategischer, technologischer, ökologischer, sozialer und wirtschaftlicher Machbarkeit ausKäufer- und Verkäufersicht. Sie verstehen das Konfliktfeld zwischen dem Wunsch nach vollkommenerNachhaltigkeit und der technologisch-wirtschaftlichen Machbarkeit. Auf dieser Erkenntnis gestalten sieverkaufsfähige Produkte und Projekte mit Gewinnerzielungsabsicht im Investitionsgütermarketing. Zusätzlichberücksichtigen die Studierenden als Produktmanager und im Vermarktungsprozess die AspekteKreislaufwirtschaft, Ressourceneffizienz, CO2-Fußabdruck sowie Energieeffizienz. Die Studierenden wenden konventionelle und innovative Methoden des Produktmanagements und despraktischen Vertriebes an, um Maschinen und Anlagen für internationale Käufer zu planen, zu entwickeln underfolgreich zu verkaufen. Sie analysieren strategische Investitionen unter technologischen, ökologischen,sozialen und wirtschaftlichen Gesichtspunkten und berücksichtigen Standards wie DIN EN ISO 50001, ISO14040 und ISO 20400 in der Produktgestaltung. Die Studierenden planen und strukturieren komplexe Aufgaben eigenständig und stellen Ergebnisse inschriftlicher und mündlicher Form überzeugend dar. Sie entwickeln interkulturelle Kommunikationsfähigkeitenbei der Vermarktung von Investitionsgütern und setzen diese erfolgreich bei der Vertragsverhandlung iminternationalen Kontext ein. Die Studierenden entwickeln ein ganzheitliches Verständnis für nachhaltiges Produktmanagement, erkennensystemische Auswirkungen auf Lieferanten, Kunden, Kapitalgeber, Mitarbeiter, Infrastruktur sowieGesellschaft und gestalten Produktmanagement im Investitionsgütermarketing unter Berücksichtigung vonNachhaltigkeit, Marktanforderungen und Gewinnmaximierung. Die Studierenden reflektieren die konfliktären Interdependenzen zwischen Corporate Social Responsibilityund Produktpolitik, Ökobilanz und Produktionsprozessen, nachhaltiger Ressourcenwirtschaft undstrategischer Unternehmensführung, Marketing und Greenwashing sowie Framing undStakeholdermanagement. Auf dieser Grundlage treffen sie sachlich fundierte Entscheidungen iminternationalen Kontext und setzen diese strategisch und überzeugend um."
    },
    {
        "title_de": "Einführung Energietechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die Grundlagen von ausgewählten Systemen der Energietechnik und ihre Funktionsweisen darstellen. Sie sind in der Lage, relevante Informationen zu energietechnischen Erzeugern und Verbrauchern eigenständig zu sammeln, zu verdichten und daraus fundiert technische, ökonomische und ökologische Schlu¨sse abzuleiten. Die Studierenden sind mit Abschluss des Moduls in der Lage, eigenständig fu¨r ausgewählte Anwendungsfälle der Energietechnik angemessene Methoden auszuwählen und anzuwenden. Sie können die Möglichkeiten, Praktikabilität und Grenzen der eingesetzten Methoden einschätzen, ihre Ergebnisse kritisch reflektieren und sind in der Lage, Handlungsalternativen aufzuzeigen. Die Studierenden sind in der Lage, ausgewählte Aufgabenstellungen der Energietechnik selbstständig und in Teams zu bearbeiten, Lösungswege aufzuzeigen und die Ergebnisse in Form eines Berichtes darzustellen. Die Studierenden können fu¨r den Energieverbrauch relevante Gegebenheiten und Zusammenhänge im privaten und betrieblichen Alltag erkennen und Maßnahmen zur Verbesserung vorschlagen. Sie können ihre betriebswirtschaftlichen Kenntnisse auf unterschiedliche technische Prozesse in der Energietechnik anwenden."
    },
    {
        "title_de": "Fabrik- und Layoutplanung",
        "ects": 5,
        "learning_outcomes_de": "Nach dem Besuch des Moduls sind die Studierenden in der Lage, verschiedene Fabrik- und Layout- Konzepte und deren Vor- und Nachteile , bewerten und auf konkrete Probleme anwenden. Dies gilt sowohl für quantitative sowie qualitative Methoden und Verfahren derFabrik- und L<out-Planung. Neben den klassischen Gestaltungsprinzipien einer Fabrik können die Studierenden innovative Konzepte und Trends wie „Wandlungsfähige Unternehmen“, „Produzieren in Netzwerken“, „Digitale Fabrik“ etc. beschreiben und in ihren unternehmensspezifischen Kontext einordnen. Die Studierenden können anhand verschiedener Szenarien, die im Rahmen der Lehrveranstaltung erworbenen qualitativen und quantitativen Methoden in einem Planspiel anwenden und vertiefen. Nach dem erfolgreichen Absolvieren des Moduls sind die Studierenden befähigt, komplexe Probleme selbständig und im Team zu bearbeiten und Lösungsansätze zu diskutieren. Die kritische Reflexion erfolgt im Rahmen der Prüfungsleistung. Die Studierenden sind in der Lage fachspezifische Ergebnisse in der Gruppe zu erarbeiten und deren Anwendungen im Unternehmenskontext einzusetzen. Die erlernten quantitativen Problemlösungsmethoden der Fabrikplanung können auch auf andere Themenstellung, wie sie üblichereise im Rahmen von Operations Research und Systems Engineering Veranstaltungen vermittelt werden, angewandt werden. Die Studierenden sind in der Lage die erworbenen Kenntnisse im arbeitsalltag zu diskutieren und im Unternehmen einzubringen."
    },
    {
        "title_de": "Robotik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können das Verhalten von Robotern beschreiben und analysieren. Sie kennen die wesentlichen Fragestellungen und Konzepte der Robotik. Sie sind in der Lage, die Stärken und Schwächen der Konzepte zu analysieren und können den Einsatz von Robotern entsprechend planen. Die Studierenden erlangen Verständnis für die Rahmenbedingungen, die für den Einsatz von Robotern maßgeblich sind und erhalten einen Überblick über die Methoden der aktiven Steuerung von Robotern zur Realisierung eines technischen Prozesses. Die Studierenden können die Möglichkeiten und Grenzen eines Robotersystems beurteilen und zu Risiken Stellung nehmen. Die Studierenden können überschlägig die Kosten für den Einsatz von Robotersystemen abschätze. Die Studierenden kennen die Bedeutung von Robotern als Automatisierungskomponenten und deren betriebs- sowie volkswirtschaftlichen Einfluss. Die Studierenden können komplexe Fragestellungen der Automatisierung analysieren. Sie können geometrische Fragestellungen mit Orientierungen im Raum mathematisch beschreiben und Lösungen erarbeiten. Sie entwikeln im Rahmen von Fallstudien Kompetenzen für die Lösung aktueller Problemstellungen der Prozessautomatisierung. Durch die praktische Realisierung von technischen Prozessen im Labor sind Sie befähigt die Studierenden Aufgaben und Probleme systematisch zu lösen. Sie können zu den sozialen und ethischen Fragen der Robotik kritisch Stellung nehmen. achspezifische Ergebnisse eigener Arbeit sowohl in einem Referat wie als Sie können die Dokumentation in Form eines schriftlichen Berichts darzustellen und in einer Gruppe vetreidigen. Sie können zu aktuellen gesellschaftspolitische Thematik des Einsatzes von automatisierten und autonomen Systemen kritisch Stelluing nehmen. Die Studierenden können die Systematik der Analyse und Bewertung von Robotersystemen auf Fragestellungen der betriebliche Praxis übertragen. Die Diskussion von Prinzipien der autonomen Steuerung von Robotern können in das Arbeitsumfeld übertragen werden."
    },
    {
        "title_de": "",
        "ects": 5,
        "learning_outcomes_de": "Nach Besuch des Moduls sind die Studierenden fähig, die Planung, Gestaltung und Umsetzung von Produktionssystemen sowie die grundlegenden arbeitswirtschaftlichen Methoden nach REFA und MTM zu analysieren, beurteilen und anzuwenden. Die Studierenden sind in der Lage, eine Organisation in ihrer Struktur und den Entscheidungsregeln, welche die Dynamik schaffen und die Leistungsschaffung regulieren, aufzubauen. Die Studierenden können die entsprechenden Methoden der Arbeitswissenschaften und in Fallstudien anwenden. Sie sind in der Lage, auf Basis ihrer konzeptionellen Fähigkeiten und den Fähigkeiten zum Modellieren, für ausgewählte Fragestellungen in Fallstudien für Organisationen eine dynamische Umgebung zu schaffen und zu gestalten. Die Studierenden sind in der Lage, eigenständig in Gruppen zu arbeiten, um komplexe unternehmerische Herausforderungen kritisch und aus ethischer Sicht zu hinterfragen und zielführende Lösungen zu erarbeiten. Ihre Sichtweisen und die Ergebnisse ihrer Diskussionen können sie mündlich und schriftlich überzeugend kommunizieren. Die Studierenden sind befähigt, unterschiedliche Sichtweisen und Interessen anderer Beteiligter auch unter Zeitdruck angemessen zu beru¨cksichtigen sowie Feedback zu geben und anzunehmen. Die Studierenden sind in der Lage, aufgrund ihres tieferen Verständnisses genereller komplexer (komplizierter, dynamischer) Systeme Lösungen in den Bereichen Produktion, Logistik und Arbeitsvorbereitung umzusetzen und zu optimieren."
    },
    {
        "title_de": "Fertigungs- und Informationsmanagement",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden erkennen, wie sich im Zusammenspiel von Personal, Maschinen und Automatisierungskomponenten durch IT und Digitalisierung (Internet der Dinge, Industrie 4.0) neue Möglichkeiten für Aufbau und Gestaltung von Geschäftsprozessen im Unternehmen und entlang der Wertschöpfungsketten ergeben. Die Studierenden besitzen einen Überblick über ausgewählte IT-Systeme sowie die Bedeutung aktueller Trends im Informationsmanagement wie Cloud Computing, Big Data, Künstliche Intelligenz und Mobile Computing. Für ausgewählte Szenarien aus Produktion, Instandhaltung, Qualitätsmanagement, Servicemanagement können die Studierenden die Möglichkeiten und Grenzen bei der Prozessverbesserung einordnen. Für Beispiele zur Kennzahlenermittlung (z.B.: OEE) können die Studierenden die hohe Bedeutung der Datenerfassung bei der Umsetzung aktueller Fertigungskonzepte darstellen. Aufgrund der Bearbeitung von Fallbeispielen und Laborübungen zum Fertigungs- und Informationsmanagement können die Studierenden aktuelle Problemstellungen aus der Praxis analysieren und bewerten. Sie sind in der Lage die kennengelernten Methoden und Technologien für eigene Lösungsvorschläge zu reflektieren, einzusetzen und ggf. weiterzuentwickeln. Die Studierenden sind für die Bedeutung von Interdisziplinarität und fachübergreifendem Denken bei der Gestaltung von wettbewerbsfähigen Unternehmensprozessen sensibilisiert. Die Studierenden sind in der Lage komplexe Probleme selbständig zu bearbeiten und fachspezifische Ergebnisse der Arbeit in einem Referat darzustellen. Die Studierenden transferieren unterschiedliche Lösungsansätze auf die konkrete Situation im Unternehmen, entwickeln sie kreativ weiter und bringen die Umsetzung in der Praxis voran, in dem sie die Sicht der IT und der Technik aber auch die Sicht der unterschiedlichen Anwender einbeziehen."
    },
    {
        "title_de": "Hochleistungswerkstoffe",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind nach erfolgreichem Abschluss des Moduls in der Lage, fachlich fundiert theoretische und praktische Kenntnisse über moderne Werkstoffe und deren konkrete Anwendungsfälle darzulegen. Darüber hinaus sind sie befähigt, über zukünftige Entwicklungen und aktuelle Forschungsergebnisse zu berichten. Die Studierenden wissen um die Bedeutung von Hochleistungswerkstoffen und deren Auswirkungen auf Mensch und Umwelt. Sie können Vorschläge unterbreiten, um herkömmliche Werkstoffe durch moderne Werkstoffkonzepte zu substituieren. Die Studierenden kennen das Potential moderner Werkstoffe und deren Einsatzmöglichkeiten. Sie können anhand der vorgestellten Methoden geeignete Werkstoffe für einen konkreten Anwendungsfall auswählen, deren Eigenschaften beurteilen und gegeneinander abwägen. - Durch ihre Kenntnisse der werkstoffkundlichen Grundlagen in Verbindung mit Anwendungs- und Verarbeitungsmöglichkeiten von Hochleistungswerkstoffen können sich die Studierenden im beruflichen Umfeld aktiv in Problemlösungen für die Substituierung und Optimierung von Werkstoffanwendungen einbringen. Sie sind zudem in der Lage, sich mit Expertinnen und Experten anderer Fachbereiche wie bspw. Konstruktion oder Fertigung zu Fragestellungen der betrieblichen Praxis auszutauschen."
    },
    {
        "title_de": "Werkstoffe in der Elektrotechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden besitzen fachlich fundierte theoretische und praktische Kenntnisse über verschiedene Werkstoffe in der Elektrotechnik und deren konkrete Anwendungsfälle. Die Studierenden kennen das Potential moderner Werkstoffe und deren Einsatzmöglichkeiten in der Elektrotechnik. Sie können ihre Kenntnisse auf neue Fragestellungen übertragen. Die Studierenden kennen die Bedeutung von Werkstoffen in der Elektrotechnik und deren Auswirkungen auf Mensch und Umwelt. Die Studierenden kennen das Potential moderner Werkstoffe und deren Einsatzmöglichkeiten in der Elektrotechnik. Sie können ihre Kenntnisse auf neue Fragestellungen übertragen. Sie können anhand der vorgestellten Methoden geeignete Werkstoffe für einen konkreten Anwendungsfall auswählen, deren Eigenschaften beurteilen und gegeneinander abwägen. - Die Studierenden sind in der Lage, Problemstellungen aus dem betrieblichen Umfeld aufzunehmen, zu analysieren und entsprechende Lösungsansätze zu konzeptionieren und Lösungen zu erarbeiten. Sie haben die physikalischen und werkstoffkundlichen Denk- und Arbeitsweisen verinnerlicht und sind in der Lage, diese auf andere Bereiche zu übertragen."
    },
    {
        "title_de": "Produktionslogistik und Supply Chain Management",
        "ects": 5,
        "learning_outcomes_de": ""
    },
    {
        "title_de": "Einführung in die Elektrotechnik",
        "ects": 5,
        "learning_outcomes_de": "Nach Besuch des Moduls sind die Studierenden in der Lage die wichtigsten elektrischen Größen zu erörtern. Sie können einfache Gleichstromkreise mit ausgewählten Verfahren berechnen und die wichtigsten magnetischen Feldgrößen verstehen und zuordnen. Sie sind befähigt einfache Wechselstromkreise mit Hilfe der komplexen Rechnung zu berechnen. Sie können die Funktionen der wichtigsten nichtlinearen Bauteile (Diode, Transistor, Operationsverstärker) und deren Anwendungsschaltungen beschreiben. Sie sind in der Lage ausgewählte Beispiele aus dem Bereich der Sensorik und Aktorik zu erfassen und funktional zu verstehen. Sie können abstrakte, auf Modellen basierende Lösungsverfahren nachvollziehen. Die Studierenden sind in der Lage für ausgewählte elektrotechnische Problemstellungen ein Schaltungkonzept zu erstellen, die technische Realisierung in Form eines Prototyps umzusetzen und die Funktion zu demonstrieren. Mit den erlernten Fachkompetenzen sind die Studierenden in der Lage, mit Fachleuten zu kommunizieren und allgemeine grundlegende Problemstellungen der Elektrotechnik in Bezug auf seine Anwendungen im Team zu diskutieren und zu verstehen. Die Studierenden sind befähigt einfache Fragestellungen der Schaltungstechnik selbständig in 2er Teams zu bearbeiten und die Lösungsansätze zu diskutieren. Sie können die fachspezifischen Ergebnisse ihrer Arbeit in einem Konstruktionsentwurf in Form einer Präsentation und eines schriftlichen Berichts darstellen. Die Studierenden können die gelernten Methoden und Berechnungsverfahren abstrahieren und auch in anderen Disziplinen anwenden und in Fragestellungen der betrieblichen Praxis zielführend einbringen."
    },
    {
        "title_de": "Prozessorientiertes Qualitätsmanagement",
        "ects": 5,
        "learning_outcomes_de": "Die Absolventen haben fundiertes Fachwissen im prozessorientierten Qualitätsmanagement und verstehen dies im Kontext ihres eigenen Unternehmens. Sie sind in der Lage Unternehmensprozesse hinsichtlich der Forderungen des Qualitätsmanagement (insbesondere ISO 9000 ff) zu analysieren und zu gestalten und geeignete Methoden anzuwenden Die Studierenden sind in der Lage geeignete Qualitätsmethoden auszuwählen und zielführend einzuführen. Darüber hinaus können Sie sich selbstständig weitere Methoden aneignen und in das Qualitätsmanagement einordnen. - Die Studierenden verstehen Qualitätsmanagement als interdisziplinäre Managementdisziplin zwischen Technik, Betriebswirtschaft und Organisation. Sie können die Bedeutung für ihr Unternehmen herausarbeiten und im Unternehmen vertreten. Sie erkennen dabei Zielkonflikte und arbeiten an Lösungsstrategien mit."
    },
    {
        "title_de": "Quality Improvement Projects I - Six Sigma Method",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können ein Verbesserungsprojekt auf Basis der Six Sigma Projektmethode erfolgreich durchführen und damit einen entscheidenden Beitrag zur Prozessoptimierung im Unternehmen leisten. Ausgewählte Elemente des Projektmanagements, das Six Sigma Rollenmodell und die DMAIC-Phasen sowie die Methoden können in der Praxis eines Six Sigma Green Belt Projektes eigenständig angewendet werden. Die wesentlichen Six Sigma Methoden und Tools können von den Studierenden entsprechend der Aufgabenstellung ausgewählt und zielsicher eingesetzt werden. Klassische Methoden sind z.B. Projektauftrag, SIPOC, CTQ, MSA, Prozessfähigkeitsanalysen, Ishikawa, Process-Mapping, Nutzwertanalyse und Umsetzungsplanung. Zudem wenden die Studierenden Methoden aus der beschreibenden und schließenden Statistik mit Hilfe einer Statistiksoftware an und können die wichtigsten Lean-Methoden z.B. TIMWOOD, TOC oder Wertstrom sicher einsetzen. Die Studierenden lernen das Projekt-Umfeld zu analysieren und zu bewerten. Sie sind in der Lage die erlernten Methoden in interdisziplinären Teams anzuwenden bzw. zu moderieren. Kommunikationsfähigkeit, Ausdauer, analytisches Denken und Fähigkeit zur Priorisierung sowie das Verständnis der Teamrollen werden durch eine Fallstudie und das praktische Verbesserungsprojekt (Projektarbeit) weiterentwickelt Die Studierenden sind in der Lage, umfassende Verbesserungsprojekte nach der Six Sigma Methode im Unternehmen durchzuführen und durch den Einsatz geeigneter Methoden eine nachhaltige Optimierung zu erzielen."
    },
    {
        "title_de": "Quality Improvement Projects II - Data Analytics and Design of Experiments",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können Verbesserungsprojekte in allen Bereichen des Unternehmens erfolgreich durchführen. Grundlage dieser Verbesserungsprojekte sind vertieftes Verständnis und Anwendungswissen im Prozessmanagement und in der Analyse von (großen) Datenmengen. Elemente des Projekt- und Change-Managements, sowie Methoden des Data Analytics können in der Praxis angewendet werden. Darüber sind die Studierenden in der Lage geeignete Verbesserungsprojekte im Unternehmen auszuwählen und zu priorisieren. Sie haben Kenntnisse über das Programmmanagement aller Verbesserungsprojekte im Unternehmen. Vertiefte Methodenkenntnisse werden vor allem in den Bereichen Prozessanalyse, statistische Analyseverfahren (erweiterte Hypothesentests, Multivariante Verfahren), Messverfahren (MSA für attributive Daten) erworben. Zusätzliche speziellere Methoden wie die Statistische Versuchsplanung (Design of Experiments) können von den Studierenden entsprechend der Aufgabenstellung zielsicher ausgewählt und eigenständig angewendet werden. - Die Studierenden sind in der Lage, größere, bereichsübergreifende Verbesserungsprojekte im Unternehmen durchzuführen und eine nachhaltige Optimierung zu erzielen."
    },
    {
        "title_de": "Technologiemanagement",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die Bedeutung von Technologien für die Marktposition ihres Unternehmens und können die unternehmens-spezifischen Techniken über eine Logik miteinander schlüssig verbinden. Basierend auf einer Multi-Tier- bzw. Three-Layer-Architecture können Sie mit den besonderen Herausforderungen von Technologien umgehen, wie beispielsweise mit technischer Kongruenz, mit Over-Engineering, mit dem Dominant Design Concept, mit den Kondratjew-Zyklen, mit der S-Kurve, mit dem Adoptoren-Modell, mit dem Hype Cycle oder mit technologischer Innovation. Die Studierenden kennen verschiedene Methoden zum Scoping, zum Screening, zum Transfer, zum Monitoring, zum Scouting und zum Assessment von Technologien. Sie verstehen Technologien als Faktoren für unternehmerisches Handeln und können methodisch schlüssig und zielgerichtet damit umgehen und selbständig angepasste Lösungen für Probleme erarbeiten. - Die Studierenden sind vertraut mit dem Kontingenzprinzip des Managements und können entsprechend die Qualität von Technologien managen, als auch Technologie-Projekte leiten oder eine Technologie-Strategie erarbeiten."
    },
    {
        "title_de": "Umweltmanagement in Unternehmen",
        "ects": 5,
        "learning_outcomes_de": "Nach dem Besuch des Moduls sind die Studierenden in der Lage, die verschiedenen Umweltmanagement-Systeme und deren Vor- und Nachteile zu erläutern. Sie sind befähigt, die Strukturen eines Managementsystems in einem Unternehmen zu implementieren. Daru¨ber hinaus sind sie in die Lage, für ein Industrieunternehmen die relevanten Umweltaspekte zu bewerten und Maßnahmen abzuleiten, um die Umweltbeeinflussung des Unternehmens zu reduzieren. Die Studierenden kennen Umweltschutz-Themen wie Bionik, Lebenszyklusbewertung, etc., die in einem Unternehmen zum Einsatz kommen können. Die Studierenden sind aufgrund ihres Verständnisses der Prozesse und Methoden des Umweltmanagements in der Lage, für ausgewählte unternehmerische Situationen die Vorgehensweise für Projekte zu entwickeln. Sie kennen die Werkzeuge und Methoden, die den Einsatz neuer Umweltschutz-Methoden im Unternehmen ermöglichen, und können diese auf die ausgewählte Situation eigenständig anwenden und die Ergebnisse kritisch reflektieren. Die Studierenden sind zudem in der Lage, den monetären Nutzen bei sozial-ethischen Aspekten aufzuzeigen und zu bewerten. Die Studierenden sind in der Lage, die fachspezifischen Ergebnisse der eigenen Arbeit in Form eines schriftlichen Berichts darzustellen. Insbesondere können sie ihr Handeln kritisch in Bezug auf den monetären Nutzen bei sozial-ethischen Aspekten reflektieren. Die Studierenden erkennen Ansatzpunkte für die Optimierung von Umwelt- und Kostenaspekten und können Vorschläge zu deren Verbesserung in einem Unternehmen einbringen."
    },
    {
        "title_de": "Cost Engineering",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen den Beitrag des Cost Engineerings als Schnittstelle zwischen Einkauf, Entwicklung, Produktion und Controlling. Sie kennen verschiedene Kostenperspektiven und können dieses aufgrund der datenbezogenen Darstellungen unterscheiden sowie die Ergebnisse interpretieren. Die Studierenden beherrschen die Methoden der Datenrecherche, Datenanalyse, Modellerstellung. Die Studierenden können Beispielkalkulationen anhand ausgewählter Praxisfälle anwenden und beurteilen. Sie handhaben komplexe und unsichere Entscheidungssituationen methodensicher und erarbeiten entscheidungsfähige Vorlagen. Die Studierenden identifizieren Verbesserungspotenziale (in Kern- und Unterstützungsproessen der Betriebe) systematisch und erarbeiten selbständig in spezifischen Handlungsfeldern konkrete Maßnahmen. Sie können Konzeptvorschläge (z.B. Vorstandsvorlagen oder Business Cases) ganzheitlich hinsichtlich Realisierbarkeit und Vorteilhaftigkeit beurteilen. Außerdem sind Sie in der Lage Widerstände zu antizipieren und ihnen argumentativ zu begegnen. Die Studierenden gewinnen Erfahrung in der ganzheitlichen und differenzierten Argumentation (Wirtschaftlichkeit, Technik, Organisation). Sie suchen aktiv die Zusammenarbeit mit Kolleg*innen in anderen Fachabteilungen und den Lieferanten, um Konzepte zu entwickeln und umzusetzen. Die Studierenden können ihre Vorschläge und Prioritäten gegenüber Vertretern aus anderen Funktionen argumentativ vertreten und verstehen die Anliegen und Argumente der Kolleg*innen aus angrenzenden Fachabteilungen. Sie können ihre Sichtweise in Gruppen präsentieren und vertreten. Die Studierenden sind in der Lage sich kritisch mit den ökologischen Einflussfaktoren im Cost Engineerings auseinander zu setzen und wägen diese gegen etwaige wirtschaftliche Vorteile ab Die Studierenden verstehen die Bedeutung interdisziplinärer und crossfunktionaler Zusammenarbeit. Der Umgang mit den Ausprägungen von Vielfalt (Produktentwicklung, Produktion und Beschaffung), der Komplexität und Unsicherheit der Kalkulationsaufgaben schult das Abstraktionsvermögen in Bezug auf die betriebliche Praxis und bildet damit eine systemische Denkweise heraus."
    },
    {
        "title_de": "Sustainable Engineering and Business",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die Grundprinzipien der Kreislaufwirtschaft sowie bestehende Geschäftsmodelle der Kreislaufwirtschaft erläutern und neue Geschäftsmodelle generieren. Die Studierenden kennen den Aufbau von Ökobilanzen und können diese für bestehende Produkte analysieren. Hinsichtlich des Produktdesigns können die Studierenden Vorschläge unterbreiten mit Bezug auf die Einflussfaktoren (z.B. Transport, Materialien, Prozesse...) auf das Ökodesign. Die Studierenden sind in der Lage eigenständig Lösungsstrategien fu¨r komplexe Problemstellungen auf Basis der Prinzipien des Sustainable Engineering zu bearbeiten, hierzu Lösungsvorschläge zu entwickeln und umzusetzen sowie das Ergebnis kritisch zu reflektieren. Nach dem erfolgreichen Absolvieren des Moduls sind die Studierenden befähigt, eine vorgegebene Problemstellung eigenständig zu bearbeiten. Sie können fachspezifische Ergebnisse eigener Arbeit sowohl in einem Referat als auch in Form eines schriftlichen Berichts darstellen. Ihre fachlichen und sachbezogenen Problemlösungen können sie im Diskurs mit anderen Studierenden fundiert begründen und verteidigen. Die Studierenden sind nach erfolgreichem Abschluss des Moduls in der Lage, sich in der betrieblichen Praxis der Fragestellung zur Kreislaufwirtschaft und des umweltgerechten Produktdesigns aktiv zu beteiligen und Lösungsstrategien mit zu entwickeln. Sie können ihr Wissen eigenständig auf neue Situationen der Kreislaufwirtschaft anwenden."
    },
    {
        "title_de": "Data Science für Ingenieurwissenschaften",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die grundlegenden Werkzeuge des Data Science und können für gegebene Fragestellungen die richtige Methodik auswählen und anwenden Sie können multivariate Verfahren gezielt verstehen und einsetzen sowie aufgrund der Ergebnisse Entscheidungen treffen. Sie sind in der Lage, mit einschlägiger Software erfolgreich umzugehen. Die Studierenden können eine Vielzahl von gängigen Methoden des Data Science für die Ingenieurwissenschaftliche Praxis anwenden. Sie verstehen die Methoden und setzen diese zielgerichtet ein. Sie können die Ergebnisse systematisch analysieren, interpretieren und bewerten. Durch selbstständige Be- und Aufarbeitung von komplexen Fragestellungen des Data Science und Präsentation des Referats wird die personale sowie die soziale Kompetenz der Studierenden gestärkt. Die Studierenden sind auf Basis des erworbenen Wissens in der Lage, sich eigenständig in einzelne Themen des Data Science tiefer einzuarbeiten. Sie sind in der Lage, zu beurteilen, ob bei der Analyse technischer Größen statistische Gesichtspunkte und/ oder Aspekte des Data Science berücksichtigt werden müssen. Die Studierenden können ihr Wissen bei Fragestellungen der betrieblichen Praxis aktiv anwenden."
    },
    {
        "title_de": "Simulation in Produktion und Logistik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die wesentlichen Einsatzbedingungen verschiedener Simulationsverfahren in entsprechenden industriellen Anwendungen beschreiben. Sie haben ein Verständnis für Möglichkeiten und Grenzen der Untersuchung von dynamischen Systemen mithilfe von Simulationen erlangt. Die Studierenden können bestehende und geplante technische Systeme in dem für den Einsatz von Simulationstechnik nötigen Maß untersuchen, auf das notwendige Maß abstrahieren und in einer Simulationsstudie umsetzen. Erreichte Ergebnisse können kritisch geprüft und beurteilt werden. Darauf aufbauend können Veränderungen vorgeschlagen, simulativ untersucht und ebenfalls hinsichtlich ihrer wirtschaftlichen und organisatorischen Auswirkungen untersucht werden. Die Studierenden sind in der Lage, geeignete Fragestellungen problemadäquat mit Hilfe von Simulationsprogrammen zu untersuchen und zielgerichtet Ergebnisse zu erarbeiten. Für geeignete Fragestellungen können sie die Planung für logistische und produktionsnahe Prozesse durchführen, die zu erwartenden Ergebnisse dieser Planung ermitteln und beurteilen sowie darauf aufbauend Alternativen entwickeln. Die Studierenden sind in der Lage, selbstständig und kreativ Lösungen zu erarbeiten. Sie können diese Lösungen anderen vorstellen, mit diesen kritisch diskutieren und Vor- und Nachteile gegenüberstellen. Sie sind befähigt, in der Lösungsfindung verschiedene Sichtweisen angemessen zu berücksichtigen. Die Studierenden sind in der Lage, sich im Berufsumfeld benötigte Informationen aus verschiedenen Quellen zu erschließen, diese entsprechend zu bewerten und zur Problembearbeitung einzusetzen. Da durch die Simulation grundsätzlich das Systemdenken und das Systemverständnis gefördert wird, haben sie die Fähigkeit erlangt, dieses auch auf weitere Themen im beruflichen und privaten Umfeld anzuwenden."
    },
    {
        "title_de": "Modellbildung, Analyse und Simulation technischer Systeme",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden erfassen die Grundbegriffe, das systemische Denken und Vorgehen und können Systeme mit mathematischen, natur- und ingenieurwissenschaftlichen Methoden beschreiben. Sie können entsprechende technische Problemstellungen ingenieurgemäß analysieren und lösen. Die Studierenden können Systeme modellhaft abbilden, mathematisch beschreiben und Fehlerquellen in den Modellen erkennen. Sie erkennen die Grenzen von Modellen und können ihre Modelle entsprechend realer technischer Anforderungen erweitern und anpassen. Somit können Sie auch neu auftretende Problemstellungen und Forschungsfragen in der Simulationstechnik aufwerfen und problemorientiert lösen. Sie sind auch sensibilisiert für verschiedene Fehlerquellen, die im Rahmen der Simulation technischer Systeme auftreten und können potenziell auftretende Fehler systematisch aufspüren. Die Studierenden beherrschen naturwissenschaftlich-technische und mathematisch-analytische Methoden der Modellbildung und Analyse technischer Systeme. Dadurch sind sie in der Lage, reale Systeme systematisch zu abstrahieren, mathematisch zu beschreiben und deren Verhalten vorherzusagen. Die Studierenden können ihre Modelle mit Hilfe der Simulationssoftware MATLAB/Simulink auf einer Rechenplattform abbilden und simulieren sowie die Simulationsergebnisse kritisch analysieren und beurteilen. Die Studierenden sind in der Lage, eine komplexe simulationstechnische Aufgabe eigenständig in Arbeitspakete zu untergliedern, ihre Bearbeitung zu planen, im Team angemessen und zielfu¨hrend aufzuteilen, den Arbeitsstand fortlaufend zu verfolgen und die Bearbeitung termingerecht abzuschließen und die Ergebnisse der Teammitglieder aufeinander abzustimmen/zusammenfließen zu lassen. Darüber hinaus sind die Studierenden in der Lage, Simulationsergebnisse kritisch zu analysieren und zu hinterfragen. Sie sind in der Lage, fachspezifische Ergebnisse eigener Arbeit als Dokumentation in Form eines schriftlichen Berichts darzustellen. Die Studierenden können Simulations-Software auf konkrete berufliche Fragestellungen ihrer betrieblichen Praxis anwenden, können aber ebenfalls deren Grenzen einschätzen und die Software somit gezielt zum Einsatz bringen. Die Studierenden erkennen Analogien, z.B. auf mathematischer Ebene, zwischen den verschiedenen technischen Disziplinen, die sich in prinzipiell ähnlichem Systemverhalten darstellen. Dadurch denken sie vernetzter und können ihr Wissen auf neuartige Fragestellungen der betrieblichen Praxis übertragen."
    },
    {
        "title_de": "Sustainability Dynamics",
        "ects": 5,
        "learning_outcomes_de": "Nach Besuch des Moduls sind die Studierenden fähig, das systemische Denken und die System-Dynamics-Methodologie zu erläutern. Sie wissen um die Grundlagen fu¨r eine effektive Nutzung der System-Dynamics-Modellierung in der realen Welt und können System Dynamics anwenden, um ausgewählte unternehmerische und gesellschaftliche Herausforderungen hinsichtlich Strategie und Nachhaltigkeit und dem Entwickeln effektiver Entscheidungsregeln zu analysieren. Die Studierenden sind in der Lage, eine Problemstellung mit Bezug auf Nachhaltigkeit innerhalb und zwischen Organisationen in ihrer Struktur und den Entscheidungsregeln, welche die Dynamik schaffen und die Leistungsschaffung regulieren, abzubilden. Sie verstehen, wie Problemsituationen mit ihren Strukturen abgebildet werden können und mit verschiedenen Stakeholdern verknu¨pft sind. Die Studierenden können Simulationsmodelle, sogenannte Management-Flugsimulatoren, nutzen und in Fallstudien anwenden. Sie sind in der Lage, auf Basis ihrer konzeptionellen Fähigkeiten und den Fähigkeiten zum Modellieren, für ausgewählte Fragestellungen in Fallstudien für Organisationen eine dynamische Umgebung zu schaffen und zu gestalten. Die Studierenden sind in der Lage, eigenständig in Gruppen zu arbeiten, um komplexe unternehmerische Herausforderungen kritisch und aus ethischer Sicht zu hinterfragen und zielführende Lösungen zu erarbeiten. Ihre Sichtweisen und die Ergebnisse ihrer Diskussionen können sie mündlich und schriftlich überzeugend kommunizieren. Die Studierenden sind befähigt, unterschiedliche Sichtweisen und Interessen anderer Beteiligter auch unter Zeitdruck angemessen zu berücksichtigen sowie Feedback zu geben und anzunehmen. Eine übergreifende Handlungskompetenz wird durch ein tieferes Verständnis genereller komplexer (komplizierter, dynamischer) sozialer Systeme erreicht, in der sich Menschen zu jeder Zeit befinden."
    },
    {
        "title_de": "Einführung und Anwendung emergenzbasierter KI-Algorithmen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sollen die folgenden Fachkenntnisse erwerben: - Anforderungen an Daten und Aufbereitung von Daten für die Lösung von Maschinenlernproblemen. - Methoden der fortgeschrittenen beschreibenden Statistik. - Grundlegende Programmierkenntnisse in Python - Kenntnisse in empirischer Modellbildung, Modellbewertung und unterschiedlichen Modelltypen (Erklärungs- Prognose- und Entscheidungsmodelle) - Selbständige Analyse von mit KI-Methoden lösbaren Praxis- und Forschungsproblemen Künstliche Intelligenz wird verstehbar und als hilfreiches universell einsetzbares Tool erkennbar. Nach dieser Veranstaltung sollen Studierende in der Lage sein, konkrete, fach- und auch nicht fach-spezifische Maschinen-Lern-Probleme zu erkennen, mit emergenzbasierten Algorithmen selbständig zu lösen, die Lösungen zu verstehen und ggf. in autonom handelnde Algorithmen umzusetzen. Es werden Methoden vermittelt, deren Ergebnisse nur auf dem Prinzip “Es war bisher immer so” basieren. Daher wird die Leistungsfähigkeit absoluter empirischer Objektivität demonstriert. Selbständige Planung und Durchführung von KI-Projekten Der derzeitige Stand der Entwicklung von KI-Methoden die derzeitigen Anwendungspotentiale werden erkennbar. Gleichzeitig werden Anhaltspunkte für die Abschätzung des Potentials und der Geschwindigkeit von Weiterentwicklungen auf diesem Gebiet deutlich. Die Studierenden werden also befähigt, selbständig begründete Erwartungen über aktuelle und zukünftige Anwendungsgebiete und Potentiale von KI zu bilden."
    },
    {
        "title_de": "Business Optimization",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die wesentlichen Strategien und Methoden der Optimierung in Unternehmen. Entlang von universellen Optimierungshebel können die Studierenden systematisch Verbesserungsmaßnahmen in realen Situationen aufzeigen, analysieren und bewerten. Anhand von Fallstudien identifizieren die Studierende zentrale Entscheidungsfelder von Industrieunternehmen. Sie lernen reale Probleme in quantitative Modelle zu transferieren, diese mit geeigneten Verfahren zu lösen und Handlungsempfehlungen abzuleiten. Nach dem Besuch der Lehrveranstaltung können die Studierenden die gelernten Verfahren und Methoden in realen Unternehmenssituationen einsetzen. Sie sind in der Lage als Consultant Optimierungsprojekte zu unterstützen oder zu leiten. Die Studierenden können für praktische Problemstellungen passende Methoden und Modelle identifizieren, anwenden, quantitativ und qualitativ bewerten sowie überzeugend und schlüssig präsentieren. Dabei sind sie in der Lage komplexe Ursache- /Wirkungseffekte zu systematisieren und zu reflektieren. Die Studierenden entwickeln eine strukturierte und analytische Vorgehensweise bei der Problemlösung. Die Studierenden können Problemlösungsprozesse in interdisziplinären Teams mit Unterstützung quantitativer Methoden gestalten. -"
    },
    {
        "title_de": "Basismodul Mechanical Engineering",
        "ects": 15,
        "learning_outcomes_de": "In der Konstruktionslehre kennen die Studierenden die konstruktiven und physikalischen Grundlagen desMaschinenbaus sowie deren Anwendung. Sie verstehen die Funktion der Maschinenelemente, können derenDarstellung und die exemplarische Berechnung von Funktion und Festigkeit durchführen. Sie besitzenstrukturiertes Basiswissen über Maschinenelemente und deren Verbindungen und erkennen die Bedeutungder Konstruktionslehre für die Produktentwicklung und deren Auswirkungen auf Mensch und Umwelt. In der Fertigungstechnik sind die Studierenden in der Lage, die Verfahren und Einrichtungen zurWerkstückherstellung zu verstehen. Sie kennen die Einsatzgrenzen der Fertigungstechnologien und könnengeeignete Alternativen unter technischen und wirtschaftlichen Kriterien auswählen. Sie verstehen dieWechselwirkungen zwischen Werkstoffeigenschaften und Fertigungsverfahren und kennen die Auswirkungenvon Fertigungsverfahren auf Mensch und Umwelt. In der Werkstoffkunde verstehen die Studierenden den Zusammenhang zwischen Werkstoffstruktur und -eigenschaften. Sie können das Werkstoffverhalten unter verschiedenen Beanspruchungsbedingungendarlegen, kennen die Verfahren der Werkstoffherstellung sowie Anwendungsmöglichkeiten. Sie sind in derLage, Werkstoffkennwerte zu ermitteln und Prüfungen durchzuführen. Sie kennen die Bedeutung vonWerkstoffen und deren Auswirkungen auf Mensch und Umwelt. Die Studierenden sind in der Lage, technische Unterlagen zu erstellen und zu interpretieren. Siekommunizieren fachgerecht mit Kolleginnen und Kollegen aus den Bereichen Forschung und Entwicklungsowie Werkstoff- und Fertigungstechnik. Mithilfe der vermittelten Methoden können sie geeigneteFertigungsverfahren für spezifische Produkte auswählen, auftretende Fehler beurteilen und bewerten sowieihre Ergebnisse im interdisziplinären Team diskutieren. Darüber hinaus sind die Studierenden in der Lage,mit den erlernten Methoden geeignete Werkstoffe für spezifische Anwendungen auszuwählen. Siediskutieren ihre Ergebnisse im interdisziplinären Team und tragen aktiv zur gemeinsamen Lösungsfindungbei. Die Studierenden können im vorgegebenen Rahmen selbstorganisiert lernen, Aufgaben selbständigbearbeiten, Ergebnisse mündlich und schriftlich präsentieren und in Gruppen diskutieren sowie kritischreflektieren. Sie können die erworbenen Fach- und Methodenkenntnisse aus den drei Teilbereichen sowiedie jeweiligen Anforderungen zusammenführen, um nachhaltige, innovative und praxisorientierteLösungsansätze zu entwickeln. Dabei bringen sie eigene kreative Ideen ein und zeigen in hohem Maßekonzeptionelles Denken Die Studierenden sind in der Lage, die erworbenen Kenntnisse, Fähigkeiten und Kompetenzen der dreiTeilbereiche in benachbarten Disziplinen und Schnittstellen der Mechanik wie der Elektronik, der Fertigung,der Montage und dem Marketing im betrieblichen Alltag einzusetzen und so aktiv in diesen Bereichenmitzuwirken"
    },
    {
        "title_de": "Forschungsmethoden und Innovation",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die Bedeutung des Innovationsmanagements für den Unternehmenserfolg darlegen, können Methoden beschreiben und bzgl. eines gegebenen Einsatzzwecks vergleichen, bewerten und auswählen. Sie sind in der Lage, qualitative und quantitative Methoden des wissenschaftlichen Arbeitens voneinander abgrenzen und bezüglich des Einsatzes beurteilen. Die Studierenden können Prozesse, Methoden und Werkzeuge des Innovationsmanagements beschreiben, beurteilen und auswählen. Die Studierenden können eine Forschungsfrage und das Forschungsdesign entwickeln, erarbeiten und passende wissenschaftliche Methoden auswählen und durchführen. Die Studierenden sind in der Lage Versuche zu konzipieren und Versuchsdaten statistisch auszuwerten. Sie können die Methoden bzgl. ihres Einsatzes und ihrer Praktikabilität einschätzen, an die gegebene Problemsituation anpassen und durchführen. Sie haben die Kompetenz erworben, Methoden und Werkzeuge des Innovationsmanagements einsetzen zu können, Produkte bzgl. ihrer Innovationskraft bewerten zu können, neue Produkte zur Marktreife zu bringen und die Ergebnisse kritisch zu prüfen. Die Studierenden haben ihre Kompetenz verbessert, Kreativität und strukturiertes forscherisches Arbeiten zur Unterstützung von Neuerungen und Innovationen im Unternehmen einzubringen. Sie sind in der Lage, Methoden des Innovationsmanagements mit Fachexpert*innen zu diskutieren, geeignet darzulegen und deren Einsatzmöglichkeiten zu dokumentieren. Die Studierenden sind in der Lage, Innovationsmanagement im Unternehmen mit Fachexpert*innen einzusetzen, zu realisieren und das gelernte Wissen für Problemstellungen in der Praxis einzusetzen."
    },
    {
        "title_de": "Systementwicklung und Architektur",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die Aufgaben eines Software-Architekten erläutern, die Architektur als grundlegendes Element der Softwareentwicklung beschreiben und die Einflüsse verschiedener Stakeholder (z.B. Produktmanagement, Produktstrategie, Entwicklung) darlegen. Sie können erläutern, wie sich Systemanforderungen in Architekturanforderungen niederschlagen und welche Wechselwirkungen zwischen Architektur und System-Design bestehen. Auf der Basis vertiefter Kenntnisse der Systemarchitektur begreifen sie diese als Mittel zur Realisierung nicht-funktionaler Anforderungen bzw. Qualitätsanforderungen und können die Qualität einer Architektur, z.B. durch den Einsatz von Architekturmethodiken (z.B. ATAM – architecture tradeoff analysis method …), beurteilen und Maßnahmen zur Qualitätsverbesserung definieren. Durch vertiefte Kenntnis wichtiger Standardarchitekturen für komplexe Systeme und die Fähigkeit, grundlegende Sichten auf eine Architektur zu unterscheiden (z.B. Funktional, Deployment) und Architekturen mit UML zu beschreiben, sind die Studierenden in der Lage, Architekturentscheidungen gezielt zu treffen und nachvollziehbar zu dokumentieren. Hierbei kennen und berücksichtigen sie typische Architekturmuster (z.B. für hohe Verfügbarkeit (Redundanz), Skalierbarkeit, Performanz, Wartbarkeit, Erweiterbarkeit) und können Architekturarbeiten erfolgreich in geläufige Basis-Vorgehensmodelle (z.B. evolutionäres Modell) und nicht-elementare Vorgehensmodelle (z.B. SCRUM) einordnen. Hierbei sind sie in der Lage, Architektur-Eigenschaften gegenüber Eigenschaften von Vorgehensmodellen abzuwägen und Entscheidungen im Projekt-Kontext zu treffen. Die Studierenden verstehen Evolution und Wartung als zentrale Architekturherausforderung im Softwarelebenszyklus und können Architektur-Refactoring und Architektur-Reengineering bzw. moderne architekturzentrische Ansätze (z.B. MDA, Model Driven Architecture) anwenden. Die Studierenden sind befähigt, fachspezifische Ergebnisse eigener Arbeit sowohl in einem Referat als auch als Dokumentation in Form eines schriftlichen Berichts darzustellen. Die Studierenden sind in der Lage, sich an der Lösung von Herausforderungen oder Problemen der betrieblichen Praxis aktiv zu beteiligen und Lösungsstrategien (mit) zu entwickeln."
    },
    {
        "title_de": "Wissensmanagement - Modelle und Strategien",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, Ziele und Motivation von Wissensmanagement in den jeweiligen Unternehmenskontexten abzuleiten. Gleichzeitig können sie Verfahren zur Identifikation, Entwicklung des intellektuellen Unternehmenskapitals erläutern und bezogen auf konkrete Use Cases anwenden. Zudem sind die Studierenden befähigt, etablierte Modelle des Wissensmanagements und der wissensorientierten Unternehmensführung zu analysieren und in den Anwendungszusammenhängen zu reflektieren. Studierende können komplexe Probleme der Wissensentwicklung, der Wissensspeicherung, des Wissenstransfers, der Wissensanwendung und der Wissensbilanzierung selbstständig identifizieren und interpretieren. Auf Basis fundierter Kenntnisse zu den Ansätzen einer ganzheitlichen Wissensmanagement-Strategie und eines Intellectual Capital Reportings sind sie befähigt, zugehörige Wissensmanagement-Modelle kritisch zu vergleichen und gezielt einzusetzen. Entlang den Elementen einer ganzheitlichen Wissensmanagement-Strategie sind die Studierenden in der Lage, die einschlägigen und geeigneten Methoden des Wissensmanagements innerhalb der Wissensman agement-Bausteine (Wissensentwicklung, Wissensspeicherung, Wissenstransfer, Wissensanwendung, Wissensbilanzierung) im Situationskontext zu identifizieren und zu adaptieren. Sie sind befähigt, die adaptierten Methoden nachhaltig im jeweiligen Anwendungszusammenhang einzusetzen. Die Studierenden sind in der Lage, Lösungsansätze des Wissensmanagements im Team zu diskutieren und zu bearbeiten. Dabei sind sie zur gegenseitigen, kritischen und konstruktiven Reflexion befähigt. Im Gedankenaustausch mit Personen anderer Fachgebiete können sie andere Sichtweisen aufgreifen und angemessen berücksichtigen. Sie verfügen über Kompetenz zur Berichtserstellung bei Wissensmanagement-Projekten. Die Studierenden können ihr Wissen auch auf neue Situationen der betrieblichen Praxis übertragen, in dem sie die Wissensmanagement-Methoden und -Instrumente im Lichte anderer Anwendungszusammenhänge reflektieren und diese gemeinschaftlich im Team für andere betriebliche Disziplinen und Anwendungszusammenhänge nutzbar machen."
    },
    {
        "title_de": "Advanced Data Mining und Web Mining",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über vertieftes Wissen über die Standardprozesse (u.a. Cross-Industry Standard Process for Data-Mining, CRISP) des Data-Mining, können diese erläutern und Möglichkeiten und Grenzen darlegen. Die Studierenden sind in der Lage, explorative Analysen mit Data & Web Mining Techniken eigenständig durchführen zu können. Sie können Techniken der Analyse und Verarbeitung unstrukturierter Daten (Text Mining) zielführend einsetzen und die Ergebnisse kritisch reflektieren. Die Studierenden können moderne Tools des Data-Mining zielführend einsetzen. Die Studierende sind in der Lage, den Einsatz von Data Mining Verfahren auch unter ethischen Aspekten bewerten. Sie sind in der Lage die fachliche Problemstellungen des Themenfelds Data Mining und Web Mining prägnant und verständlich darzulegen, zu diskutieren und zu dokumentieren. Die Studierenden haben die Kompetenz erworben, Techniken des Data Mining, Web-/Text-Mining und Natural Language Processing bzgl. des adäquaten Einsatzes im Unternehmen bewerten zu können. Sie können den aktuellen Stand der Methoden und Tools eigenständig verfolgen und die Einsetzbarkeit für Unternehmensaufgaben einschätzen."
    },
    {
        "title_de": "Semantic Web und Internet der Dinge",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über vertieftes Wissen über Semantic Web Technologien und deren Einsatzbereiche. Insbesondere können sie Konzepte des Semantic Web beschreiben und geeigete Einsatzbereiche auswählen. Sie können vorhandene Ontologien bewerten und die Nutzung von Inferenzen in ontologiebasierten Systemen darstellen. Die Studierenden kennen die Einsatzbereiche und Konzepte des Internet of Things und können den Einsatz semantischer Konzepte in diesem Themenfeld bewerten. Die Masterstudierenden haben mit Abschluss des Moduls die Kompetenz erworben, die Interpretationsvielfalt von Begriffen des Fachgebiets zu verstehen und Fachbegriffe bewusst und reflektiv zu verwenden. Die Studierenden sind in der Lage, Beschreibungslogiken einzusetzen und Inferenzmethoden an didaktischen Beispielen durchführen zu können. Die Studierenden haben die Kompetenz erworben, Wissenserhebungen zum Aufbau von Ontologien durchführen zu können und Anwendungen mit verteilten Wissen (z.B. auf Industrie- und Alltagsobjekte) überblicken und planen zu können. - -"
    },
    {
        "title_de": "IT Service Management",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, die technischen, organisatorischen und betriebswirtschaftlichen Grundlagen aus Sicht des IT Service Managements (ITSM) Frameworks (z.B. ITIL) zu beschreiben und zu erläutern. Sie können IST- und SOLL -Prozesse des ITSM analysieren und diese mit Good Practices aus ITSM-Frameworks vergleichen, um zu beurteilen, ob diese den unternehmens- und branchenspezifischen Anforderungen genügen. Nach erfolgreichem Absolvieren des Moduls sind die Studierenden in der Lage, Komponenten und Entwicklung einer IT-Service-Strategie und deren operative Umsetzung zu verstehen und darzulegen. Das erworbene Wissen zu ITSM Prozessen kann auf thematisch nahe Fachgebiete und Vorlesungen wie z.B. Enterprise Architecture, IT Governance & IT Strategy sowie das IT Project & Portfolio Management übertragen werden, um damit z.B. IT-Strategien und IT-Architekturen besser planen und unterstützen zu können. Die Studierenden sind in der Lage, Herausforderungen des ITSM zu identifizieren und auf Basis einer eigenständigen Recherche entsprechende Lösungsstrategien zu entwickeln, kritisch zu reflektieren und fallspezifisch zu diskutieren. Durch Übungen oder Fallstudien haben die Studierenden die Kompetenz erworben, eigenständig und systematisch Lösungen zu erarbeiten. Die Studierenden können Methoden und Vorgehensweisen des ITSM vergleichen, auswählen und sachgerecht anwenden. Die Studierenden können kritische Bereiche bei Service- und Prozessveränderung erkennen und damit alle Stakeholder im Changemanagement integrieren. Sie können eigenständig Arbeitspakete zum Veränderungsprozess im Bereich ITSM untergliedern, ihre Bearbeitung planen sowie Aufgaben im Team angemessen und zielfu¨hrend aufteilen. Studierende können Arbeitsstände bei der Einführung neuer Services verfolgen, die Ergebnisse der Teammitglieder aufeinander abstimmen und Teams entsprechend führen. Kenntnisse über das Zusammenspiel von Unternehmensführung und ITSM fördern dabei die persönlichen Kompetenzen, um Führungs- und Leitungsaufgaben zu übernehmen. Die Studierenden können die verschiedenen Kriterien oder Perspektiven des ITSM gegeneinander abwägen sowie strukturierte Entscheidungen zu IT Services begründen und treffen. Ihr Wissen über ITSM Frameworks und Methoden können sie auf neue Situationen der betrieblichen Praxis übertragen, wobei Good Practices und vorgeschlagene Prozesse kritisch verglichen bzw. bewertet werden und somit die situativ geeignetste Vorgehensweise identifiziert werden kann. Sie können sich daher an der Lösung von Problemen der betrieblichen Praxis im Bereich digitaler Services und digitaler Geschäftsmodellen aktiv beteiligen und Lösungsstrategien mitentwickeln."
    },
    {
        "title_de": "Data Center Design, Management und Operations",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind nach erfolgreichem Abschluss in der Lage, die technischen, organisatorischen und betriebswirtschaftlichen (personellen und finanziellen) Grundlagen eines Rechenzentrums bzw. einer IT-Abteilung darzulegen. Sie kennen die wesentlichen Grundlagen des Data Center Managements und können diese hinsichtlich Zielorientierung, Wirksamkeit und Umsetzbarkeit beurteilen. Nach erfolgreichem Absolvieren des Moduls sind die Studierenden in der Lage, eigenständig ausgewählte Fragen des Themenbereichs zu recherchieren, selbstständig Lösungsstrategien für ausgewählte Aufgabenstellungen zu entwickeln und die Ergebnisse kritisch zu reflektieren. Nach dem erfolgreichen Absolvieren des Moduls sind die Studierenden fähig komplexe Probleme im Bereich des Data Center Managements/Operations in Kleingruppen bzw. selbstständig zu bearbeiten und zu lösen, wie z.B. im Bereich des IT-Controllings oder der Konzeption eines Rechenzentrums. Sie sind befähigt die verschiedenen Sichtweisen und Interessen der einzelnen Stakeholder zu berücksichtigen und in eine Entscheidung einfließen zu lassen. Nach dem erfolgreichen Absolvieren des Moduls sind die Studierenden befähigt, ihr Wissen auf neue Situationen der betrieblichen Praxis des Data Center Managements/Operations zu übertragen, in dem sie die möglichen methodischen Ansätze kritisch vergleichen, bewerten und die situativ am besten geeigneten technischen/betriebswirtschaftlichen Vorgehensweisen umsetzen können."
    },
    {
        "title_de": "Enterprise Architecture",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind auf Grundlage ihrer Kenntnisse der technischen, organisatorischen und betriebswirtschaftlichen Zusammenhänge des Enterprise Architecture Managements (EAM) in der Lage, Auswirkungen von entsprechenden Änderungen in diesen Architekturen zu bewerten sowie diese strategisch einzuordnen. Sie können IST- und SOLL-Zustände der Enterprise Architecture analysieren und diese miteinander vergleichen, um zu beurteilen, ob diese den unternehmens- und branchenspezifischen Anforderungen genügen. Nach erfolgreichem Absolvieren des Moduls sind die Studierenden in der Lage, Komponenten und Entwicklungen einer Enterprise Architecture zu verstehen und darzulegen. Das erworbene Wissen zu EAM kann dabei auf thematisch nahe Fachgebiete und Vorlesungen wie z.B. IT Service Management, IT Governance & IT Strategy sowie das IT Project & Portfolio Management übertragen werden, um damit Technologiestrategien, IT-Services und IT Governance Strukturen besser planen und unterstützen zu können. Die Studierenden verfügen über vertiefte Kenntnisse der gängigen Enterprise Architecture Management Frameworks und Methoden (z.B. TOGAF, Zachman, etc.) und können die verschiedenen Ebenen des EAM (Technology Layer, Application Layer und Business Layer) wertschöpfend an die Unternehmens- und IT-Strategie bzw. an die Vorgaben der Corporate- und IT-Governance anpassen. Sie sind in der Lage, Herausforderungen des EAM zu identifizieren und auf Basis einer eigenständigen Recherche entsprechende Lösungsstrategien zu entwickeln, kritisch zu reflektieren und fallspezifisch zu diskutieren. Die Kompetenz zur systematischen Erarbeitung oder Erörterung von Enterprise Architekturen haben sie anhand von Übungen oder Fallstudien erworben. Sie können Methoden und Vorgehensweisen des EAM zu vergleichen, auswählen und anwenden. Die Studierenden sind befähigt, kritische Bereiche und Veränderungen in der Enterprise Architecture erkennen und damit alle Stakeholder im Veränderungsprozess integrieren und begleiten. Sie können eigenständig Arbeitspakete zum Veränderungsprozess im Bereich EAM untergliedern, ihre Bearbeitung planen sowie Aufgaben im Team angemessen und zielfu¨hrend aufteilen. Die Studierenden können Arbeitsstände bei der Einführung neuer Architekturen innerhalb verschiedensten EA Layer (Technology, Applikation, Business) verfolgen, die Ergebnisse der Teammitglieder aufeinander abstimmen und Teams führen. Kenntnisse über das Zusammenspiel von Unternehmensführung und EAM fördern dabei die persönlichen Kompetenzen, um Führungs- und Leitungsaufgaben zu übernehmen. Die Studierenden können ihre Kenntnisse der unterschiedlichen technischen, organisatorischen und betriebswirtschaftlichen Grundlagen und Aspekte des Enterprise Architecture Managements und ihrer Signifikanz bei der Digitalisierung von Unternehmen und Geschäftsmodellen in die betriebliche Praxis einbringen. Sie sind in der Lage, die verschiedenen Kriterien oder Perspektiven des EAM gegeneinander abzuwägen und strukturierte Entscheidungen zu Architekturveränderungen treffen und begründen. Ihr Wissen über EAM Frameworks und Methoden können sie auf neue Situationen der betrieblichen Praxis übertragen, wobei Referenzarchitekturen und vorgeschlagene Prozesse kritisch verglichen bzw. bewertet werden und somit die situativ geeignetste Vorgehensweise identifiziert werden kann. Sie können sich daher an der Lösung von Problemen der betrieblichen Praxis im Bereich Unternehmensarchitektur und Digitalisierung aktiv beteiligen und Lösungsstrategien mitentwickeln. Stand vom 10.07.2025 T3M40303 // Seite 284"
    },
    {
        "title_de": "IT-Sicherheit",
        "ects": 5,
        "learning_outcomes_de": "Nach erfolgreichem Abschluss des Moduls sind die Studierenden in der Lage, auf Basis vertiefter Kenntnisse typische Bedrohungen der IT-Sicherheit in einem Unternehmen detailliert zu beschreiben. Sie können die den Schwachstellen zugrundeliegenden technischen oder organisatorischen Ursachen identifizieren, Angriffsvektoren erkennen und adäquate wesentliche Schutzmaßnahmen, etwa aus den Bereichen Betriebssystem- und Netzwerksicherheit, Web-basierte Anwendungen, Identitätsmanagement und sichere Software-Entwicklung, darlegen und ihren Einsatz vergleichend beurteilen. Die Studierenden sind in der Lage, kritisch über gängige Mechanismen und Werkzeuge zum Schutz von IT-Systemen, -Infrastrukturen und -Prozessen zu diskutieren und eigenständig geeignete Gegenmaßnahmen zu vergleichen, auszuwählen und eigenständig anzuwenden. Die Studierenden haben ein Bewusstsein für Sicherheitsrisiken und die Notwendigkeit eines IT-Sicherheitsmanagements in Unternehmen entwickelt. Sie sind in der Lage, ihre Einschätzungen und Empfehlungen in einem schriftlichen Bericht darzulegen sowie im Gespräch mit Expert*innen mittels theoretisch und methodisch fundierter Argumentation zu begründen und zu verteidigen. Die Studierenden sind befähigt, selbständig in ihrer beruflichen Karriere die Entwicklung von Angriffsmustern sowie neuen Schutzmechanismen anhand der Fachliteratur zu verfolgen, um zur Abwehr künftiger Bedrohung geeignete Strategien für das eigene Unternehmen zu entwickeln und dabei unter vorhandenen Lösungsansätzen die situativ am besten geeignete Lösung auszuwählen. Sie sind in der Lage, Handlungsempfehlungen für das Unternehmen zu entwickeln und diese Führungskräften gegenüber darzustellen und zu vertreten."
    },
    {
        "title_de": "Angewandte Kryptographie",
        "ects": 5,
        "learning_outcomes_de": "Nach erfolgreichem Absolvieren des Moduls sind die Studierenden in der Lage, auf Basis eines vertieften Verständnisses der wesentlichen mathematischen Prinzipien moderne kryptographische Verfahren zu beschreiben und mögliche Angriffsszenarien darzulegen. Sie können die Bedeutung von kryptographischen Verfahren zum Schutz von sensitiven Unternehmensinformationen und personenbezogenen Daten sowie mögliche Schwierigkeiten bei der praktischen Umsetzung erläutern. Auf Basis der Vor- und Nachteile einzelner kryptographischer Verfahren können sie eine fundierte Analyse vornehmen und bewerten, welche Verfahren unter welchen Bedingungen anwendungsspezifisch eingesetzt werden können. Die Studierenden können Konzepte für die Anwendung entwickeln und diese praktisch umsetzen. Unter Nutzung einschlägiger Werkzeuge wie Softwarebibliotheken können sie eigenständig kryptographische Funktionalitäten in eigene Anwendungen auf sichere Weise integrieren. Die Studierenden können nach der Veranstaltung qualifiziert über das Themenfeld kommunizieren, ihr Wissen anhand der Fachliteratur eigenständig vertiefen und die eingesetzten Verfahren und erzielten Ergebnisse kritisch reflektieren. - Die Studierenden haben die Kompetenz erworben, im Laufe ihrer beruflichen Tätigkeit selbständig künftige Entwicklungen auf dem Feld der Kryptographie, etwa im Zusammenhang mit Quantencomputern, zu verfolgen, die Bedeutung für das eigene Unternehmen zu erkennen und zu bewerten sowie die Anwendung auf Problemstellungen der Unternehmenspraxis mit zu gestalten. In Gesprächen mit Fachvertreter*innen, Fachfremden und/oder Führungskräften anderer Bereiche können sie die Ergebnisse ihrer Analysen darstellen und ihre Lösungskonzepte vertreten."
    },
    {
        "title_de": "Labor IT Sicherheit",
        "ects": 5,
        "learning_outcomes_de": "Nach erfolgreichem Abschluss des Moduls sind die Studierenden in der Lage, fundiert darzulegen, welches die maßgeblichen Bedrohungen der Informationssicherheit von Unternehmenssystemen und -infrastrukturen sind, eine Risikobeurteilung vorzunehmen sowie technische und organisatorische Maßnahmen zur Risikominimierung begründet auszuwählen. Die Studierenden sind befähigt, für ausgewählte Aufgabenstellungen zur IT-Sicherheit eigenständig Lösungen in Kleingruppen zu erarbeiten, diese praktisch umzusetzen und ihre Ergebnisse zu dokumentieren. Sie sind in der Lage, die Ergebnisse vorzustellen, mit Expert:innen zu diskutieren und im Hinblick auf Wirksamkeit und Wirtschaftlichkeit kritisch zu reflektieren. - -"
    },
    {
        "title_de": "Mobile Computing",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können technische und konzeptionelle Grundlagen der Entwicklung und des Managements mobiler Anwendungen beurteilen und analysieren. Sie können wesentliche Aspekte der Gestaltung benutzerdefinierter Apps an- und umsetzen. Zudem können sie Vor- und Nachteile mobiler Technologien für einen Einsatzzweck darlegen und bewerten sowie technische Realisierungsalternativen abwägen. Die Studierenden können konzeptionell denken sowie eine mobile App in mindestens einem Ansatz technisch unter Bezugnahme gängiger Backend-Technologien entwickeln. Sie können den Vorfertigungsgrad mobiler Anwendungen begründet erhöhen. Die Studierenden sind in der Lage, den fachlichen und den methodischen Kenntnisstand Einzelnen oder in Teams entsprechend für die Entwicklung mobiler Apps umzusetzen. Sie sind in der Lage, Arbeitspakete aus den Entwicklungsprojekten zu definieren, den Entwicklungsprozess fortlaufend zu verfolgen und die Ergebnisse der Teammitglieder aufeinander abzustimmen. Zudem können sie im Erfahrungsaustausch ihren Standpunkt durch Belege klar vertreten. Die Studierenden können sich in ihrer weiteren beruflichen Karriere im Thema selbständig auf dem aktuellen Stand der Technik halten. Sie können im Unternehmen Teilprobleme selbstständig auf Basis wissenschaftlicher und praktischer Quellen lösen und weitere Entwicklungen selbst einschätzen."
    },
    {
        "title_de": "Verteilte Systeme",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über vertieftes Wissen über grundlegende Konzepte, Prinzipien und Algorithmen zur Realisierung verteilter Systeme, über Architekturen für verteilte Systeme und können Anwendungsszenarien und Einsatzgebiete der Techniken in der Praxis zuordnen und bewerten. Sie können die wichtigsten Services in verteilten Systemen erläutern. Sie können einschätzen welche Lösungen für eine verteilte Anwendung zielführend sind und können diese vergleichen und bewerten. Sie sind befähigt, wichtige Middleware-Software und Prinzipien von Middleware-Frameworks, sowie zugehörige verteilte Laufzeitinfrastrukturen zur effizienten Umsetzung von verteilten Systemen darzulegen. Die Studierenden sind in der Lage, die Qualität verteilter Softwarelösungen in Bezug auf Verfügbarkeit, Fehlertoleranz, Performanz oder die Konsequenzen und Risiken verteilter Systeme in Bezug auf Sicherheit, u.a. bzgl. Ausspähen und Profilbildung/-verfolgung dezentral gelagerter Nutzerinformationen sowie dezentral nutzbar Dienstleistungen kritisch zu hinterfragen und zu bewerten. Die Studierenden können verteilte Systeme konzipieren und in Teilen auch selbst implementieren. Sie sind befähigt, verteilte Systeme eigenständig hinsichtlich Fehlertoleranz und Sicherheit zu analysieren und zu beurteilen. - -"
    },
    {
        "title_de": "Kommunikationssysteme",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen nach Abschluss des Moduls über vertieftes Wissen über Weitverkehrsnetze und Protokolle und können diese kritisch beurteilen. Sie haben fundierte Grundlagen für die Anwendungsgebiete Dienste im Internet und in der mobilen Kommunikation. Sie können Ergebnisse von Messungen mittels Protokoll-Analysatoren vergleichen und kritisch beurteilen. Die Studierenden haben mit Abschluss des Moduls die Kompetenz erworben, eigenständig tiefer in Fragestellungen mobiler Anwendungen, sowie Anwendungen und Dienste im Internet einzudringen (Verarbeitung von Transaktionen, Sicherheit, verteilte Funktionen, …) und sich auf hohem fachlichen Niveau mit Expert*innen auszutauschen. - Die Studierenden haben die Kompetenz erworben, Anwendungsfälle aus dem Bereich komplexer, vernetzter und verteilter Systeme zu erkennen, fallbezogen zu bewerten und im Kontext der Anwendung weiter zu entwickeln (z.B. Steuerungen; Anwendungen mit Kommunikationsschnittstellen aus der Informationstechnik, aus der Automatisierung, bzw. für Fahrzeuge; Integration in ein Gesamtsystem, ...) die erworbenen Grundlagen und Methoden in der betrieblichen Praxis einzusetzen."
    },
    {
        "title_de": "Intelligent Agents Systems",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können Systeme konzipieren und modellieren, in welchen intelligente Agenten in Interaktion zueinander treten. Dabei greifen sie auf Wissen aus der Spieltheorie, der mathematischen Optimierung und des maschinellen Lernens zurück. Sie sind in der Lage, die Methoden bzgl. der Einsetzbarkeit für die Problemstellung zu bewerten, zu vergleichen und an diese anzupassen. Die Studierenden können Agentensysteme konzipieren und in Teilen praktisch umsetzen. Sie sind in der Lage, den Entwurf und die Implementierung interagierender Agenten für praktische Anwendungen unter Nutzung von Agentenframeworks eigenständig sowie in Teams zu erstellen und umzusetzen. Die Studierenden sind in der Lage, ein agentenbasiertes System als komplexe, wissenschaftliche Aufgabe eigenständig in Einheiten zu untergliedern, die Kommunikation zwischen diesen zu konzipieren und dies im Rahmen eines Projekts fortlaufend zu verfolgen und die Aufgabenstellung fristgerecht zu lösen. Die Studierenden haben die Kompetenz erworben, den Einsatz von Agentensystemen zur Lösung betrieblicher Aufgabenstellung kritisch mit anderen Ansätzen zu vergleichen, zu bewerten und umsetzen zu können."
    },
    {
        "title_de": "Advanced Algorithms",
        "ects": 5,
        "learning_outcomes_de": "Nach erfolgreichem Absolvieren des Moduls sind die Studierenden in der Lage, auf Basis eines vertieften Verständnisses der wesentlichen algorithmischen Verfahren deren Funktionsweise, Besonderheiten und Limitationen zu beschreiben und zu vergleichen sowie deren Eignung für typische Anwendungsgebiete zu beurteilen. Studierende können eigenständig effiziente Strategien für konkrete algorithmische Probleme finden und Lösungen auch praktisch umsetzen. Dabei können sie die Korrektheit ihrer Implementierungen begründen sowie experimentell am Rechner überprüfen. Die Studierenden sind in der Lage, Problemstellungen selbständig zu bearbeiten und ihre gefundenen Lösungsansätze mittels theoretisch und methodisch fundierter Argumentation zu begründen. In Diskussionen zeigen sie, dass sie zu einem fachlichen Austausch mit Expert*innen in der Lage sind. Studierende werden befähigt, für die in der betrieblichen Praxis auftretenden, herausfordernden Fragestellungen adäquate Lösungsstrategien zu entwickeln, ihre Konzepte nachvollziehbar darzustellen und diese vor Teammitgliedern zu vertreten."
    },
    {
        "title_de": "Einsatz funktionaler Programmiersprachen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, die Unterschiede zwischen funktionalen, objektorientierten und imperativen Programmiersprachen zu erläutern. Sie können die Vorteile und Einsatzgebiete funktionaler Programmiersprachen beschreiben und aktuell verfügbare Sprachen und deren Eigenschaften im Überblick darlegen. Die Studierenden können grundlegende Implementierungen mit Hilfe einer funktionalen Programmiersprache durchführen. - Die Studierenden sind nach Abschluss des Moduls in der Lage, an Hand der Vor- und Nachteile gegenüber anderen Programmiersprachen zu entscheiden, welche Aufgabenstellungen sich sowohl im Betrieb als auch im privaten Umfeld gut mit funktionalen Methoden implementieren lassen."
    },
    {
        "title_de": "Agile Prozessmodelle",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können aktuelle agile Vorgehensmodelle (Prozessmodelle) - wie Scrum, Kanban und fortgeschrittenere Modelle - erläutern und ihre Vor-und Nachteile beschreiben. Sie sind in der Lage, den Einsatz der Modelle im Hinblick auf ausgewählte Einsatzbereiche vergleichend zu beurteilen. Die Studierenden sind in der Lage, die erlernten agilen Modelle eigenständig in einem ausgewählten Projekt anzuwenden und die erzielten Ergebnisse kritisch zu reflektieren. Die Studierenden sind in der Lage, komplexe Probleme selbständig im Projektteam mit agilen Modellen zu bearbeiten, gemeinsam Lösungsansätze zu entwickeln und die Ergebnisse gegenüber anderen zu vertreten. Die Studierenden sind in der Lage, in der betrieblichen Praxis in modernen agilen Entwicklungsprojekten aktiv mitzuarbeiten und erlernte agile Techniken zielführend einzusetzen."
    },
    {
        "title_de": "Intelligente Interaktive Systeme",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über vertieftes Wissen über Ein-/Ausgabegeräte und deren Einsatz in interaktiven Systemen. Sie kennen die aktuellen Methoden der Anwendungsentwicklung für interaktive Systeme, können diese kritisch beurteilen und für den Einsatz adäquat auswählen. Sie können Emotionsmodelle für die Erkennung, Modellierung und Darstellung darlegen. Die Studierenden haben die Prinzipien des UX Design, des Persuasive Computing und der bedieneradaptiven Systeme verstanden und können deren Möglichkeiten und Grenzen darlegen. Die Studierenden haben die Kompetenz erworben, Interaktionsmodelle zu entwerfen, zu erstellen und deren Nutzbarkeit experimentell zu überprüfen und ritisch zu reflektieren. Die Studierenden sind in der Lage, die gewonnene Erkenntnisse prägnant und verständlich für andere aufzubereiten. Sie können ihre Entscheidungen bzgl. der beruflichen Einsatzbereiche kritisch zu reflektieren und einordnen. Die Studierenden sind in der Lage, Einsatz und Nutzung von Systemen im betrieblichen Alltag mit zukünftigen Nutzern zusammen zu erarbeiten."
    },
    {
        "title_de": "Advanced Software Engineering",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen und verstehen aktuelle Vorgehensmodelle und sind in der Lage, im Hinblick auf die Eignung für einen Unternehmens-Kontext, Modelle vergleichend zu analysieren und zu bewerten. Hierfür lernen sie exemplarisch das CMMI-Konzept zur Softwareprozessverbesserung kennen. Durch eine Vertiefung in UML und Objekt-orientiertem Entwurf sind sie in der Lage, geeignete Entwurfsdiagramme auszuwählen und zu beurteilen, bis zu welchem Grad ein Objekt-orientierter Entwurf in der Praxis sinnvoll ist. Die Studierenden kennen verschiedene Techniken und Verfahren des Software Engineering nach der ersten Release: Gezielte Pflege, Wartung, Erweiterung, Refactoring, Evolution und Migration von Altsystemen. Sie können diese beschreiben und ihre Vor- und Nachteile darlegen. Die Studierenden sind in der Lage, Software-Engineering-Prinzipien und Konzepte in großen Projekten, die sich in einem komplexen Umfeld (Millionen LOC, viele Mitarbeiter) befinden, anzuwenden. Sie kennen und verstehen Konzepte zur Entwicklung und Integration komplexer, heterogener (Technologien/Plattformen) verteilter Systeme und können diese im Projektkontext erfolgreich anwenden. Sie sind in der Lage, die Besonderheiten bei verteilter Entwicklung, Offshoring und Outsourcing zu berücksichtigen und entsprechende Maßnahmen zu planen und umzusetzen. Die Studierenden kennen und verstehen die Besonderheiten von nicht-funktionalen Anforderungen und sind in der Lage, basierend auf SW-Qualities Spezifikationen, Umsetzungen und Teststrategien festzulegen und deren Erfolg quantitativ zu messen und zu analysieren. Hierfür kennen und verstehen sie aktuelle Projekt-, Software- und System-Maße (-Metriken), können diese anwenden und deren Eignung beurteilen. Weiterhin sind sie in der Lage, neue Maße zu erstellen, die in optimaler Art und Weise für einen Projekt-Kontext geeignet sind. Die Studierenden sind befähigt, eine eigenständig gewählte Aufgabenstellung im Team selbständig zu planen und zu bearbeiten. Sie teilen die Arbeiten im Team angemessen und zielführend auf und verfolgen den Arbeitsstand fortlaufend. Sie können die Bearbeitung termingerecht abschließen, die Ergebnisse der Teammitglieder aufeinander abstimmen und die Ergebnisse im Rahmen einer Teampräsentation darstellen. -"
    },
    {
        "title_de": "Advanced Machine Learning and Deep Learning",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können probabilistische Lernmodelle, Tiefe Netze, rekursive Netze und Reinforcement Learning auf ihre Einsatzmöglichkeiten hin bewerten und an gegebene Problemstellungen anpassen. Die Studierenden haben die Funktionsweise und mathematisch-technischen Prinzipien von Lernverfahren verstanden und können dies zur Konzeption und Realisierung geeigneter Lernmodelle einsetzen. Die Studierenden sind in der Lage, die Anwendung maschineller Lernverfahren für Unternehmensaufgaben zu beurteilen, geeignete Verfahren auszuwählen und problembezogen weiterzuentwickeln. - Die Studierenden sind in der Lage, die Aufgabenstellung für ein Lernsystem mit Hilfe von Domänenwissen und mit Fachexperten genau zu ermitteln um geeignete Verfahren zielführend einsetzen zu können."
    },
    {
        "title_de": "Programming for Data Science",
        "ects": 5,
        "learning_outcomes_de": "Mit erfolgreichem Abschluss des Moduls haben sich die Studierenden ein fundiertes Anwendungswissen der aktuell wichtigsten Programmiersprachen und Werkzeuge für die Datenanalyse erarbeitet. Sie können jeweilige Stärken und Schwächen der einzelnen Software-Werkzeuge identifizieren sowie bewährte Vorgehensweisen ihrer Anwendung vergleichend gegenüberstellen und ihre Zweckmässigkeit für den Einzelfall bewerten. Nach dem erfolgreichen Abschluss des Moduls sind die Studierenden in der Lage, Aufgabenstellungen zur Datenanalyse und -auswertung in verschiedenen Anwendungsgebieten selbstständig zu analysieren und zu bearbeiten. Auf der Grundlage der vermittelten Kenntnisse sind sie dazu befähigt, die für die Lösung geeignetsten technischen Werkzeuge und Methoden auszuwählen, durch selbst geschriebene Programme zu ergänzen, die so konzipierte Gesamtlösung zu implementieren, kritisch zu reflektieren und die gewonnen Ergebnisse durch ansprechende Berichte zu kommunizieren. - -"
    },
    {
        "title_de": "Simulationstechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, den Zusammenhang zwischen Systemen und ihrer Simulation zu verstehen, zu analysieren und die Grenzen der Simulation zu erläutern. Ferner können sie die anwendbaren Techniken und Methoden erläutern und die jeweiligen Grenzen beschreiben. Die Studierenden verfügen über das in den Modulinhalten aufgeführte Spektrum an Methoden und Techniken zur Bearbeitung komplexer, wissenschaftlicher Probleme in ihrem Studienfach. Sie analysieren eigenständig die Aufgabe, wählen entsprechende Methoden aus und wenden diese an, um neue Lösungen zu erarbeiten und kritisch zu reflektieren. - Die Studierenden zeichnen sich durch fundiertes fachliches Wissen, Verständnis für übergreifende Zusammenhänge sowie die Fähigkeit, theoretisches Wissen in die betriebliche Praxis zu übertragen und betriebliche Aufgabenstellungen zu simulieren, aus. Außerdem können sie die Resultate und Grenzen der Simulation schriftlich und mündlich zu vertreten."
    },
    {
        "title_de": "Intelligente Autonome Robotersysteme",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über vertieftes Wissen zu den Grundlagen von autonomen Robotersysteme und zugehöriger Sensorsysteme. Nach erfolgreichem Abschluss des Moduls sind sie in der Lage, die Möglichkeiten, Einsatzgebiete und Grenzen unterschiedlicher Systeme und Verfahren zu vergleichen und zu beurteilen. Die Studierenden haben die Kompetenz erworben, den Einsatz von Robotersystemen zur Lösung komplexer Aufgabenstellungen zu analysieren und kritisch zu bewerten. Die Studierenden sind in der Lage, Lösungsstrategien für komplexe Problemstellungen zu entwickeln und ein Verfahren zur Umsetzung auszuwählen, anzupassen und zu implementieren. Sie sind in der Lage, für ausgewählte Use-Cases, Lösungen zu entwerfen, umzusetzen und die Ergebnisse kritisch zu reflektieren. - Die Studierenden haben die Kompetenz erworben, den Einsatz von Robotersystemen zur Lösung von Aufgabenstellungen in der betrieblichen Praxis anzuwenden und zu bewerten. Im Diskurs mit Expert*innen können Sie den praktischen Einsatz von Robotersystemen erläutern und die Ergebnisse kritisch beurteilen."
    },
    {
        "title_de": "Quantencomputing",
        "ects": 5,
        "learning_outcomes_de": "Nach erfolgreichem Abschluss des Moduls sind die Studierenden befähigt, Quanten Computing zu beschreiben und Möglichkeiten und Grenzen darzulegen. Insbesondere können sie potenzielle Algorithmen und Use-Cases (v.a. Optimierung und Machine Learning) auf sog. NISQ-Architekturen anwenden und beurteilen. Hierfür analysieren sie grundlegende algorithmische Ideen des Quanten Computing und übertragen sie auf geeignete Weise auf konkrete Fallgestaltungen. Hierbei ist ein wichtiger Punkt die Abschätzung eines sog. „Quanten-Vorteils“. Die Studierenden sind in der Lage, Quanten Computing auf konkrete Anwendungsprobleme eigenständig anzuwenden. Dies beinhaltet die Auswahl des geeigneten Software-Frameworks sowie ggf. der entsprechenden physikalischen Infrastruktur für die konkreten Berechnungen. Die Studierenden sind insbesondere dazu befähigt, gängige Frameworks auf Basis von Python für Quanten Computing eigenständig zu nutzen. Die Studierenden sind nach erfolgreichem Absolvieren des Moduls durch die Arbeit in Hand-On-Labs in der Lage, konkrete Anwendungsprobleme mittels Quantum Computing eigenständig im Team zu bearbeiten und die Ergebnisse zu präsentieren. Sie verfolgen durch eine strukturierte Entscheidungsfindung einen geeigneten Lösungsweg und vertreten Vorgehensweise und Ergebnisse bei der Präsentation vor der Gruppe bzw. dem Dozenten. Quanten Computing ist ein stark interdisziplinäres Feld, das eine Zusammenarbeit zwischen unterschiedlichen Disziplinen der Informatik sowie Naturwissenschaft, und Anwendern in Fachbereichen bedingt. Die Studierenden sind befähigt, sowohl die Möglichkeiten als auch die Restriktionen von Quanten Computing zu erkennen und Rückschlüsse auf potenzielle Anwendungen in Unternehmen zu ziehen. Dies befähigt sie dazu, in konkreten Situationen der betrieblichen Praxis auf die adäquate Technik zurückzugreifen und gegenüber Fachvertreter*innen und Fachfremden zu begründen."
    },
    {
        "title_de": "Seminar Programmiersprachen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können wesentliche Unterschiede zwischen unterschiedlichen Paradigmen von Programmiersprachen beschreiben. Darüber hinaus können die Studierenden erläutern, wie sich eine Programmiersprache weiterentwickelt und welche Entwicklungen der Programmiersprache es Anwendenden erleichtert, darin Programme zu schreiben. - - Die Studierenden sind nach Abschluss des Moduls in der Lage zu entscheiden, welche Programmierparadigmen sich für welche Aufgabenstellungen gut eignen und können die Vor- und Nachteile der unterschiedlichen Programmierparadigmen beschreiben."
    },
    {
        "title_de": "Bildverarbeitung und Bildverstehen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die Wirkung und Einsetzbarkeit von Methoden der Bildverarbeitung vergleichen und im Anwendungsfall einschätzen und beurteilen. Sie haben ein tiefes mathematisches Verständnis der benötigten Bildverarbeitungsmethoden und können diese erklären und vergleichen. Die Studierenden sind in der Lage, die Möglichkeiten und Grenzen der klassichen Bildverarbeitung und der auf maschinellem Lernen basierenden Bildverarbeitung einzuschätzen und zu bewerten. Die Studierenden können Bildverarbeitungsmethoden mit Hilfe von Tools und Bibliotheken in Softwareprojekten einsetzen und geeignete BV-Anwendungen entwickeln. Die Studierenden sind in der Lage die erlernten Methoden entsprechend der Eignung für ein Anwendungsprojekt kritisch zu beurteilen, auszuwählen und zu einer Gesamtlösung zu synthetisieren und weiter zu entwickeln. - -"
    },
    {
        "title_de": "Methoden der Künstlichen Intelligenz und Computational Intelligence",
        "ects": 5,
        "learning_outcomes_de": "Dies Studierenden haben sich mit der Entwicklung der Methoden der Künstlichen Intelligenz auseinander gesetzt und können deren Einsatzzweck und Leistungsfähigkeit erläutern. Sie können Anwendungsfälle analysieren und geeignete KI Methoden zu deren Lösung bewerten, auswählen und orchestrieren. Die Studierenden haben eine guten Überblick über Schätzmethoden (Probabilistische Netze, Fuzzy Systeme, Evidenztheorie), können diese an praktischen Beispielen zur Problemlösung einsetzen und die Vorgehensweise begründen und erläutern. Die Studierenden sind in der Lage, die KI Methoden auf praktische Problemstellungen selbständig und erfolgreich anzuwenden. Sie können aktuelle KI Methoden (insbesondere logisch-deduktive Verfahren, probabilistische und heuristische Verfahren) für die Konzeption intelligenter Anwendungen auswählen, einsetzen und dies kritisch reflektieren. Die Studierenden können die gesellschaftlichen Auswirkungen und ethischen Fragestellungen des Einsatzes von Künstlicher Intelligenz einschätzen und erläutern. Sie sind in der Lage die Lösungsansätze mit Fachvertretern (und Laien) zu begründen und zu diskutieren. Die Studierenden sind in der Lage, die aktuelle Entwicklung des Themenfelds einzuschätzen und bzgl. der Nutzbarkeit im Unternehmen zu bewerten sowie erlernte Methoden auf praktische Problemstellungen anzupassen."
    },
    {
        "title_de": "Maschinelles Lernen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können die mathematischen Grundlagen, die Möglichkeiten, Verfahren, Einsatzgebiete, Bewertungsmaßstäbe und Grenzen der grundlegenden Verfahren des (symbolischen und subsymbolischen) maschinellen Lernens erläutern. Die Studierenden sind in der Lage, Lernverfahren zu bewerten, für den praktischen Einsatz passend zur Problemstellung auszuwählen und an diese anzupassen. Die Studierenden kennen Methoden zur Auswahl und Bewertung von Lernverfahren kennengelernt und können deren Möglichkeiten und Grenzen bezogen auf den Anwendungsfall kritisch beurteilen. Die Studierenden können die erlernten Methoden zur Problemlösung am praktischen Beispiel eigenständig einsetzen und die Lernergebnisse kritisch beurteilen. Die Studierenden sind in der Lage, Bibliotheken und Tools zu nutzen und für ausgewählte Beispielanwendungen geeignete Konfigurationen zu entwerfen. Die Studierenden sind in der Lage, die nichttechnischen Fehlermöglichkeiten von selbstlernenden Systemen einzuschätzen und auch ethische Gesichtspunkte beim Einsatz der Systeme zu berücksichtigen. Die Studierenden können den aktuellen Stand der technischen Möglichkeiten verfolgen und die Bedeutung für den Einsatz im Unternehmen einschätzen. Sie können Lösungsansätze mit Fachexpert*innen diskutieren und sind in der Lage, deren Möglichkeiten und Grenzen bezogen auf den Anwendungsfall kritisch zu beurteilen."
    },
    {
        "title_de": "Ringvorlesung Integrierte Engineering-Lösungen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über ein breites, praxisorientiertes Verständnis zum neusten Stand des Wissens im Bereich integrierter Engineering-Lösungen und der Digitalen Transformation im Unternehmenskontext ('Industrie 4.0'). Die Studierenden sind in der Lage, die Zusammenhänge von modernen technologischen Lösungen insbesondere mit IT-Hintergrund und den entsprechenden Geschäftsprozessen zu analysieren und im Bezug auf technisch-wirtschaftliche Kriterien zu bewerten. Es werden verschiedenste Prozesse und Werkzeuge des Ingenieurwesens kenengelernt, die auch auf das eigene Unternehmen übertragen werden können. Sie können einen Status-Quo im Unternehmen erfassen, eine realistische Ziel-Definition für die technologische Weiterentwicklung erstellen und einen groben Projektplan zu dessen Umsetzung mit allen betrieblich relevanten Aspekten erstellen. Die Studierenden sind in der Lage, Prozesse und Technologien in verschiedenen (auch neuen/fachfremdem) Bereichen zu analysieren und kritisch zu bewerten. Die Studierenden verstehen sich als Initiatoren in ihren Unternehmen, die Informationen sammeln, mit Zielen verbinden und Lösungskonzepte kommunizieren sollen. Sie sind sich der Verantwortung als Gestalter neuer Arbeitswelten bewusst. Die Studierenden sind sich der Auswirkungen technologischer Innovationen auf die Arbeitswelt bewusst und können Veränderungen für die Mitarbeiter zu Arbeitsinhalten und Qualifikationsbedarfen erklären. Die Studierenden können multidisziplinäre Zusammenhänge erfassen und bewerten und Ableitungen für den Einsatz und den Wert neuer Prozesse und Technolologien in anderen Bereichen und Unternehmen ziehen."
    },
    {
        "title_de": "Systemische Unternehmensprozesse",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden erkennen die hohe Bedeutung der systemischen Unternehmensprozesse und das Potential deren Optimierung im Sinne des Erreichens der Unternehmensziele. Er erfährt die Möglichkeiten der Ausgestaltung von Unternehmensprozessen im Zusammenspiel mit Menschen, Ressourcen, Anlagen und Produkten sowie die begleitende Unterstützung durch Informationsprozesse und -syteme. Die Studierenden erhalten einen Überblick über aktuelle Konzepte, Prozesse, Technologien und Systeme in den Bereichen Produktion, Logistik und Servicemanagement. Des Weiteren erhalten die Studierenden Einblick in neuartige Konzepte, Verfahren und Technologien sowie aktuelle Forschungsergebnisse aus dem Bereich der Digitalen Transformation (Industrie 4.0‘) sowie Trends im Informationsmanagement. Hierbei werden die Potentiale und Ansatzpunkte für die weitere Ausgestaltung von Unternehmensprozessen aufgezeigt. Durch den Aufbau und Auswahl der Lehrveranstaltungen ist das Modul sehr praxisorientiert und interaktiv, d.h. die Studenten wirken bei der Erarbeitung der Inhalte und Kompetenzen aktiv mit (Fallbeispiele, Gruppenübungen, Seminarvorträge). Der Student wird entscheidend in seiner Fähigkeit unterstützt, komplexe und disziplinübergreifende Sachverhalte zu erfassen, zu analysieren, zu beschreiben und eine Lösung zuzuführen. Das fachübergreifende und integrative Denken und Handeln wird unterstützt und das Zusammenarbeiten in interdisziplnären Teams weiterentwickelt. Durch die integrative und interdisziplinären Orientierung des Moduls wird der Student die hohe und entscheidende Bedeutung der Teamorientierung und die Erarbeitung von Lösungen in Gruppen verschiedener Fachdisziplinen des Ingenieurwesens erfahren und verinnerlichen. Die Studenten sind in der Lage, mit Fachexperten aus verschiedenen Bereichen inhaltlich fundiert zu diskutieren und geeignete Lösungsansätze für integrative Problemstellungen zu finden, auszugestalten und umzusetzen. Sie besitzen ein Verständnis für die Zusammenhänge im Unternehmen in technischen, informationstechnischen, wirtschaftliche und organisatorischen Dimensionen."
    },
    {
        "title_de": "Grundlagen Datenbanken",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können nach Abschluss des Moduls Konzepte von Datenbanksystemen vergleichen und erklären. Sie kennen Architekturen von Datenbanksystemen und deren Komponenten. Die Studierenden kennen das Transaktionskonzept von Datenbankanwendungen. Sie können bewerten, welche Datenbanksysteme für den betrieblichen Einsatzzweck geeignet sind. Die Studierenden können anhand einer Prolemstellung und in Zusammenarbeit mit Fachexperten ein Datenbankmodell entwickeln. Sie können Anfragen an ein Datenbanksystem implementieren. Die Studierenden können mithilfe der gängigen Methoden eine relationale Datenbank in geeigneter Normalform entwerfen. Sie können Anfragen an eine Datenbank in SQL formulieren. Sie sind in der Lage die für eine gegebene Aufgabenstellung geeigneten Methoden auszuwählen. - Die Studierenden haben grundlegende Kenntnisse im Bereich Datenbanken und können sich mit Fachexperten disziplinübergreifend austauschen um Datenbanken für betriebliche Anwendungszweckt zu entwerfen."
    },
    {
        "title_de": "Grundlagen praktische Kommunikationstechnik",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können nach Abschluss des ModulsGrundkonzepte der Kommunikationstechnik verstehen und umsetzen - Technologien verstehen und anwenden- Grundprinzipien und Einsatzbereiche von Übertragungsmedien verstehen - Beispielhafte Anwendungen von Kommunikationsnetzen aufbauen Vertiefung der Grundlagen durch praktische Übungen in Kleingruppen Die Studierenden haben die Kompetenz erworben, einfache Problemstellungen analysieren und Lösungen praktisch umsetzen und dokumentieren zu können, sowie konkrete Ergebnisse innerhalb des Teams mit geeigneten Tools erarbeiten und demonstrieren zu können Studierende setzen sich im Team mit ihrer Vorgehensweise bei der Bearbeitung von Lösungsoptionen reflexiv auseinander. Die Studierenden haben grundlegende Kenntnisse in den angegebenen Fachgebieten dieses Moduls und können sich an fachlichen Gesprächen und Diskussionen beteiligen sowie Anforderungen kommunizieren."
    },
    {
        "title_de": "Grundlagen Web Engineering",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben nach Abschluss des Moduls folgende Fachkompetenzen erworben: Die Studierenden haben nach Abschluss des Moduls folgende Fachkompetenzen erworben: - Sie kennen nach Abschluss des Moduls den grundlegenden Aufbau moderner Web-Anwendungen und verstehen das Zusammenspiel zwischen JavaScript, CSS und HTML zu Implementierung dynamischer Web-Seiten. - Die Studierenden verstehen das Zusammenspiel von Client- und Server-Anwendung über RESTful APIs und WebSockets und können einfache Protokolle implementieren. - Sie können kleinere Web-Anwendungen selbständig entwerfen, debuggen sowie implementieren und die Perfomanz untersuchen und optimieren. Die Studierenden haben die Kompetenz erworben, einfache Problemstellungen analysieren und Lösungen praktisch umsetzen und dokumentieren zu können, sowie konkrete Ergebnisse innerhalb des Teams mit geeigneten Tools erarbeiten und demonstrieren zu können - Die Studierenden können die gelernten Fach- und Methodenkompetenzen in Verbindung mit verwandten Vorlesungen setzen und abgrenzen. Dies betrifft insbesondere die Lehrinhalte der Vorlesungen Grundlagen praktische Kommunikationstechnik (TM70302), Grundlagen der Programmierung (TM70305), sowie Grundlagen Datenbanken (TM70301)."
    },
    {
        "title_de": "Grundlagen Software Engineering",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können nach Abschluss des Moduls - Ansätze zum Software-Engineering verstehen und umsetzen - Vorgehensmodelle verstehen und anwenden - Methoden des Software-Engineering nutzen sowie diese auf Problemstellungen anwenden Vertiefung der Grundlagen durch praktische Übungen in Kleingruppen Die Studierenden haben die Kompetenz erworben: - Einfache Problemstellungen analysieren und rechnergestützte Lösungen umsetzen und spezifizieren zu können. - Ergebnisse der jeweiligen Phasen in ihren Inhalten und Zielrichtungen erfassen und dokumentieren zu können. - Konkrete Ergebnisse innerhalb der einzelnen Projektphasen mit geeigneten Tools erarbeiten zu können. Die Kompetenz problemlösend und kooperativ zu arbeiten wird gefördert. Die Studierenden setzen sich im Team mit ihrer Vorgehensweise bei der Bearbeitung von Lösungsoptionen zur Softwareentwicklung reflexiv auseinander. Die Studierenden haben grundlegende Kenntnisse in den angegebenen Fachgebieten dieses Moduls und können sich an fachlichen Gesprächen und Diskussionen in der Softwareentwicklung beteiligen sowie eigene Beiträge in deutscher und englischer Sprache beisteuern."
    },
    {
        "title_de": "Grundlagen der Programmierung",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen nach Abschluss des Moduls - Konzepte von Software und Softwareentwicklung - Algorithmen und Datenstrukturen - Kleine Anwendungen in einer Hochsprache - Werkzeuge der Softwareentwicklung und können diese auf kleine Problemstellungen anwenden. Vertiefung der Grundlagen durch praktische Übungen in Kleingruppen Die Studierenden haben die Kompetenz erworben, einfache Problemstellungen zu analysieren und in Programm-Strukturen umzusetzen. Sie können einfache Programme selbst zu erstellen und in interdisziplinären Teams die Umsetzungen von Programmen zu diskutieren. Studierende setzen sich im Team mit ihrer Vorgehensweise bei der Bearbeitung von Lösungsoptionen reflexiv auseinander. Die Studierenden haben grundlegende Kenntnisse in den angegebenen Fachgebieten dieses Moduls und können diese in konketeten Fällen anwenden. Sie können sich an fachlichen Gesprächen und Diskussionen beteiligen sowie eigene Beiträge und Lösungsoptionen beisteuern."
    },
    {
        "title_de": "Fortgeschrittene Konzepte der Programmierung",
        "ects": 5,
        "learning_outcomes_de": "Anwendungskompetenz bezüglich fortgeschrittener Begriffe und Konzepte der Programmierung. Vermittlung der erforderlichen Kenntnisse, um auch fortgeschrittene Konzepte der Programmierung zu verstehen und zu verwenden, die in professionellen APIs und Frameworks (u.a. in den Bereichen IoT, Kommunikationstechnik, Webtechnologie, DS und KI etc.) zur Anwendung kommen. Fähigkeit, sich beliebige weitere programmtechnische Konzepte auf Basis der Vorlesungsinhalte selbst erschließen zu können. Bewältigung der technologischen Komplexität moderner Programmiersprachen und Befähigung zur professionellen fachlichen Kommunikation im Bereich Programmierung, APIs und SWE. Durchdringen und kompetente Nutzung zur Verfügung stehender technologischer Strukturen und Schnittstellen. Fähigkeit zur Beurteilung der Leistungsfähigkeit aktueller Programmiersprachen."
    },
    {
        "title_de": "Technologies for Sustainability Management",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen die Anforderungen an das Management der Nachhaltigkeit und das Zusammenspiel und die Möglichkeiten durch Unterstützung der Technik, um diese Ziele zu erreichen. Studierende lernen vernetzt zu denken und Problemstellungen in einem größeren Kontext der Nachhaltigkeit zu sehen. Sie sind in der Lage, exemplarisch Detailbetrachtungen bzgl. der technischen Umsetzung durchzuführen. Die Studierenden sind in der Lage, grundlegende und praxisorientierte Problemstellungen zum Management der Nachhaltigkeit zu analysieren, Konzepte zu erstellen und in interdisziplinären Teams technische Umsetzungen von Problemstellungen und Lösungsansätzen zu diskutieren. Die Studierenden sind befähigt, einzeln und im Team aktuelle Technologien für eine konkrete Problemlösung auszuwählen und zu bewerten. Sie können die technologischen Konzepte zum Management der Nachhaltigkeit vergleichend darstellen und vor Fach- und fachfremden Publikum anschaulich präsentieren, diskutieren und ihre Meinung angemessen vertreten. Studierende können sich die Technologien zur Unterstützung von Konzepten der Nachhaltigkeit in Planung und Betrieb selbständig aneignen, in der betrieblichen Praxis analysieren, beurteilen und eigene Lösungsvorschläge einbringen sowie diese im Team vertreten, diskutieren und gemeinsam umsetzen."
    },
    {
        "title_de": "Angewandte Managementmethoden",
        "ects": 5,
        "learning_outcomes_de": "Nach erfolgreichem Abschluss des Moduls sind die Studierenden in der Lage, unter Anwendung ihres betriebswirtschaftlichen Wissens Sachverhalte in zentralen betrieblichen Handlungs- und Entscheidungsbereichen zu beschreiben, zu analysieren und zu beurteilen. Die Studierenden verfügen über die Kompetenz, wichtige betriebswirtschaftliche Zusammenhänge zu erkennen, zu beurteilen und an der sachgerechten Entwicklung von Lösungen mitzuwirken. Durch die enge Verzahnung von theoretischen Lerneinheiten und Unternehmensplanspiel erfahren die Studierenden betriebswirtschaftliche Interdependenzen ganzheitlich und erwerben aktiv handelnd die Fähigkeit zur situationsangemessenen und sachgerechten Anwendung ihrer Kenntnisse. Die Studierenden sind in der Lage, im Rahmen einer komplexen Unternehmenssimulation eigenverantwortlich betriebswirtschaftliche Methoden einzusetzen, Lösungsstrategien für komplexe Problemstellungen zu entwickeln und die Möglichkeiten, Grenzen sowie die erzielten Ergebnisse auch im Vergleich zu Wettbewerbern kritisch zu reflektieren. Darüber hinaus sind die Teilnehmer*innen zum Abschluss des Moduls in der Lage, geeignete Methoden anzuwenden um auch mit komplexen Entscheidungssituationen unter Unsicherheit umgehen zu können. Die Studierenden erwerben die Kompetenz im Team Verantwortung zu übernehmen, sich dabei eigenständig weiter zu entwickeln und eigene Standpunkte unter Berücksichtigung des Gesamtunternehmensinteresses zu vertreten. Dabei erwerben die Studierenden die Fähigkeit, Aufgaben sachgerecht in Teilaufgaben zu gliedern, die Teamarbeit zielorientiert zu gestalten und das eigene Vorgehen im Team zu analysieren. Dabei vertiefen sie die Fähigkeit, zeitliche Restriktionen zu managen, mit ambivalenten Entscheidungssituationen umzugehen und ihr eigenes Verhalten kritisch zu reflektieren. Darüber hinaus erwerben sie die Kompetenz, die Interessen verschiedener Anspruchsgruppen (beispielsweise Aktionär*innen, Mitarbeitende, Staat, Kundschaft) bei ihren Entscheidungen multiperspektivisch zu berücksichtigen, Zielkonflikt zu berücksichtigen und diese zum Ausgleich zu bringen. Sie verfügen über die Kompetenz, im Kontext komplexer betrieblicher Problemstellungen die Wechselwirkungen und Implikationen von Entscheidungen zu erkennen und unter Verwendung einer betriebswirtschaftlichen Terminologie mit Fachleuten auch anderer Bereiche zielorientiert zu diskutieren und zukunftsorientierte Lösungen zu finden. Aufgrund der realitätsnahen Simulation von Managementsituationen erwerben die Studierenden die kritische Urteilsfähigkeit sowie das Bewusstsein für die Implikationen des eigenen Handelns im betrieblichen Alltag."
    },
    {
        "title_de": "Stahl- und Spannbetonbau",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können Stahlbeton- und Spannbetonkonstruktionen entwerfen, bemessen und konstruieren. Sie können Nachweise im Grenzzustand der Gebrauchstauglichkeit und im Grenzzustand der Tragfähigkeit führen und beurteilen. Die Studierenden können anhand der erlernten Methoden (Entwurf, Bemessung und Konstruktion) praktische Anwendungen im Stahlbeton- und Spannbetonbau analysieren, beurteilen und entwerfen. - Die Studierenden kennen ihre Einfluss- und Gestaltungsmöglichkeiten innerhalb des Bauprozesses, auch in Bezug auf nachhaltige und ressourcenschondende Konstruktionen."
    },
    {
        "title_de": "Stahl- und Stahlbetonverbundbau",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können Stahl- und Stahlbetonverbundkonstruktionen entwerfen, bemessen und konstruieren. Sie können Nachweise im Grenzzustand der Gebrauchstauglichkeit und im Grenzzustand der Tragfähigkeit führen und beurteilen. Die Studierenden sind in der Lage die erlernten Methoden (Entwurf, Bemessung und Konstruktion) auf praktische Anwendungen im Stahl- und Stahlbetonverbundbau zu übertragen und anzuwenden sowie entsprechende Konstruktionsentwürfe zu entwerfen, zu analysieren und zu beurteilen. - Die Studierende kennen ihre Einfluss- und Gestaltungsmöglichkeiten innerhalb des Bauprozesses auch in Bezug auf nachhaltige und ressourcenschonende Konstruktionen."
    },
    {
        "title_de": "Holzbau und Holzbaukonstruktionen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden besitzen vertiefte Kenntnisse des Ingenieurholzbaus. Sie beherrschen die Methoden zur Berechnung von Brettsperrholzbauteilen. Neben der Bemessung von Anschlüssen können auch die in der Tragwerksplanung relevanten Steifigkeiten der Anschlüsse berechnet werden. Die Studierenden können die erarbeiteten Kenntnisse in einer rechnergestützten Bemessung analysieren. Die Studierenden sind in der Lage reale, konstruktive Probleme im Ingenieurholzbau zu analysieren und Lösungen erarbeiten. Sie können die erarbeiteten Kenntnisse in rechnergestützten Verfahren umsetzen und die Ergebnisse beurteilen. - Die Studierenden verfügen über vertiefte technische Kenntnisse im Ingenieurholzbau, und können dieses in ihre berufliche Praxis verantwortungsvoll einbringen. Durch die erlangten Fachkenntnisse können die Studierenden tragfähige, schlanke, leichte und einfach rückbaubare bzw. sortenrein trennbare Konstruktionen aus Holz entwerfen, die für die Einhaltung statischer Anforderungen, für eine hohe Flächeneffizienz und für die Verbesserung der Kreislaufwirtschaft bzw. die Kaskadennutzung von Holzprodukten förderlich ist."
    },
    {
        "title_de": "Industrie- und Ingenieurbau",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen die Zusammenhänge im Industrie- und Ingenieurbau. Sie können eigenständig die Probleme der beiden Fachgebiete lösen. Die Studierenden können die erarbeiteten Kenntnisse auf praxisnahe Problemstellungen anwenden sowie die erarbeiteten Ergebnisse analysieren und beurteilen. Problemstellungen können in ihrer Vielschichtigkeit durch die Studierenden kommuniziert und diskutiert werden. Durch eine gezielte Bewertung von Informationen können die Studierenden verantwortungsbewusst und kritisch reflektiert Entscheidungen treffen. Die Studierenden können die Problemstellungen von Industrie– und Ingenieurbauten mit effizienten Arbeitsmethoden lösen und ihr Wissen flexibel und verantwortungsbewusst in ihr berufsspezifisches Handeln einbinden und die Prozesse mitgestalten."
    },
    {
        "title_de": "Brandschutzmanagement und Bauen im Bestand",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen die Zusammenhänge der Prozesse und Abläufe im Brandschutz und beim Bauen im Bestand. Sie können entscheiden, wer in welchen Lebenszyklusphasen der Gebäude die Verantwortung übernimmt und kennen die relevanten Beteiligten. Die Studierenden können die erarbeiteten Kenntnisse auf Problemstellungen aus der Praxis anwenden sowie die erarbeiteten Ergebnisse analysieren und beurteilen. Problemstellungen können in ihrer Vielschichtigkeit durch die Studierenden kommuniziert und diskutiert werden. Durch eine gezielte Bewertung von Informationen können die Studierenden verantwortungsbewusst und kritisch reflektierte Entscheidungen treffen. Die Studierenden können die Problemstellungen im Brandschutz und beim Bauen im Bestand mit effizienten Arbeitsmethoden lösen und ihr Wissen flexibel und verantwortungsbewusst in ihr berufsspezifisches Handeln einbinden und Prozesse mitgestalten."
    },
    {
        "title_de": "Technische Gebäudeausrüstung und Gebäudeautomation",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen die Zusammenhänge der Komplexität der Gebäudeautomation und der technischen Gebäudeausrüstung in Objekten. Sie können entscheiden, wer in welchen Lebenszyklusphasen der Objekte die Verantwortung für die Systeme übernimmt und kennen die Prozesse und die Beteiligten. Die Studierenden können die erarbeiteten Kenntnisse im betrieblichen Umfeld anwenden sowie die erarbeiteten Ergebnisse analysieren und beurteilen. Die komplexen Problemstellungen können in ihrer Vielschichtigkeit durch die Studierenden kommuniziert und diskutiert werden. Durch eine gezielte Bewertung von Informationen können die Studierenden verantwortungsbewusst und kritisch reflektierte Entscheidungen treffen. Die Studierenden können die Herausforderungen von Bau-, Betriebs- und Betreiberprozessen mit effizienten Arbeitsmethoden lösen und ihr Wissen flexibel und verantwortungsbewusst in ihr berufsspezifisches Handeln einbinden und Prozesse und Systeme mitgestalten."
    },
    {
        "title_de": "Facility Management und Digitalisierung",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen die Zusammenhänge des Bauprozesses, des nachhaltigen Betriebs sowie desFacility Managements von Liegenschaften. Ferner verstehen die Studierenden die Zusammenhänge derDigitalisierungsprozesse im Facility- und Immobilienmanagement. Sie können entscheiden, wer in welchenLebenszyklusphasen der Gebäude die Verantwortung übernimmt und wie hierbei Softwarelösungen nützlichsein können. Die Studierenden kennen die Abläufe, die am Bau Beteiligten und die Grenzen des Einsatzesvon Softwarelösungen sowie die Herausforderungen der Digitalisierungsprozesse. Die Studierenden können die erarbeiteten Kenntnisse im betrieblichen Umfeld anwenden sowie dieerarbeiteten Ergebnisse analysieren und beurteilen. Die Studierenden sind in der Lage komplexe Herausforderungen im Berufsalltag in ihrer Vielschichtigkeit zukommunizieren und zu diskutieren. Durch eine gezielte Bewertung von Informationen können dieStudierenden verantwortungsbewusst und kritisch reflektierte Entscheidungen treffen Die Studierenden können die Problemstellungen von Bau-, Betriebs- und Betreiberprozessen mit effizientenund IT-gestützten Arbeitsmethoden lösen und ihr Wissen flexibel und verantwortungsbewusst in ihrberufsspezifisches Handeln einbinden und Prozesse mitgestalten."
    },
    {
        "title_de": "Verkehrsmodellierung und Verkehrsmanagement",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können Datengrundlagen für Verkehrsmodelle erheben, Verkehrsmodelle konzipieren und deren Ergebnisse auswerten. Die Studierenden sind in der Lage, selbstständig Lichtsignalanlagen auf städtischen Straßen, aber auch entsprechende Steuerungsmaßnahmen auf Autobahnen zu planen und zu koordinieren. Die Studierenden können anhand der wesentlichen Methoden Verkehrsmodelle selbstständig planen und Verkehrsmanagementsysteme schaffen und auf ihre Funktionalität prüfen. - -"
    },
    {
        "title_de": "Betrieb von Straßen und Straßenverkehrsanlagen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden haben grundlegende Kenntnisse über die ganzheitliche ingenieurmäßige Behandlung der Straßeninfrastruktur, bestehend aus dem Entwurf, dem Bau, der Ausstattung und dem Betrieb von Straßen, sowie über die im Straßenkörper befindlichen Medien. Die Studierenden verstehen die Wechselwirkungen zu allen maßgebenden Randbedigungen, z. B. zum Umweltschutz, zur stadttechnischen Infrastruktur, zur Wirtschaftlichkeit und zur Verkehrssicherheit. Ebenso sind sie mit der Einheit von Planung, Bau und Betrieb und der Notwendigkeit daraus resultierender, aufeinander abgestimmter Gesamtlösungen vertraut. Die Studierenden kennen die wesentlichen Methoden der Erhaltung von Straßen und Straßenverkehrsanlagen und können diese in der betrieblichen Praxis anwenden und kritisch reflektieren. - -"
    },
    {
        "title_de": "Versorgungs- und Entsorgungsnetze",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die wesentlichen Komponenten von Ver- und Entsorgungsnetzen, wie Strom-, Gas-, Wasserversorgung, Abwasserleitungen, Leitung, Planung und Vergabe und Betrieb von Wasser und Abwassernetzen. Sie sind in der Lage diese zu beschreiben und grundlegende Netzberechnungen durchzuführen, zu analysieren und zu beurteilen. Die Studierenden kennen die wesentlichen Methoden der Planung und des Betriebs von Ver- und Entsorgungsnetzen und können diese situationsangemessen einsetzen und kritisch reflektieren. - -"
    },
    {
        "title_de": "Bau und Betrieb von Schienenverkehrsanlagen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die wesentlichen Bestandteile von Schienenverkehrsanlagen, fahrdynamische Grundlagen, Technik und Systemeigenschaften der Schienenverkehrsanlagen, Unterhaltung und Erhaltung. Sie verfügen über grundlegende Kenntnisse des Baus und des Betriebs von Bahnsystemen und können diese in der betrieblichen Praxis umsetzen. Die Studierenden beherrschen die grundlegenden Methoden zur Planung von schienengebundenen Verkehrsanlagen und können diese situationsangemessen und zielführend in der betrieblichen Praxis einsetzen. - -"
    },
    {
        "title_de": "Umwelt und Nachhaltigkeit",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, nachhaltige Bauinstandsetzung und Bauvorhaben umweltgerecht zu planen und umzusetzen. Die Studierenden wissen, wann, welche Maßnahmen zur erfolgreichen Durchführung eines Bauprojektes mit Blick auf Umwelt und Nachhaltigkeit getroffen werden müssen. - Bauingenieurwissenschaftliche Problemstellungen können durch die Studierenden fachlich richtig kommuniziert und diskutiert werden. Durch eine gezielte Bewertung von Informationen können die Studierenden verantwortungsbewusst und kritisch denken. -"
    },
    {
        "title_de": "Planungsprozesse und Lean Management",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden kennen die Planungsprozesse innerhalb der AHO-Projektstufen und verstehen die Arbeitsweise integraler Planungsteams. Sie verstehen die Grundprinzipien des Lean Management, die aktuellen Strömungen und Ansätze des Lean Construction sowie die Grundsätze des nachhaltigen Bauens. Die Studierenden beherrschen die wesentlichen Planungsmethoden und können die Ansätze des Lean Management bzw. Lean Construction und des nachhaltigen Bauens selbständig anwenden und in die betriebliche Praxis übertragen. - -"
    },
    {
        "title_de": "Baurecht",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen die wesentlichen rechtlichen Rahmenbedingungen und werden mit dem Zustandekommen und dem Durchführen von Bauverträgen vertraut gemacht. Sie verstehen die für die Praxis wichtigen Bestimmungen aus den einschlägigen Regelwerken (BGB, VOB, HOAI, BauGB etc.). Die Studierenden können die erarbeiteten Kenntnisse auf Problemstellungen des betrieblichen Umfeld anwenden sowie die erarbeiteten Ergebnisse analysieren und beurteilen. Problemstellungen können durch die Studierenden fachlich richtig kommuniziert und diskutiert werden. Durch eine gezielte Bewertung baurechtlicher Rahmenbedingungen sind die Studierenden ihre eigene berufliche Praxis kritisch zu reflektieren und verantwortungsbewusst zu handeln. Das Fachwissen aus verschiedenen Bereichen des Baurecht ist vertieft zusammengeführt und kann bei konkreten Bauverträgen, Baugenehmigungen, Vergabe von Bauleistungen oder Bauaufträgen angewandt werden."
    },
    {
        "title_de": "Projektmanagement Hoch- und Industriebau",
        "ects": 5,
        "learning_outcomes_de": "Kennenlernen des Projektmanagements in allen Phasen der Projektabwicklung. Dabei wird auf die Besonderheiten bei den verschiedenen Gewerken eingegangen denen stets besondere Beachtung geschenkt werden muss (Rohbau - Gründung, Tragwerk, Fertigteileinsatz, Zusammenwirken der Baustoffe Beton-Stahl-Mauerwerk-Holz, Ausbau - Anforderungen an Brandschutz, Wärmeschutz, Schallschutz, TGA - Verwendung von energiesparenden Komponenten und Optimierung der Betriebskosten. Aufzeigen wesentlicher Geschäftsprozesse einer Werksplanung. Kenntnisse aus den Projektabwicklungen nationaler und internationaler Hochbauprojekten, Visualisierungs- und Darstellungsmöglichkeiten von Terminplänen, Prozessen und Abläufen. Die Studierenden können die erarbeiteten Kenntnisse auf praxisnahe Problemstellungen anwenden sowie die erarbeiteten Ergebnisse analysieren und beurteilen. Wissenschaftliche Auseinandersetzung mit den Inhalten der technischen Vorlesung zur Stärkung der Fachkompetenz im Projektmanagement. Fachliche Kompetenz zur Festigung der Argumentation im technischen Projektmanagement. Problemstellungen können durch die Studierenden fachlich richtig kommuniziert und diskutiert werden. Durch eine gezielte Bewertung von Informationen können die Studierenden verantwortungsbewusst und kritisch denken. Bewältigung komplexer technisch-wirtschaftlicher Sachverhalte im Hochbau und Industriebau. Das Fachwissen aus allen Bereichen des Projektmanagement im Hoch- und Industriebau ist vertieft zusammengeführt undkann in konkreten Bauvorhaben umgesetzt werden. Die Studenten wissen, wann welche Maßnahmen zur erfolgreichen Durchführung eines Bauprojektes getroffen werden müssen."
    },
    {
        "title_de": "Energieeffizientes Bauen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden können praktische und theoretische Problemstellungen beim Bau mit energieeffizienten, betriebswirtschaftlichen und rechtlichen Aspekten verknüpfen. Die Studierenden sind mit der Sprache des Fachgebietes vertraut, verstehen aber auch die Notwendigkeit in der Kommunikation für eindeutige Definitionen der hinter den Begrifflichkeiten verborgenen Fachinhalte zu sorgen. Sie erhalten die Kompetenz, um sich Informationen zu beschaffen, zu strukturieren und zu bearbeiten. Die Ergebnisse lernen Sie richtig zu interpretieren und in geeigneter Form zu präsentieren. In Zusammenarbeit mit Kommilitonen und den Referenten erarbeiten Sie ein energieeffizientes Gebäude. -"
    },
    {
        "title_de": "Building Information Modeling",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen BIM als ganzheitliche Methode, um die Produktivität in der Bauwirtschaft zusteigern, die Qualität in der Fertigung zu verbessern und die Transparenz bereits in frühen Projektphasen zuerhöhen Die Studierenden beherrschen den Umgang mit einem Geoinformationssystem und können Geodatenerstellen, bearbeiten sowie visualisieren. Darüber hinaus können sie Berechnungen mithilfe desGeoinformationssystems durchführen. Die Studierenden kennen die unterschiedlichen Entwicklungsstufen der BIM-Methodik. Sie kennen Softwareund Datenbanksysteme für die Abwicklung von Bauprojekten nach der BIM-Methodik. Sie sind in der LageBIM im Planungsprozess einzusetzen und BIM-Werkzeuge hinsichtlich ihrer technischen Grundlagen undFähigkeiten zu Darüber hinaus beherrschen die Studierenden die wesentlichen Methoden im Umgang mitGeoinformationssystemen, verstehen den Umgang mit Geodaten und können eigenständig Berechnungenmit Geodaten durchführen sowie die Ergebnisse verständlich darstellen. Die Studierenden können Aufgaben selbständig erarbeiten und deren Ergebnisse in angemessener Weisevorstellen. -"
    },
    {
        "title_de": "Business Decision based Management",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über fachlich fundierte theoretische und praktische Kenntnisse in den Bereichen Entscheidungsfindung für Manager*innen, Gestaltung ganzheitlicher Unternehmenssysteme, insbesondere der Strategieentwicklung für technologieorientierte Betriebseinheiten, sowie Planung und Steuerung anhand eines praxisorientierten Planspiels oder Fallbeispiels. Vor diesem Hintergrund werden Entscheidung herbeigeführt, bewertet und evaluiert. Die betrieblichen Anforderungen werden hierbei als Transferleistung berücksichtigt und kritisch hinterfragt. Sofern im konkreten Einzelfall erforderlich werden unterschiedliche betriebliche Aspekte miteinander in einen zielorientierten Kontext gebracht bzw. forschend untersucht und praxisorientiert entwickelt. Die Studierenden kennen das Potenzial moderner betrieblicher Entscheidungsfindung und der Gestaltung von ganzheitlichen Unternehmenssystemen. Sie können ihre Kenntnisse auf neue Fragestellungen übertragen. Die kaskadierte Vorgehensweise der methodischen Lösungsfindung beinhaltet dabei die Schritte Methodengegenüberstellung und deren Auswahl, ggf. Anpassung der geeigneten Methodik oder direkte Anwendung auf den konkreten betrieblichen Kontext sowie die kritische Reflexion der Ergebnisse aus der Methodendurchführung. - -"
    },
    {
        "title_de": "Mega Trend Management",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über fachlich fundierte theoretische und praktische Kenntnisse in den Bereichen Digital Transformation Management, Sustainable Technology Lifecycle Management, Technology Cost Management sowie Globalization Management. Dabei werden insbesondere Themen aus den Feldern Digitale Fabrik und Additive Fertigung, Product Lifecycle Management, Nachhaltigkeitsmanagement und Technikfolgenabschätzung, produktionswirtschaftliches Controlling am PLC sowie Handels-, Logistik-, Datenschutz- und Vertragsrecht behandelt und deren moderne betriebliche Anwendung erörtert. Vor diesem Hintergrund werden Entscheidungen herbeigeführt, bewertet und evaluiert. Die betrieblichen Anforderungen werden hierbei als Transferleistung berücksichtigt und kritisch hinterfragt. Sofern im konkreten Einzelfall erforderlich werden unterschiedliche betriebliche Aspekte miteinander in einen zielorientierten Kontext gebracht bzw. forschend untersucht und praxisorientiert entwickelt. Die Studierenden kennen das Potenzial der Mega Trends und erlernen Techniken zur Abschätzung bzw. Nutzbarmachung dieser für die eigene betriebliche Organisationseinheit. Die kaskadierte Vorgehensweise der methodischen Lösungsfindung beinhaltet dabei die Schritte Methodengegenüberstellung und deren Auswahl, ggf. Anpassung der geeigneten Methodik oder direkte Anwendung auf den konkreten betrieblichen Kontext sowie die kritische Reflexion der Ergebnisse aus der Methodendurchführung. - Die Technologiefolgenabschätzung der Mega Trends aus Sicht der Industriesoziologie sowie konkreter betrieblicher bzw. nachhaltiger Richtung ist zentraler Bestandteil des spezifischen Qualifikationsprofils dieses Moduls. Somit können die Studierenden sich hinsichtlich anzustrebender Werte, Ethik und Unternehmensphilosophie abgewogen positionieren."
    },
    {
        "title_de": "Human Resources and Organizations Management",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über fachlich fundierte theoretische und praktische Kenntnisse in den drei Bereichen Human Resources Management, Leadership and Conflict Management sowie Integrated Technology Enterprise Systems. Dabei werden insbesondere Themen aus den Feldern Kompetenz-Sourcing und Anforderungsprofile für (Produktions-)Mitarbeiter*innen, Change-Management / Transformational Leadership und nachhaltige Führungstechniken sowie ganzheitliche Unternehmenssysteme behandelt und deren moderne betriebliche Anwendung erörtert. Vor diesem Hintergrund werden Entscheidung herbeigeführt, bewertet und evaluiert. Die betrieblichen Anforderungen werden hierbei als Transferleistung berücksichtigt und kritisch hinterfragt. Sofern im konkreten Einzelfall erforderlich werden unterschiedliche betriebliche Aspekte miteinander in einen zielorientierten Kontext gebracht bzw. forschend untersucht und praxisorientiert entwickelt. Die Studierenden kennen das Potenzial moderner betrieblicher Methodiken zur Führung von Menschen, insbesondere in Technikbereichen. Gesprächsführungstechniken, Personalorganisation, nachhaltige Führungstechniken, Konfliktmanagement u.a., gepaart mit rechtlichen Fragestellungen zielen auf die praxisorientierte Anwendung gelebter Führung ab. Die kaskadierte Vorgehensweise der methodischen Lösungsfindung beinhaltet dabei die Schritte Methodengegenüberstellung und deren Auswahl, ggf. Anpassung der geeigneten Methodik oder direkte Anwendung auf den konkreten betrieblichen Kontext sowie die kritische Reflexion der Ergebnisse aus der Methodendurchführung. Der Mensch als zentrale Größe in allen betrieblichen sowie überbetrieblichen Prozessen steht im Mittelpunkt der Wertevermittlung dieses Moduls. Hiermit wird das Fundament gelegt, damit die Studierenden auf gruppendynamische Rollen und Prozesse sowie Grundelemente und Phasen der Teamentwicklung vorbereitet werden. Die Diskussion der Abwägung des Einsatzes von Mensch gegenüber Technologie, Arbeitsökosysteme in bereichsübergreifenden betrieblichen Strukturen und deren Anwendung im interkulturellen Umfeld werden vor dem Hintergrund markt- und technologiebezogener Fragestellungen thematisiert. Somit können die Studierenden sich hinsichtlich anzustrebender Werte, Ethik und Unternehmensphilosophie abgewogen positionieren."
    },
    {
        "title_de": "Applied Technology",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über fachlich fundierte theoretische und praktische Kenntnisse über verschiedene technische Managementfunktionen und -ebenen. Im Vordergrund stehen dabei die frühen Phasen der Produktentwicklung mit den Schwerpunkten Entwicklungsprojektleitung, Entwicklungsmanagement, virtuelle Elemente im R&D-Umfeld sowie kostenorientiertes Entwickeln. Es erfolgt insbesondere die Verknüpfung von modernen Softwarelösungen für ein PLC-übergreifenden Engineering. Hier werden vorwiegend entwicklungs- und fertigungsnahe Lösungen vermittelt. Vor diesem Hintergrund werden Entscheidung herbeigeführt, bewertet und evaluiert. Die betrieblichen Anforderungen werden hierbei als Transferleistung berücksichtigt und kritisch hinterfragt. Sofern im konkreten Einzelfall erforderlich werden unterschiedliche betriebliche Aspekte miteinander in einen zielorientierten Kontext gebracht bzw. forschend untersucht und praxisorientiert entwickelt. Die Studierenden kennen das Potenzial moderner Managementtechniken und betrieblicher Softwarelösungen sowie deren Nutzung in unterschiedlichen Bereichen des PLC. Sie können ihre Kenntnisse auf neue Fragestellungen übertragen. Die kaskadierte Vorgehensweise der methodischen Lösungsfindung beinhaltet dabei die Schritte Methodengegenüberstellung und deren Auswahl, ggf. Anpassung der geeigneten Methodik oder direkte Anwendung auf den konkreten betrieblichen Kontext sowie die kritische Reflexion der Ergebnisse aus der Methodendurchführung. Praxisnahe Beispiele und Übungen vermitteln Erfahrung im Umgang mit realen Fragestellungen. Die Studierenden sind in der Lage, Problemstellungen aus dem betrieblichen Umfeld aufzunehmen, zu analysieren und entsprechende Lösungsansätze zu konzeptionieren und Lösungen zu erarbeiten, die direkte oder indirekte Auswirkungen auf die Mitarbeiterschaft besitzen. Die Beschäftigung mit den vermittelten Grundlagen in Verbindung mit Anwendungsmöglichkeiten der verknüpften Inhalte (z.B. für die Nutzung im Bereich Konstruktion, Fertigung, Qualitätsmanagement, Logistik) sind wichtig, um zu Grunde legende Denk- und Arbeitsweisen zu verinnerlichen, die sich auch auf andere Bereiche übertragen lassen. Die Auswirkungen diese Anwendungen sollen von den Studierenden kritisch reflektiert werden können. Hierbei sind insbesondere die Implikationen auch auf das gesellschaftliche Umfeld wichtig. Somit können die Studierenden sich hinsichtlich anzustrebender Werte, Ethik und Unternehmensphilosophie abgewogen positionieren."
    },
    {
        "title_de": "Edge and Future Technology",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über fachlich fundierte theoretische und praktische Kenntnisse über verschiedene moderne und neue Technologien. Dabei werden insbesondere die Lösungsbereitstellungen aus dem Feld der Informatik vermittelt. Softwareengineering, Nutzung großer Datenmengen und die Beachtung der zugehörigen IT -Sicherheit sind dabei zentrale Punkte. Auf der Anwendungsseite stehen die Datenanalyse, Gestaltung von Datenbanken, aber auch die praktische Anwendung im Bereich VR/AR oder dem Prototyping mittels Additiver Fertigungsverfahren. Am Beispiel von CAD/CAM wird die durchgängige Datennutzen im PLC realitätsnah veranschaulicht. Vor diesem Hintergrund werden Entscheidung herbeigeführt, bewertet und evaluiert. Die betrieblichen Anforderungen werden hierbei als Transferleistung berücksichtigt und kritisch hinterfragt. Sofern im konkreten Einzelfall erforderlich werden unterschiedliche betriebliche Aspekte miteinander in einen zielorientierten Kontext gebracht bzw. forschend untersucht und praxisorientiert entwickelt. Die Studierenden kennen das Potenzial moderner betrieblicher Softwarelösungen sowie deren Nutzung in unterschiedlichen Bereichen des PLC. Sie können ihre Kenntnisse auf neue Fragestellungen übertragen. Die Vorstellung der Verknüpfung von CAD und CAM zeigt beispielhaft die Methodik und das Nutzenpotenzial digitaler Fabriken. Die kaskadierte Vorgehensweise der methodischen Lösungsfindung beinhaltet dabei die Schritte Methodengegenüberstellung und deren Auswahl, ggf. Anpassung der geeigneten Methodik oder direkte Anwendung auf den konkreten betrieblichen Kontext sowie die kritische Reflexion der Ergebnisse aus der Methodendurchführung. - -"
    },
    {
        "title_de": "Technology in Practice",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über fachlich fundierte theoretische und praktische Kenntnisse zum technischen Management von Arbeitssystemen in ausgewählten Kernbranchen, z.B. Maschinen- und Anlagenbau, Chemie- und Verfahrenstechnik sowie weiterer Industriefelder. Fabrik-, Betriebsmittel und Logistikplanung sollen Impulse für die Fabrikplanung von Morgen branchenübergreifend vermitteln. Dabei werden unterschiedliche Produktionssysteme aus den Kernbranchen vorgestellt. Vor diesem Hintergrund werden Entscheidung herbeigeführt, bewertet und evaluiert. Die betrieblichen Anforderungen werden hierbei als Transferleistung berücksichtigt und kritisch hinterfragt. Sofern im konkreten Einzelfall erforderlich werden unterschiedliche betriebliche Aspekte miteinander in einen zielorientierten Kontext gebracht bzw. forschend untersucht und praxisorientiert entwickelt. Die Studierenden kennen das Potenzial moderner, nachhaltiger Produktionssysteme sowie deren Nutzung in unterschiedlichen Bereichen des PLC. Sie können ihre Kenntnisse auf neue Fragestellungen übertragen. Die kaskadierte Vorgehensweise der methodischen Lösungsfindung beinhaltet dabei die Schritte Methodengegenüberstellung und deren Auswahl, ggf. Anpassung der geeigneten Methodik oder direkte Anwendung auf den konkreten betrieblichen Kontext sowie die kritische Reflexion der Ergebnisse aus der Methodendurchführung. Das Modul zielt vorwiegend auf die Kernbranchen moderner Wirtschaftszweige ab. Es wird ein übergreifendes Verständnis für Technologie- und Managementfragestellungen aufgebaut. Dabei stehen praxis- und transferorientierte Lehrformen im Vordergrund, die nach Möglichkeit direkt an konkreten Arbeitssystemen vermittelt werden. In diesem Kontext wird auf die praktische Anwendung des Aufbaus von Expertennetzwerken abgezielt. Bei der Diskussion von technischen Arbeitssystemen soll von den Teilnehmenden hinterfragt werden können, inwiefern nachhaltige Vorgehensweisen im konkreten Fall vorliegen. Dadurch erfolgt die Schulung hinsichtlich des wichtigen Aspektes der Technologiefolgenabschätzung konservativer, moderner und zukünftiger Technologien und deren Management. Somit können die Studierenden sich hinsichtlich anzustrebender Werte, Ethik und Unternehmensphilosophie abgewogen positionieren."
    },
    {
        "title_de": "Global Executive Engineering",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verfügen über fachlich fundierte und insbesondere praktische Kenntnisse zu den spezifischen Inhalten des Tätigkeitsfeldes Executive Engineering. Dieses Modul fokussiert auf die Kerninhalte global agierender Unternehmen. Vor diesem Hintergrund werden Entscheidung herbeigeführt, bewertet und evaluiert. Die betrieblichen Anforderungen werden hierbei als Transferleistung berücksichtigt und kritisch hinterfragt. Sofern im konkreten Einzelfall erforderlich werden unterschiedliche betriebliche Aspekte miteinander in einen zielorientierten Kontext gebracht bzw. forschend untersucht und praxisorientiert entwickelt. Das Potenzial der Studierenden hinsichtlich zielorientiertem internationalen Auftreten und globalen, interkulturellem Management wird an unterschiedlichen Destinationen und Arbeitssystemen entwickelt und ausgebaut. Die kaskadierte Vorgehensweise der methodischen Lösungsfindung beinhaltet dabei die Schritte Methodengegenüberstellung und deren Auswahl, ggf. Anpassung der geeigneten Methodik oder direkte Anwendung auf den konkreten betrieblichen Kontext sowie die kritische Reflexion der Ergebnisse aus der Methodendurchführung. Das Modul stärkt die Persönlichkeitsentwicklung der Studierenden hinsichtlich des Umgangs mit unterschiedlichsten Menschen aus den unterschiedlichsten Kulturen. Im Rahmen dieses Modul wird eine breite Sichtweise auf unterschiedlichste Kulturen sowohl durch Durchführung von Vor-Ort-Istanalysen als auch durch die nachhaltige Reflexion potenzieller Optimierungen erreicht. Die Studierenden können ihre Ergebnisse im Einklang mit ihren Werten und der individuellen Unternehmenspolitik umsetzen. -"
    },
    {
        "title_de": "Studienarbeit",
        "ects": 10,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, sich unter geringer Anleitung in ein komplexes Gebiet einzuarbeiten und dabei auch fachbereichsübergreifende Aspekte zu berücksichtigen. Sie haben gelernt, Problemstellungen zu analysieren, relevante Information von weniger wichtigen zu trennen und darauf aufbauend Lösungsalternativen zu erarbeiten. Sie sind in der Lage Besonderheiten eines Themas zu erkennen und ihre Vorgehensweise entsprechend anzupassen. Diese können sie bewerten und die Auswahl des gewählten Lösungsweges technisch und wirtschaftlich sowie auf wissenschaftlicher Ebene begründen. Die Studierenden können bestehendes Fachwissen gezielt durch wissenschaftliches Recherchieren und die Anwendung praktischer Erfahrungen und Kenntnisse zu Expertenwissen erweitern. Sie sind in der Lage eine wissenschaftliche Arbeit effizient zu steuern und wissenschaftlich korrekt zu dokumentieren. Sie verstehen und verwenden die Terminologie des Fachgebietes. Im Rahmen der Studienarbeit begründen die Studierenden ihr methodisches Vorgehen und setzen die passenden Versuchs- bzw. Forschungsmethoden zur Problemlösung ein. Die Studierenden können weitgehend selbstständig Problemstellungen bearbeiten und strukturiert lösen. Sie sind in der Lage auch im komplexen Umfeld Verantwortung für ein Thema zu übernehmen Entscheidungen zu gründen und zu vertreten. Die Studierenden sind Experten auf dem erweiterten Gebiet der Studienarbeit und können aufgrund ihres Wissens Probleme, Lösungen und Ideen unter Fachleuten austauschen. Die Studierenden sind in der Lage sozial-ethische Konsequenzen zu berücksichtigen, die sich aus den Ergebnissen ihrer Arbeit ergeben können. Die Studierenden können Problemstellungen durch Einsatz effizienter Arbeitsmethoden lösen. Sie können ihr Wissen auch in ungewohnten Situationen anwenden, multidisziplinäre Zusammenhänge erfassen und diesen entsprechend die erlernten Methoden auf neue Arbeitsfelder adaptieren. Die Studierenden sind in der Lage, die Ergebnisse ihrer Arbeit einem Gremium zu präsentieren und dieses von der Qualität der Arbeit und den Lösungsansätzen zu überzeugen."
    },
    {
        "title_de": "Masterarbeit",
        "ects": 25,
        "learning_outcomes_de": "Die Studierenden sind in der Lage, sich selbstständig in ein komplexes Gebiet einzuarbeiten und dabei auch fachbereichsübergreifende Aspekte zu berücksichtigen. Sie haben gelernt, Problemstellungen zu analysieren, relevante Information von weniger wichtigen zu trennen und darauf aufbauend Lösungsalternativen zu erarbeiten. Sie sind in der Lage Besonderheiten eines Themas zu erkennen und ihre Vorgehensweise entsprechend anzupassen. Diese können sie bewerten und die Auswahl des gewählten Lösungsweges technisch und wirtschaftlich sowie auf wissenschaftlicher Ebene begründen. Die Studierenden können bestehendes Fachwissen gezielt durch wissenschaftliches Recherchieren und die Anwendung praktischer Erfahrungen und Kenntnisse zu Expertenwissen erweitern. Sie sind in der Lage eine wissenschaftliche Arbeit effizient zu steuern und wissenschaftlich korrekt zu dokumentieren. Sie verstehen und verwenden die Terminologie des Fachgebietes. Im Rahmen der Masterarbeit begründen die Studierenden fundiert ihr methodisches Vorgehen und setzen die passenden Versuchs- bzw. Forschungsmethoden zur Problemlösung ein Die Studierenden können auch komplexe Themenstellungen in einem Team bearbeiten. Sie sind in der Lage für den Erfolg des Teams soziale Strukturen zu erfassen und ggf. mit entsprechenden Problemen konstruktiv umzugehen. Sie können sozial-ethische Konsequenzen, die sich aus den Ergebnissen ihrer Arbeit ergeben können, in der Lösungsauswahl berücksichtigen. Die Studierenden können Problemstellungen durch Einsatz effizienter Arbeitsmethoden lösen. Sie können ihr Wissen auch in ungewohnten Situationen anwenden, multidisziplinäre Zusammenhänge erfassen und diesen entsprechend die erlernten Methoden auf neue Arbeitsfelder adaptieren. Die Studierenden sind in der Lage, die Ergebnisse ihrer Arbeit einem Gremium zu präsentieren und dieses von der Qualität der Arbeit und den Lösungsansätzen zu überzeugen."
    },
    {
        "title_de": "Projektarbeit",
        "ects": 15,
        "learning_outcomes_de": "Die Studierenden verfügen über vertiefte Kenntnisse zu spezifischen Fachthemen sowie der funktionalorganisatorischen Zusammenhänge in ihrem Unternehmen. Sie sind in der Lage, Lösungsansätze komplexerpraktischer Problemstellungen zu konzipieren, zu analysieren und zu beurteilen. Die Studierenden können mit Abschluss des Moduls vielgestaltige und interdependentePraxisherausforderungen unter Anwendung angemessener Methoden vorausschauend, umsichtig und strukturiert lösen. Die Möglichkeiten der Praktikabilität sowie die Grenzender eingesetzten Methoden hinterfragen sie jederzeit kritisch. Die Studierenden haben Erfahrungswissen imUmgang mit unterschiedlichen Methoden erworben, insbesondere zur Adaption von theoretischen Konzeptenauf die betriebliche Praxis. Die Studierenden gehen die Projektarbeit planerisch und lösungsorientiert an. Sie zeichnen sich durchVerbindlichkeit und Zuverlässigkeit aus. Neuerungen und Innovationen gegenüber sind sie aufgeschlossen.Sie sind fähig, aus dem Zusammenwirken von Theorie und Praxis Impulse zur betrieblichenWeiterentwicklung zu geben. Die Studierenden haben ein tiefgehendes Verständnis für übergreifende Zusammenhänge und Prozesseentwickelt. Auch in unklaren Situationen sind sie in der Lage, den Überblick zu behalten und unterHinzuziehung ihrer theoretischen Kenntnisse angemessen und eigenverantwortlich zu handeln."
    },
    {
        "title_de": "Fachübergreifende Kompetenzen",
        "ects": 5,
        "learning_outcomes_de": "Die Studierenden verstehen die Bedeutung von Fachübergreifenden Kompetenzen für Studium und Beruf. In den gewählten Seminarthemen können sie die jeweiligen Fachinhalte eigenständig und mit kritischem Verständnis anwenden. Die Studierenden können die Methoden und Techniken der gewählten Seminare situations- und identitätsangemessen in Studium und Beruf einsetzen. Sie sind in der Lage, in entsprechenden Situationen den Einsatz von Methoden der Kommunikation, der Führung und des Selbstmanagements zu planen und erfolgreich durchzuführen. Die Studierenden sind für ihre eigenen Stärken und Schwächen in Kommunikation, Führung und Selbstmanagement sensibilisiert und erkennen die Relevanz für aktuelle und zukünftige berufliche und private Herausforderungen. Aufgrund des interdisziplinären Seminarsettings lernen die Studierenden verschiedene Sichtweisen auf die Seminarthemen kennen, zu tolerieren und den eigenen Standpunkt zu reflektieren. Sie sind in der Lage, Kommunikations- und Konfliktfähigkeiten selbstständig weiter zu entwickeln. Die Studierenden setzen sich mit ihrem eigenen Verhalten auseinander und reflektieren strukturelle und organisatorische Aspekte in ihrem beruflichen Umfeld. Sie sind in der Lage, einzeln oder im Team erfolgreich zu agieren."
    }
]